<template lang="pug">
.listTabs
	.myTab(:class="{'activeTab':tab === 0}" @click="$_clickTab(0)") Город
	.myTab(:class="{'activeTab':tab === 1}" @click="$_clickTab(1)") Зонирование
.positionRelative
	.fillScreen(:id="$props.idMap")
.titleName(v-if="openSelectedPoint") {{selectedPoint.name}}
.blockInfoData(v-if="openSelectedPoint")
	.greyBlock
		.statusWithImg
			img(src="/img/good.svg")
			| Положительные точки
		.greyBlockPercent {{selectedPoint.good}}
		ul.transitionBlockText(:class="{'showBlockText':openMore[0]}")
			li
				span {{selectedPoint.park}} -
				| Парки
			li
				span {{selectedPoint.educational}} -
				| Объекты образования
			li(v-if="selectedPoint.good-(selectedPoint.park + selectedPoint.educational)")
				span {{selectedPoint.good-(selectedPoint.park + selectedPoint.educational)}} -
				| Другое
		.showMore(:class="{'showMoreActive':openMore[0]}" @click="openMore[0] = !openMore[0]") {{openMore[0]?'Скрыть данные':'Показать данные'}}
			img(src="/img/arrow.svg")
	.greyBlock
		.statusWithImg
			img(src="/img/bad.svg")
			| Отрицательные
		.greyBlockPercent {{selectedPoint.bad}}
		ul.transitionBlockText(:class="{'showBlockText':openMore[1]}")
			li
				span {{selectedPoint.alcohol}} -
				| Алкогольные магазины
			li
				span {{selectedPoint.cigarettes}} -
				| Табачные магазины
			li(v-if="selectedPoint.bad-(selectedPoint.cigarettes + selectedPoint.alcohol)")
				span {{selectedPoint.bad-(selectedPoint.cigarettes + selectedPoint.alcohol)}} -
				| Другое
		.showMore(:class="{'showMoreActive':openMore[1]}" @click="openMore[1] = !openMore[1]") {{openMore[1]?'Скрыть данные':'Показать данные'}}
			img(src="/img/arrow.svg")
	.greyBlock(v-if="tab === 0")
		.statusWithImg
			img(src="/img/star.svg")
			| Рейтинг города
		.greyBlockPercent {{selectedPoint.city.rating}}%
		.legendColor
			div
				span.colorBlock(:style="`background:${$root.colorStatus[3]}`")
				span.nameColor Отлично
			div
				span.colorBlock(:style="`background:${$root.colorStatus[2]}`")
				span.nameColor Хорошо
			div
				span.colorBlock(:style="`background:${$root.colorStatus[1]}`")
				span.nameColor Удовл.
			div
				span.colorBlock(:style="`background:${$root.colorStatus[0]}`")
				span.nameColor Не удовл.
	.greyBlock
		.statusWithImg
			img(src="/img/star.svg")
			| {{tab===0?'Рейтинг района':'Рейтинг зоны'}}
		.greyBlockPercent {{selectedPoint.rating}}%
		.legendColor
			div
				span.colorBlock(:style="`background:${$root.colorStatus[3]}`")
				span.nameColor Отлично
			div
				span.colorBlock(:style="`background:${$root.colorStatus[2]}`")
				span.nameColor Хорошо
			div
				span.colorBlock(:style="`background:${$root.colorStatus[1]}`")
				span.nameColor Удовл.
			div
				span.colorBlock(:style="`background:${$root.colorStatus[0]}`")
				span.nameColor Не удовл.
</template>

<script>
import "leaflet/dist/leaflet.css";
import L from "leaflet";
import { polygonToCells, cellToBoundary, cellToLatLng, getHexagonAreaAvg, UNITS} from 'h3-js'
let map, hexLayer;

const GeoUtils = {
	EARTH_RADIUS_METERS: 6371000,

	degreesToRadians: (d) => d * Math.PI / 180,

	getDistanceOnEarthInMeters: (lat1, lon1, lat2, lon2) => {
		const lat1Rad  = GeoUtils.degreesToRadians(lat1);
		const lat2Rad  = GeoUtils.degreesToRadians(lat2);
		const lonDelta = GeoUtils.degreesToRadians(lon2 - lon1);
		const x = Math.sin(lat1Rad) * Math.sin(lat2Rad) +
			Math.cos(lat1Rad) * Math.cos(lat2Rad) * Math.cos(lonDelta);
		return GeoUtils.EARTH_RADIUS_METERS * Math.acos(Math.max(Math.min(x, 1), -1));
	}
};

const h3BoundsToPolygon = (lngLatH3Bounds) => {
	lngLatH3Bounds.push(lngLatH3Bounds[0]); // "close" the polygon
	return lngLatH3Bounds;
};
export default {
	emits:['changeTab'],
	props:{
		idMap:String,
		data:{
			type:Object,
			default:()=>{
				return {}
			}
		},
		keyUpdate:Number,
		size:Number,
		tab:Number,
		city:String
	},
	data(){
		return{
			searchH3Id: undefined,
			gotoLatLon: undefined,
			centerGeo: [0,0],
			keysData:[],
			geometryGeoJSON:null,
			selectedPoint:{good:0,educational:0,bad:0,alcohol:0,cigarettes:0,rating:0},
			openSelectedPoint:false,
			activeElementClick:null,
			openMore:[false,false],
			savedRequest:{
				'Екатеринбург':{
					send:{
						"points": [
							[
								56.87115307045309,
								60.76575145670914
							],
							[
								56.83225389873929,
								60.533178097130886
							],
							[
								56.82559509768509,
								60.587303302079796
							],
							[
								56.85927256966394,
								60.45975775609791
							],
							[
								56.83079273600904,
								60.61828650782797
							],
							[
								56.81445589390528,
								60.56790185874839
							],
							[
								56.884883829936655,
								60.471447251159326
							],
							[
								56.8400672022862,
								60.579647535563645
							],
							[
								56.87373103492598,
								60.45205496831576
							],
							[
								56.90787616482445,
								60.46764297804402
							],
							[
								56.87011950037915,
								60.66502059892563
							],
							[
								56.86711268187029,
								60.506234401575675
							],
							[
								56.858993270542086,
								60.64557453589677
							],
							[
								56.82892757678897,
								60.56024187385101
							],
							[
								56.85596396348943,
								60.48683934279886
							],
							[
								56.829273327412395,
								60.70340757948479
							],
							[
								56.88157408209423,
								60.49854510498678
							],
							[
								56.88718477934677,
								60.6729007565
							],
							[
								56.81815065362886,
								60.68396825092057
							],
							[
								56.90456854880477,
								60.49475556322356
							],
							[
								56.82773425585477,
								60.4596698876463
							],
							[
								56.87042494082352,
								60.479145843266345
							],
							[
								56.86676620419637,
								60.69210732592778
							],
							[
								56.85564364407127,
								60.67265435227342
							],
							[
								56.89494810031112,
								60.71947273528395
							],
							[
								56.81296893484616,
								60.65298100925091
							],
							[
								56.80995764751957,
								60.49441410388935
							],
							[
								56.883830697147054,
								60.699998303641685
							],
							[
								56.824423899164096,
								60.486731364734005
							],
							[
								56.89830585796124,
								60.69236827733224
							],
							[
								56.809615106171,
								60.68003142767052
							],
							[
								56.81327051229782,
								60.46736189587732
							],
							[
								56.831072397089265,
								60.761480113413434
							],
							[
								56.86900517075357,
								60.56432079307189
							],
							[
								56.80625512395387,
								60.707079446063595
							],
							[
								56.85409005455774,
								60.757835083833854
							],
							[
								56.90646869255697,
								60.55289105574737
							],
							[
								56.879683825208076,
								60.76971209047652
							],
							[
								56.87680759753463,
								60.6108399563211
							],
							[
								56.86857282642344,
								60.750229017933236
							],
							[
								56.82769564333375,
								60.78854093909719
							],
							[
								56.80288898883784,
								60.734125052695504
							],
							[
								56.86567403450756,
								60.59140774450626
							],
							[
								56.85071538550402,
								60.78491061856109
							],
							[
								56.821107386209995,
								60.51379052679387
							],
							[
								56.90500286225007,
								60.63815212636718
							],
							[
								56.86046967179514,
								60.56040452103173
							],
							[
								56.88014239724969,
								60.5837460643117
							],
							[
								56.83557406292829,
								60.50611198369202
							],
							[
								56.865200641912104,
								60.777313874717336
							],
							[
								56.862575013093284,
								60.43267386268308
							],
							[
								56.8196581290309,
								60.59887301930252
							],
							[
								56.90195551759792,
								60.47924829344827
							],
							[
								56.82485293773375,
								60.629854232243744
							],
							[
								56.80852028475611,
								60.57947067445292
							],
							[
								56.86417708830957,
								60.67659388685641
							],
							[
								56.83413175911099,
								60.59122203669867
							],
							[
								56.86233673423006,
								60.61849232937885
							],
							[
								56.82299349328681,
								60.57181547127473
							],
							[
								56.8611860164907,
								60.51782433972914
							],
							[
								56.84634103586136,
								60.711296358962045
							],
							[
								56.890532693496006,
								60.645800803752365
							],
							[
								56.85003865712875,
								60.498428360940665
							],
							[
								56.82150487356736,
								60.65691243708582
							],
							[
								56.87564894869907,
								60.51013983772084
							],
							[
								56.83103845569165,
								60.43260610730889
							],
							[
								56.86450116661437,
								60.490739653774135
							],
							[
								56.89864500683442,
								60.506357001620366
							],
							[
								56.860820906611686,
								60.70367670621074
							],
							[
								56.816316609342834,
								60.625928202545786
							],
							[
								56.84969970851413,
								60.684222850936266
							],
							[
								56.889001546692604,
								60.731046773351316
							],
							[
								56.80518242294501,
								60.60651894181126
							],
							[
								56.804029167242206,
								60.50598974756374
							],
							[
								56.877885506566464,
								60.71157146458089
							],
							[
								56.81849694765413,
								60.49831179028321
							],
							[
								56.816577222914056,
								60.44030738273523
							],
							[
								56.80366802179783,
								60.69158658568359
							],
							[
								56.834442993353946,
								60.73441684876018
							],
							[
								56.87233014235342,
								60.537231486874944
							],
							[
								56.89410528031288,
								60.4327417188589
							],
							[
								56.82332493445249,
								60.71496550114562
							],
							[
								56.85745856181177,
								60.7307571091279
							],
							[
								56.89674382603828,
								60.777638257527244
							],
							[
								56.90053942133695,
								60.56448662997051
							],
							[
								56.87193884641765,
								60.72314172292076
							],
							[
								56.87087095984008,
								60.622421045964245
							],
							[
								56.859738757738036,
								60.602987935314694
							],
							[
								56.908342107618964,
								60.61104045698661
							],
							[
								56.79693614590407,
								60.7456724074811
							],
							[
								56.8151775477201,
								60.52536708693262
							],
							[
								56.89721001511502,
								60.591593728671576
							],
							[
								56.85453722737436,
								60.57198670081445
							],
							[
								56.85924674614108,
								60.78887338809069
							],
							[
								56.82964575304019,
								60.517693327911644
							],
							[
								56.813719690867785,
								60.6104398483658
							],
							[
								56.85665548940694,
								60.44427060950941
							],
							[
								56.84192410120559,
								60.637711145171124
							],
							[
								56.8118519932187,
								60.55242005224233
							],
							[
								56.89603339363632,
								60.49085071643869
							],
							[
								56.86752710626401,
								60.64950866284531
							],
							[
								56.85120358959542,
								60.599064352353714
							],
							[
								56.87111297500699,
								60.43656333006359
							],
							[
								56.826322701493446,
								60.54475557022239
							],
							[
								56.85525787742545,
								60.52941138877562
							],
							[
								56.856398570086164,
								60.63006862733567
							],
							[
								56.85335015409349,
								60.47135064086337
							],
							[
								56.840392748295635,
								60.72285805292316
							],
							[
								56.89271998898725,
								60.51795554647126
							],
							[
								56.88459327752451,
								60.657381784742974
							],
							[
								56.81556072362703,
								60.66847337818608
							],
							[
								56.79949562533986,
								60.4325384525119
							],
							[
								56.86781015298332,
								60.46365264661529
							],
							[
								56.85487414012114,
								60.715243186681725
							],
							[
								56.825117281427914,
								60.44419425003378
							],
							[
								56.85305222013469,
								60.65714693646955
							],
							[
								56.90606223727772,
								60.73895834573412
							],
							[
								56.8103752879976,
								60.63749114577306
							],
							[
								56.807344918621105,
								60.47894139924981
							],
							[
								56.88124247551224,
								60.68447782972965
							],
							[
								56.799242461543045,
								60.61808099187051
							],
							[
								56.79618967042461,
								60.45958214962243
							],
							[
								56.82181019242115,
								60.47125417405968
							],
							[
								56.90942367343032,
								60.711846979769554
							],
							[
								56.807024731429976,
								60.66454006212596
							],
							[
								56.81065451693222,
								60.45189074125929
							],
							[
								56.79589556529971,
								60.645123007992034
							],
							[
								56.82849177163591,
								60.74597274662213
							],
							[
								56.866400643653705,
								60.54881944976366
							],
							[
								56.90574307405972,
								60.595519990354674
							],
							[
								56.81737507477905,
								60.726520527462654
							],
							[
								56.851508911792685,
								60.74231967633583
							],
							[
								56.9038626570128,
								60.53737717292757
							],
							[
								56.89079155367642,
								60.78920633185157
							],
							[
								56.88793791196676,
								60.63028334142085
							],
							[
								56.86599071730009,
								60.73470907880977
							],
							[
								56.82511829506277,
								60.773032097057815
							],
							[
								56.86307278246635,
								60.57590487219313
							],
							[
								56.814005270454864,
								60.753573007396476
							],
							[
								56.848137522132866,
								60.76939373327036
							],
							[
								56.809246238069115,
								60.53694076377998
							],
							[
								56.902407109141386,
								60.62263014001623
							],
							[
								56.85786470320949,
								60.54490669267546
							],
							[
								56.89127637820894,
								60.603182511569656
							],
							[
								56.862621813416666,
								60.76179245481844
							],
							[
								56.8467209991054,
								60.5255037579433
							],
							[
								56.8170579394141,
								60.58338618165141
							],
							[
								56.850734490391815,
								60.45586447213856
							],
							[
								56.89934062863374,
								60.46374356169794
							],
							[
								56.83598294227944,
								60.649279761401836
							],
							[
								56.80591779854651,
								60.56398985802084
							],
							[
								56.88818741023285,
								60.44434708257307
							],
							[
								56.861586110187446,
								60.661082956291196
							],
							[
								56.84526678620614,
								60.61063975366883
							],
							[
								56.85857591786115,
								60.50233057630236
							],
							[
								56.85045893536989,
								60.64164203032707
							],
							[
								56.820390033016594,
								60.556330157383364
							],
							[
								56.843754304114775,
								60.695788452424885
							],
							[
								56.901657445486954,
								60.665261403755586
							],
							[
								56.84742626405052,
								60.48294064029811
							],
							[
								56.83263121376816,
								60.67634487093061
							],
							[
								56.88679349585926,
								60.52955119790836
							],
							[
								56.85823320646746,
								60.68816427607554
							],
							[
								56.842195915623805,
								60.45197279377939
							],
							[
								56.8618877956394,
								60.475247438066845
							],
							[
								56.90978903506979,
								60.525777710250054
							],
							[
								56.80443249860405,
								60.649051199873746
							],
							[
								56.84710970001946,
								60.66871644097043
							],
							[
								56.9001143200848,
								60.750533257353155
							],
							[
								56.80258320616598,
								60.59103660463326
							],
							[
								56.8014178529967,
								60.49051802309346
							],
							[
								56.87529870124236,
								60.69605200146045
							],
							[
								56.815884656111,
								60.48283557943118
							],
							[
								56.804730338146534,
								60.463471221383266
							],
							[
								56.80107906082986,
								60.67609622477256
							],
							[
								56.82253908374128,
								60.75752574665889
							],
							[
								56.883471030228755,
								60.55664980757002
							],
							[
								56.90525985761333,
								60.45213726514075
							],
							[
								56.90907286744783,
								60.56840746780412
							],
							[
								56.82073872414083,
								60.69946562579442
							],
							[
								56.845557794335285,
								60.75387934278557
							],
							[
								56.80467222899832,
								60.792167361330584
							],
							[
								56.894164933199725,
								60.7621052610884
							],
							[
								56.89793480360564,
								60.548973739537345
							],
							[
								56.883053523443486,
								60.74261790617767
							],
							[
								56.88199991280616,
								60.64186532635124
							],
							[
								56.819162727729044,
								60.784581181789584
							],
							[
								56.857138921881266,
								60.587486058574584
							],
							[
								56.812568524124806,
								60.50988933366368
							],
							[
								56.89647063756772,
								60.634216922224276
							],
							[
								56.80805106558676,
								60.76512122893703
							],
							[
								56.842183523139106,
								60.7809494808589
							],
							[
								56.89460867562756,
								60.57607930700214
							],
							[
								56.85193367493232,
								60.556489863688235
							],
							[
								56.85666933291008,
								60.77335298831025
							],
							[
								56.84079133029475,
								60.53708601731982
							],
							[
								56.81112091576778,
								60.59495400511772
							],
							[
								56.839328512310914,
								60.62221226265908
							],
							[
								56.79998213416928,
								60.57555677952452
							],
							[
								56.89341992265713,
								60.475346967105374
							],
							[
								56.87865239025164,
								60.66895986533944
							],
							[
								56.84860331098822,
								60.583565989247965
							],
							[
								56.88226806322796,
								60.455949557794185
							],
							[
								56.85380200953276,
								60.61456523226846
							],
							[
								56.83746462407792,
								60.56415520260495
							],
							[
								56.85264919515954,
								60.51391861098159
							],
							[
								56.84150090013028,
								60.494527754531084
							],
							[
								56.837807431472186,
								60.70735115688531
							],
							[
								56.89010979353523,
								60.50245024714522
							],
							[
								56.89571666720635,
								60.67684327337537
							],
							[
								56.82668570274464,
								60.687906695486504
							],
							[
								56.878961589188926,
								60.483045857421295
							],
							[
								56.85228785545171,
								60.69973176672859
							],
							[
								56.83627338374413,
								60.463561866610675
							],
							[
								56.80777978379312,
								60.622003789408524
							],
							[
								56.84116571079484,
								60.68028304954328
							],
							[
								56.90347864370861,
								60.72342581518498
							],
							[
								56.79548931601991,
								60.50209176753731
							],
							[
								56.89236219145214,
								60.703946233440405
							],
							[
								56.79664465873192,
								60.60259964942661
							],
							[
								56.83296264732296,
								60.49062875611487
							],
							[
								56.808036670732314,
								60.43642211721266
							],
							[
								56.90683679625766,
								60.69631594282966
							],
							[
								56.79513192364437,
								60.68764949733473
							],
							[
								56.800305159740574,
								60.71863070471136
							],
							[
								56.82590928385402,
								60.73046787531016
							],
							[
								56.877540171350084,
								60.568238680771316
							],
							[
								56.848925905324,
								60.72680676748846
							],
							[
								56.903142178393765,
								60.58000204746246
							],
							[
								56.81479027855562,
								60.71102166200043
							],
							[
								56.89200547544485,
								60.56056741021408
							],
							[
								56.888214077222734,
								60.77367435709186
							],
							[
								56.88534126827302,
								60.614768396295716
							],
							[
								56.80070726339078,
								60.53303577444233
							],
							[
								56.87710403116365,
								60.75418613391324
							],
							[
								56.87420864840943,
								60.59533104800641
							],
							[
								56.89980949319141,
								60.60711067356333
							],
							[
								56.905273071195914,
								60.781603792755455
							],
							[
								56.83622805817688,
								60.79250232675237
							],
							[
								56.811423748991466,
								60.73807265858417
							],
							[
								56.80663862917173,
								60.52146399500619
							],
							[
								56.84600117442563,
								60.5680701446057
							],
							[
								56.88867645602586,
								60.58766908697914
							],
							[
								56.87373144867983,
								60.78127639346224
							],
							[
								56.84411187715298,
								60.51001449262239
							],
							[
								56.82819484549711,
								60.60279364814829
							],
							[
								56.84811697310329,
								60.44038083826513
							],
							[
								56.80331345785317,
								60.54851155746884
							],
							[
								56.887497740278796,
								60.486947481491775
							],
							[
								56.833388768507454,
								60.633781879464564
							],
							[
								56.872710032276004,
								60.680535045686014
							],
							[
								56.842667923233755,
								60.595142386469284
							],
							[
								56.869722340689165,
								60.52173167982532
							],
							[
								56.84786379048935,
								60.62613963550712
							],
							[
								56.8315305962331,
								60.57573069655965
							],
							[
								56.844812016642734,
								60.46745545069729
							],
							[
								56.831859091185486,
								60.718910964464484
							],
							[
								56.89906497331427,
								60.64973790496295
							],
							[
								56.83004031430901,
								60.66084548434144
							],
							[
								56.88418471789039,
								60.51404688569879
							],
							[
								56.86935345713611,
								60.70762327183878
							],
							[
								56.83957796171258,
								60.43649267118376
							],
							[
								56.873037872968304,
								60.49464157418338
							],
							[
								56.90717972153501,
								60.51026536937458
							],
							[
								56.84451783067927,
								60.653212538494806
							],
							[
								56.80183840840449,
								60.6335648425704
							],
							[
								56.79880468715182,
								60.475048823234076
							],
							[
								56.897532143425636,
								60.73500174381317
							],
							[
								56.88641705444428,
								60.71552128540607
							],
							[
								56.82703575294287,
								60.502211083231664
							],
							[
								56.9008931836993,
								60.707895791826225
							],
							[
								56.798488241760246,
								60.66060836498968
							],
							[
								56.8021139068134,
								60.4480035719259
							],
							[
								56.79435373007565,
								60.730179070939556
							],
							[
								56.81995801007723,
								60.742021889570985
							],
							[
								56.880865528046705,
								60.54114395606475
							],
							[
								56.90264169338936,
								60.4366340940864
							],
							[
								56.808840366588186,
								60.72257480425151
							],
							[
								56.842976202819855,
								60.73836744877954
							],
							[
								56.80209539607296,
								60.776666554343855
							],
							[
								56.895328325916644,
								60.53346337781943
							],
							[
								56.88226175275425,
								60.78524054551629
							],
							[
								56.88047044753711,
								60.72709343337731
							],
							[
								56.81658493027003,
								60.769075849021334
							],
							[
								56.794774427377995,
								60.54460467210463
							],
							[
								56.87940468590493,
								60.62635138298966
							],
							[
								56.90864396369571,
								60.75449338179728
							],
							[
								56.86827342720371,
								60.60691313631576
							],
							[
								56.83960521003952,
								60.76543610862781
							],
							[
								56.82371597106185,
								60.52927178732146
							],
							[
								56.80547095768932,
								60.74962189465927
							],
							[
								56.89387443896116,
								60.61869845720528
							],
							[
								56.849328265270664,
								60.54099554884787
							],
							[
								56.88274276312907,
								60.59925597003923
							],
							[
								56.838183624157836,
								60.52159773797517
							],
							[
								56.86519351016675,
								60.4481619858737
							],
							[
								56.822256462041906,
								60.61436237005092
							],
							[
								56.89080459461607,
								60.45984575526824
							],
							[
								56.827447555393576,
								60.645348604226214
							],
							[
								56.79737920766856,
								60.56007946813297
							],
							[
								56.87606044207751,
								60.6534444121385
							],
							[
								56.83673106470824,
								60.60671589261635
							],
							[
								56.87965044087235,
								60.44045440304076
							],
							[
								56.864932850643264,
								60.633999239109045
							],
							[
								56.834860189323805,
								60.548665389244356
							],
							[
								56.86379425866058,
								60.533320631432495
							],
							[
								56.83522025305954,
								60.69184676233285
							],
							[
								56.83888806875472,
								60.47904354531322
							],
							[
								56.893125612146996,
								60.661320781625975
							],
							[
								56.87825816729775,
								60.52564063223114
							],
							[
								56.824096217892674,
								60.672408314133044
							],
							[
								56.87634723989315,
								60.46754914464932
							],
							[
								56.90125476153269,
								60.52186582100061
							],
							[
								56.83365684581685,
								60.44808272006328
							],
							[
								56.90759675180309,
								60.65367663095101
							],
							[
								56.81891167048015,
								60.64141906600428
							],
							[
								56.86340674379278,
								60.719191641011875
							],
							[
								56.83857525661256,
								60.664780151981496
							],
							[
								56.89158417318121,
								60.74657476580392
							],
							[
								56.794045000683774,
								60.58712081688927
							],
							[
								56.88977441756007,
								60.688422239955436
							],
							[
								56.830349378059196,
								60.47514805688614
							],
							[
								56.90424805337239,
								60.68078741693441
							],
							[
								56.81919463343174,
								60.45577951284777
							],
							[
								56.79771947110633,
								60.70313885237054
							],
							[
								56.83702503320829,
								60.74992523070442
							],
							[
								56.896723882631974,
								60.44824136961975
							],
							[
								56.81220362211632,
								60.69552529484888
							],
							[
								56.87493608614594,
								60.552733821074334
							],
							[
								56.8600411198135,
								60.74627353239739
							],
							[
								56.885634733575294,
								60.75814488130787
							],
							[
								56.79613826251365,
								60.788208983769096
							],
							[
								56.88940041528317,
								60.54505803996447
							],
							[
								56.873466631702584,
								60.63793147179229
							],
							[
								56.7980992158745,
								60.517562510584696
							],
							[
								56.874522371330244,
								60.73866267750311
							],
							[
								56.81062931182226,
								60.78062305386104
							],
							[
								56.87160783924401,
								60.57982465970441
							],
							[
								56.902694629578214,
								60.7660672742269
							],
							[
								56.79951670147242,
								60.76116823583795
							],
							[
								56.833651159505585,
								60.77698997401419
							],
							[
								56.817784717589284,
								60.540847362053924
							],
							[
								56.886074673127226,
								60.57215818509338
							],
							[
								56.84339718062265,
								60.55257682007949
							]
						],
						"dist": 1000
					},
					res:[
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 0, \"rating\": 40}",
						"{\"good\": 48, \"park\": 5, \"cigarettes\": 5, \"alcohol\": 20, \"educational\": 21, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 26, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 1, \"rating\": 40}",
						"{\"good\": 106, \"park\": 12, \"cigarettes\": 21, \"alcohol\": 48, \"educational\": 35, \"transport\": {\"len\": 26, \"data\": [{\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"IndiGo TheFirst\", \"street\": null}, {\"name\": \"АРТ-Капелька\", \"street\": null}, {\"name\": \"Study & Bonus\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Сакко и Ванцетти\"}, {\"name\": \"Школа № 184 «Новая Школа»\", \"street\": null}, {\"name\": \"ГАОУ СПО СО Екатеринбургский Монтажный Колледж\", \"street\": \"улица Декабристов\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 559\", \"street\": null}, {\"name\": \"Детский сад № 462\", \"street\": null}, {\"name\": \"Детский сад № 302\", \"street\": null}, {\"name\": \"Лицей № 173\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Школа № 143\", \"street\": null}, {\"name\": \"Детский сад № 444\", \"street\": null}, {\"name\": \"Детский сад № 518\", \"street\": null}, {\"name\": \"Детский сад № 413\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": \"улица Репина\"}, {\"name\": \"Уральский государственный медицинский университет\", \"street\": \"улица Репина\"}, {\"name\": \"НИИ охраны материнства и младенчества\", \"street\": null}, {\"name\": \"Детский сад №373\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа №10\", \"street\": null}]}, \"bad\": 79, \"positive\": -26.0, \"violations\": {\"len\": 10, \"data\": [{\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null, \"bad\": \"Agave, 6А, переулок Центральный Рынок, Форум-Сити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Роббо клуб\", \"street\": null, \"bad\": \"Пив&ко, 30, Palmiro Tolyatti Street, Гулливер, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}, {\"name\": \"АРТ-Капелька\", \"street\": null, \"bad\": \"МБ Вино и Цветы, 72, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"ГАОУ СПО СО Екатеринбургский Монтажный Колледж\", \"street\": \"улица Декабристов\", \"bad\": \"Столовая, 83А, улица Декабристов, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Лицей № 173\", \"street\": null, \"bad\": \"8, Kuybysheva Street, Мечта, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Маруся, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"30, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Бургеры и Креветки, 24, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"УрГЭУ-СИНХ\", \"street\": null, \"bad\": \"Столовая УрГЭУ, Kuybysheva Street, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Школа №10\", \"street\": null, \"bad\": \"Три толстяка, 60, улица Вайнера, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}]}, \"index\": 2, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 3, \"rating\": 40}",
						"{\"good\": 141, \"park\": 38, \"cigarettes\": 8, \"alcohol\": 63, \"educational\": 36, \"transport\": {\"len\": 22, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Школа риторики «Равновесие»\", \"street\": null}, {\"name\": \"Детский сад № 239 «Золотое Яблоко»\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Уральский колледж экономики и права\", \"street\": \"улица Сони Морозовой\"}, {\"name\": \"Sunday Rock\", \"street\": null}, {\"name\": \"EnglishFit\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Лицей № 110 им. Л. К. Гришиной\", \"street\": null}, {\"name\": \"Школа № 13\", \"street\": null}, {\"name\": \"Гимназия № 94\", \"street\": null}, {\"name\": \"Детский сад № 441\", \"street\": null}, {\"name\": \"Детский сад № 585\", \"street\": null}, {\"name\": \"Уральский институт экономики, управления и права\", \"street\": \"улица Луначарского\"}, {\"name\": \"Детский сад № 166 «Гнёздышко»\", \"street\": null}, {\"name\": \"Детский сад № 363\", \"street\": null}, {\"name\": \"Гимназия № 40\", \"street\": null}, {\"name\": \"Гимназия № 8 им. Дягилева\", \"street\": null}, {\"name\": \"Детский сад №558\", \"street\": null}, {\"name\": \"Детский сад № 330 «Антошка»\", \"street\": null}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null}, {\"name\": \"Детский сад № 261 «Речецветик»\", \"street\": null}]}, \"bad\": 95, \"positive\": -24.5, \"violations\": {\"len\": 11, \"data\": [{\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Коньяки Дагестана, 41, Улица Малышева, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Поль Бейкери;Лавкрафт, 64, Malysheva Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Gustoy Hookah Lounge, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Влади Bar, 51, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"KIBERone\", \"street\": \"улица Малышева\", \"bad\": \"А Ты Где, 137, улица Луначарского, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Tveritina Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Школа № 13\", \"street\": null, \"bad\": \"Роспечать, Bazhova Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"УрГЭУ-СИНХ\", \"street\": null, \"bad\": \"Столовая УрГЭУ, Kuybysheva Street, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Российский экономический университет имени Г. В. Плеханова\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая УрФУ, 48А, улица Куйбышева, Армада, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}]}, \"index\": 4, \"rating\": 0}",
						"{\"good\": 83, \"park\": 13, \"cigarettes\": 10, \"alcohol\": 18, \"educational\": 29, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа № 184 «Новая Школа»\", \"street\": null}, {\"name\": \"Детский сад № 541\", \"street\": null}, {\"name\": \"Детский сад № 534 «НПО Автоматики»\", \"street\": null}, {\"name\": \"Школа № 168\", \"street\": null}, {\"name\": \"Детский сад, ясли\", \"street\": null}, {\"name\": \"Детский сад № 559\", \"street\": null}, {\"name\": \"Детский сад № 462\", \"street\": null}, {\"name\": \"Детский сад № 485\", \"street\": null}, {\"name\": \"Детский сад № 302\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": \"Школа № 143\", \"street\": null}, {\"name\": \"Детский сад № 444\", \"street\": null}, {\"name\": \"Детский сад № 518\", \"street\": null}, {\"name\": \"Детский сад № 413\", \"street\": null}, {\"name\": \"Школа № 11\", \"street\": null}, {\"name\": \"Детский сад № 510\", \"street\": null}, {\"name\": \"Станция юных натуралистов\", \"street\": null}, {\"name\": \"Детский сад №373\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 30, \"positive\": 11.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Роббо клуб\", \"street\": null, \"bad\": \"Пив&ко, 30, Palmiro Tolyatti Street, Гулливер, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Subway, Встречный переулок, Париж, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620086, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Красное Белое, 22, Белореченская улица, Медгородок, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}]}, \"index\": 5, \"rating\": 60}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 6, \"rating\": 100}",
						"{\"good\": 131, \"park\": 13, \"cigarettes\": 10, \"alcohol\": 43, \"educational\": 34, \"transport\": {\"len\": 25, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null}, {\"name\": \"Театральный институт\", \"street\": null}, {\"name\": \"Школа развития малыша - Кенгуру\", \"street\": \"улица Крылова\"}, {\"name\": \"Дом радости\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Сакко и Ванцетти\"}, {\"name\": \"KIBERone\", \"street\": \"улица Татищева\"}, {\"name\": \"Школа № 69\", \"street\": null}, {\"name\": \"УрГУПС\", \"street\": null}, {\"name\": \"Детский сад № 582\", \"street\": null}, {\"name\": \"Детский сад № 9\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Детский сад № 272\", \"street\": null}, {\"name\": \"Детский сад № 562\", \"street\": null}, {\"name\": \"Детский сад № 368\", \"street\": null}, {\"name\": \"Детский сад № 199 Созидание\", \"street\": null}, {\"name\": \"Педагогический колледж\", \"street\": null}, {\"name\": \"Гимназия № 2\", \"street\": null}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null}, {\"name\": \"Детский сад № 28 «Теремок»\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": \"улица Репина\"}, {\"name\": \"Уральский государственный медицинский университет\", \"street\": \"улица Репина\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null}, {\"name\": \"Уральский музыкальный колледж\", \"street\": null}]}, \"bad\": 71, \"positive\": -5.5, \"violations\": {\"len\": 11, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null, \"bad\": \"Столовая, 17, Klyuchevskaya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null, \"bad\": \"Agave, 6А, переулок Центральный Рынок, Форум-Сити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Театральный институт\", \"street\": null, \"bad\": \"Foodbox, Antona Valeka Street, Екатеринбург-Сити, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null, \"bad\": \"Provizia, ресторан на прилавке, 7, Верх-Исетский бульвар, Адмиральский-2, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620028, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Маруся, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"30, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Бургеры и Креветки, 24, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 2\", \"street\": null, \"bad\": \"Красное&Белое, 8, улица Шевелёва, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null, \"bad\": \"Пивной гном, 10, улица Юмашева, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"улица Одинарка, Ольховский Парк, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая, улица Единого Фронта, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}]}, \"index\": 7, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 8, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 9, \"rating\": 100}",
						"{\"good\": 15, \"park\": 4, \"cigarettes\": 3, \"alcohol\": 8, \"educational\": 5, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад № 468\", \"street\": null}, {\"name\": \"Детский сад № 459\", \"street\": null}, {\"name\": \"Детский сад № 236\", \"street\": null}]}, \"bad\": 9, \"positive\": -1.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}]}, \"index\": 10, \"rating\": 0}",
						"{\"good\": 4, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 11, \"rating\": 40}",
						"{\"good\": 117, \"park\": 7, \"cigarettes\": 12, \"alcohol\": 39, \"educational\": 51, \"transport\": {\"len\": 34, \"data\": [{\"name\": \"Детская хоровая школа №1\", \"street\": null}, {\"name\": \"Детский сад Мурзилка\", \"street\": null}, {\"name\": \"Talento\", \"street\": null}, {\"name\": \"Сёма\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Растём вместе\", \"street\": null}, {\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Институт развития образования\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": \"Июльская улица\"}, {\"name\": \"Маленькая страна\", \"street\": null}, {\"name\": \"Гимназия N35\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа № 145\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №180\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": null}, {\"name\": \"Детский сад № 517\", \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": \"Детский сад № 322\", \"street\": null}, {\"name\": \"Средняя школа № 165\", \"street\": null}, {\"name\": \"Детский сад №550 Академия успеха\", \"street\": null}, {\"name\": \"Детский сад Акадеша\", \"street\": null}, {\"name\": \"Детский сад № 536 «Сказка»\", \"street\": null}, {\"name\": \"Детский сад № 588\", \"street\": null}, {\"name\": \"Детский сад № 468\", \"street\": null}, {\"name\": \"Детский сад № 501\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 459\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Детский сад № 262\", \"street\": null}, {\"name\": \"Детский сад № 423\", \"street\": null}, {\"name\": \"Детский сад № 236\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": \"Уральская улица\"}]}, \"bad\": 62, \"positive\": -3.5, \"violations\": {\"len\": 11, \"data\": [{\"name\": \"Растём вместе\", \"street\": null, \"bad\": \"Столовая, 2, улица Кулибина, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"Пивко, 6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Красное&Белое, 45, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Not Turkey kitchen, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}, {\"name\": \"Лицей № 130\", \"street\": null, \"bad\": \"Тройка, 26, Академическая улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"цветочный магазин, 10, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}, {\"name\": \"Детский сад № 68\", \"street\": null, \"bad\": \"Не турецкая кухня, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Детский сад № 505\", \"street\": null, \"bad\": \"Красное&Белое, 16, Советская улица, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620067, Russia\"}]}, \"index\": 12, \"rating\": 0}",
						"{\"good\": 125, \"park\": 8, \"cigarettes\": 9, \"alcohol\": 51, \"educational\": 36, \"transport\": {\"len\": 25, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Университет связи\", \"street\": null}, {\"name\": \"Вавилон\", \"street\": null}, {\"name\": \"Центр изучения английского языка Мергиной Марины\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Дом радости\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Татищева\"}, {\"name\": \"Школа №74\", \"street\": \"улица Крауля\"}, {\"name\": \"Гимназия №116\", \"street\": null}, {\"name\": \"Детский сад, ясли\", \"street\": null}, {\"name\": \"Детский сад № 143\", \"street\": null}, {\"name\": null, \"street\": \"улица Крауля\"}, {\"name\": \"Школа № 121\", \"street\": null}, {\"name\": \"Менталитет\", \"street\": null}, {\"name\": \"Детский сад № 562\", \"street\": null}, {\"name\": \"Детский сад № 368\", \"street\": null}, {\"name\": \"Детский сад № 511\", \"street\": null}, {\"name\": \"Детский сад № 5\", \"street\": null}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": \"Уральский государственный медицинский университет\", \"street\": \"улица Репина\"}, {\"name\": \"НИИ охраны материнства и младенчества\", \"street\": null}, {\"name\": \"Детский сад компенсирующего вида № 466\", \"street\": null}, {\"name\": \"Школа №1\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 75, \"positive\": -12.5, \"violations\": {\"len\": 9, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null, \"bad\": \"Столовая, 17, Klyuchevskaya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null, \"bad\": \"Provizia, ресторан на прилавке, 7, Верх-Исетский бульвар, Адмиральский-2, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620028, Russia\"}, {\"name\": \"Роббо клуб\", \"street\": null, \"bad\": \"Пив&ко, 30, Palmiro Tolyatti Street, Гулливер, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}, {\"name\": null, \"street\": \"улица Крауля\", \"bad\": \"Пивасик и карасик, 8, Kraulya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Fanagoria, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Хмель и солод, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Пивкофф, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 511\", \"street\": null, \"bad\": \"PizzaMia, 53, Kraulya Street, Татищев, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}]}, \"index\": 13, \"rating\": 0}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 14, \"rating\": 100}",
						"{\"good\": 33, \"park\": 0, \"cigarettes\": 3, \"alcohol\": 8, \"educational\": 13, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 15, \"rating\": 100}",
						"{\"good\": 22, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 3, \"educational\": 11, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Школа № 122\", \"street\": null}, {\"name\": \"Детский сад № 46\", \"street\": null}, {\"name\": \"Детский сад № 131\", \"street\": null}, {\"name\": \"Детский сад № 312\", \"street\": null}, {\"name\": \"Детский сад № 51\", \"street\": null}, {\"name\": \"Школа № 129\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 6, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 16, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 17, \"rating\": 100}",
						"{\"good\": 19, \"park\": 1, \"cigarettes\": 3, \"alcohol\": 5, \"educational\": 5, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад № 308 Жемчужинка\", \"street\": null}, {\"name\": \"Детский сад № 62\", \"street\": null}, {\"name\": \"Средняя школа №96\", \"street\": null}, {\"name\": \"Специальная коррекционная школа № 169\", \"street\": null}]}, \"bad\": 5, \"positive\": 4.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Средняя школа №96\", \"street\": null, \"bad\": \"Пив&ко, 37, Хрустальная улица, Синие Камни, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620138, Russia\"}]}, \"index\": 18, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 19, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 20, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 21, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 22, \"rating\": 100}",
						"{\"good\": 26, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 3, \"educational\": 10, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Растём вместе\", \"street\": null}, {\"name\": \"Гимназия №47 (Начальная школа)\", \"street\": null}, {\"name\": \"Детский сад № 468\", \"street\": null}, {\"name\": \"Детский сад № 255\", \"street\": null}, {\"name\": \"Детский сад № 407 «Жаворонок»\", \"street\": null}]}, \"bad\": 9, \"positive\": 4.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Гуманитарный университет\", \"street\": null, \"bad\": \"Столовая, 19, Студенческая улица, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}, {\"name\": \"Растём вместе\", \"street\": null, \"bad\": \"Столовая, 2, улица Кулибина, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Лицей № 130\", \"street\": null, \"bad\": \"Тройка, 26, Академическая улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая № 2, 23, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}]}, \"index\": 23, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 24, \"rating\": 40}",
						"{\"good\": 28, \"park\": 10, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 21, \"positive\": -7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 25, \"rating\": 40}",
						"{\"good\": 15, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 26, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 27, \"rating\": 100}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 28, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 29, \"rating\": 40}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 30, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 31, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 32, \"rating\": 100}",
						"{\"good\": 25, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 17, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 9.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 33, \"rating\": 100}",
						"{\"good\": 7, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 34, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 35, \"rating\": 40}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 36, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 37, \"rating\": 40}",
						"{\"good\": 10, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 6, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Учебный центр МРСК Урала\", \"street\": \"улица Электриков\"}, {\"name\": \"Школа №78\", \"street\": null}, {\"name\": \"Детский сад №523\", \"street\": null}, {\"name\": \"Российский государственный профессионально-педагогический университет\", \"street\": null}]}, \"bad\": 3, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 38, \"rating\": 100}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 39, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"KIBERone\", \"street\": \"улица Конструкторов\"}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 40, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 41, \"rating\": 100}",
						"{\"good\": 6, \"park\": 4, \"cigarettes\": 3, \"alcohol\": 4, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": -5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 42, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 43, \"rating\": 40}",
						"{\"good\": 15, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 17, \"positive\": -9.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 44, \"rating\": 40}",
						"{\"good\": 57, \"park\": 7, \"cigarettes\": 4, \"alcohol\": 7, \"educational\": 36, \"transport\": {\"len\": 22, \"data\": [{\"name\": \"Чудесный мир\", \"street\": null}, {\"name\": \"Учебный центр ЕМУП \\\"Метрополитен\\\"\", \"street\": \"Совхозная улица\"}, {\"name\": null, \"street\": \"переулок Замятина\"}, {\"name\": null, \"street\": \"улица Баумана\"}, {\"name\": \"РГППУ\", \"street\": \"Каширская улица\"}, {\"name\": \"Школа-интернат №89\", \"street\": \"Даниловская улица\"}, {\"name\": null, \"street\": \"Каширская улица\"}, {\"name\": \"Детский сад №76\", \"street\": null}, {\"name\": \"Детский сад №576\", \"street\": null}, {\"name\": \"Средняя Школа №114\", \"street\": null}, {\"name\": \"Десткий сад №310\", \"street\": null}, {\"name\": \"Детский сад № 15\", \"street\": null}, {\"name\": \"Детский сад №168\", \"street\": null}, {\"name\": \"Детский сад №440\", \"street\": null}, {\"name\": \"Детский сад №477\", \"street\": null}, {\"name\": \"Детский сад №500\", \"street\": null}, {\"name\": \"Школа №46\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"Детский сад №521\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 10, \"positive\": 18.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Учебный центр ЕМУП \\\"Метрополитен\\\"\", \"street\": \"Совхозная улица\", \"bad\": \"Столовая электродепо, 17, Совхозная улица, Калиновский, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620057, Russia\"}]}, \"index\": 45, \"rating\": 60}",
						"{\"good\": 48, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 5, \"educational\": 29, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": null, \"street\": \"улица Черепанова\"}, {\"name\": \"Детский сад № 248\", \"street\": null}, {\"name\": \"Школа № 201 «Согласие»\", \"street\": null}, {\"name\": \"Десткий сад № 179\", \"street\": null}, {\"name\": \"Детский сад № 25\", \"street\": null}, {\"name\": \"Детский сад № 286\", \"street\": null}, {\"name\": \"Детский сад № 283\", \"street\": null}, {\"name\": \"Детский сад № 196\", \"street\": null}, {\"name\": \"Детский сад № 117\", \"street\": null}, {\"name\": \"Детский сад № 175\", \"street\": null}, {\"name\": \"Детский сад № 197\", \"street\": null}, {\"name\": \"Школа № 148\", \"street\": null}, {\"name\": \"Школа № 149\", \"street\": null}, {\"name\": \"Школа № 166\", \"street\": null}, {\"name\": \"Школа № 29\", \"street\": null}, {\"name\": \"Школа № 6\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 147\", \"street\": null}]}, \"bad\": 12, \"positive\": 12.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Budo, 22, Opalikhinskaya Street, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}]}, \"index\": 46, \"rating\": 60}",
						"{\"good\": 35, \"park\": 6, \"cigarettes\": 8, \"alcohol\": 29, \"educational\": 13, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Екатеринбургская академия современного искусства (ЕАСИ)\", \"street\": \"улица Красных Партизан\"}, {\"name\": \"Школа №115\", \"street\": \"Фестивальная улица\"}, {\"name\": \"Детский сад № 158\", \"street\": null}, {\"name\": \"Детский сад № 516\", \"street\": null}, {\"name\": \"Школа №117\", \"street\": null}, {\"name\": \"Детский сад № 370\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 38, \"positive\": -20.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Школа №192\", \"street\": \"улица Машиностроителей\", \"bad\": \"Live beer, 6, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620143, Russia\"}, {\"name\": \"Екатеринбургский промышленно-технологический техникум (ЕПТТ) им. В.М. Курочкина\", \"street\": \"улица Машиностроителей\", \"bad\": \"13, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}]}, \"index\": 47, \"rating\": 0}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 48, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 49, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 50, \"rating\": 40}",
						"{\"good\": 95, \"park\": 10, \"cigarettes\": 13, \"alcohol\": 34, \"educational\": 34, \"transport\": {\"len\": 21, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"УрГУ\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"IndiGo TheFirst\", \"street\": null}, {\"name\": \"АРТ-Капелька\", \"street\": null}, {\"name\": \"Study & Bonus\", \"street\": null}, {\"name\": \"Ithub\", \"street\": null}, {\"name\": \"Гимназия № 70\", \"street\": null}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Школа № 175\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Уральский государственный медицинский университет\", \"street\": \"улица Декабристов\"}, {\"name\": \"Гимназия № 120\", \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Лицей № 173\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Детский сад № 386 «Знайка»\", \"street\": null}, {\"name\": \"Детский сад № 444\", \"street\": null}, {\"name\": \"Детский сад № 233\", \"street\": null}, {\"name\": \"Детский сад № 455\", \"street\": null}, {\"name\": \"Школа №10\", \"street\": null}]}, \"bad\": 56, \"positive\": -8.5, \"violations\": {\"len\": 8, \"data\": [{\"name\": \"АРТ-Капелька\", \"street\": null, \"bad\": \"МБ Вино и Цветы, 72, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"ГАОУ СПО СО Екатеринбургский Монтажный Колледж\", \"street\": \"улица Декабристов\", \"bad\": \"Столовая, 83А, улица Декабристов, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Red&White, 39, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Косулинская пивоварня, 41, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Лицей № 173\", \"street\": null, \"bad\": \"8, Kuybysheva Street, Мечта, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Детский сад № 455\", \"street\": null, \"bad\": \"KFC, улица 8 Марта, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"УрГЭУ-СИНХ\", \"street\": null, \"bad\": \"Столовая УрГЭУ, Kuybysheva Street, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Школа №10\", \"street\": null, \"bad\": \"Три толстяка, 60, улица Вайнера, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}]}, \"index\": 51, \"rating\": 0}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 52, \"rating\": 100}",
						"{\"good\": 87, \"park\": 17, \"cigarettes\": 16, \"alcohol\": 40, \"educational\": 31, \"transport\": {\"len\": 19, \"data\": [{\"name\": \"Школа риторики «Равновесие»\", \"street\": null}, {\"name\": \"Детский сад № 239 «Золотое Яблоко»\", \"street\": null}, {\"name\": \"ФГБОУ ВО Уральский ГАУ\", \"street\": \"улица Белинского\"}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Ткачей\"}, {\"name\": \"Школа № 13\", \"street\": null}, {\"name\": \"Детский сад № 585\", \"street\": null}, {\"name\": \"Уральский институт экономики, управления и права\", \"street\": \"улица Луначарского\"}, {\"name\": \"Детский сад № 166 «Гнёздышко»\", \"street\": null}, {\"name\": null, \"street\": \"Шорный переулок\"}, {\"name\": \"Гимназия № 8 им. Дягилева\", \"street\": null}, {\"name\": \"Детский сад № 75\", \"street\": null}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null}, {\"name\": \"Дом Детского Творчества Октябрьского района\", \"street\": null}, {\"name\": \"Детский сад № 479\", \"street\": null}, {\"name\": \"Детский сад № 419\", \"street\": null}, {\"name\": \"Детский сад № 123 ОАО «РЖД»\", \"street\": null}, {\"name\": \"Детский сад №465\", \"street\": null}, {\"name\": \"Детский сад № 261 «Речецветик»\", \"street\": null}]}, \"bad\": 55, \"positive\": -11.5, \"violations\": {\"len\": 7, \"data\": [{\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Tveritina Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Школа № 13\", \"street\": null, \"bad\": \"Роспечать, Bazhova Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"Гимназия № 40\", \"street\": null, \"bad\": \"Роспечать, Dekabristov Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Центр развития ребёнка «Дошколёнок»\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null, \"bad\": \"Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая УрФУ, 48А, улица Куйбышева, Армада, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}]}, \"index\": 53, \"rating\": 0}",
						"{\"good\": 129, \"park\": 20, \"cigarettes\": 14, \"alcohol\": 27, \"educational\": 26, \"transport\": {\"len\": 23, \"data\": [{\"name\": \"Детский сад № 45\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Акварелька\", \"street\": null}, {\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null}, {\"name\": \"Ithub\", \"street\": null}, {\"name\": \"Умка\", \"street\": \"Волгоградская улица\"}, {\"name\": \"Школа № 184 «Новая Школа»\", \"street\": null}, {\"name\": \"Гимназия № 70\", \"street\": null}, {\"name\": \"Школа № 175\", \"street\": null}, {\"name\": \"Средняя школа № 57\", \"street\": null}, {\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Детский сад № 561\", \"street\": null}, {\"name\": \"Школа № 109\", \"street\": null}, {\"name\": \"Детский сад № 29\", \"street\": null}, {\"name\": \"Школа № 152\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": \"Школа № 143\", \"street\": null}, {\"name\": \"Детский сад № 518\", \"street\": null}, {\"name\": \"Детский сад № 54\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"Станция юных натуралистов\", \"street\": null}, {\"name\": \"Рябинка, детский сад № 156\", \"street\": null}]}, \"bad\": 34, \"positive\": 30.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null, \"bad\": \"Красное&Белое, 52, Amundsena Street, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Школа № 152\", \"street\": null, \"bad\": \"Здравница, Волгоградская улица, Миллениум, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}]}, \"index\": 54, \"rating\": 60}",
						"{\"good\": 12, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 55, \"rating\": 100}",
						"{\"good\": 127, \"park\": 23, \"cigarettes\": 21, \"alcohol\": 68, \"educational\": 35, \"transport\": {\"len\": 19, \"data\": [{\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null}, {\"name\": \"Театральный институт\", \"street\": null}, {\"name\": \"Институт Машиноведения УрО РАН\", \"street\": null}, {\"name\": \"IndiGo TheFirst\", \"street\": null}, {\"name\": \"АРТ-Капелька\", \"street\": null}, {\"name\": \"Study & Bonus\", \"street\": null}, {\"name\": \"Sunday Rock\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Сакко и Ванцетти\"}, {\"name\": \"Школа № 69\", \"street\": null}, {\"name\": \"Детский сад № 582\", \"street\": null}, {\"name\": \"Детский сад № 9\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Гимназия № 2\", \"street\": null}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": \"улица Репина\"}, {\"name\": \"Уральский государственный медицинский университет\", \"street\": \"улица Репина\"}, {\"name\": \"Уральский музыкальный колледж\", \"street\": null}, {\"name\": \"Школа №10\", \"street\": null}]}, \"bad\": 115, \"positive\": -51.5, \"violations\": {\"len\": 11, \"data\": [{\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null, \"bad\": \"Agave, 6А, переулок Центральный Рынок, Форум-Сити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Театральный институт\", \"street\": null, \"bad\": \"Foodbox, Antona Valeka Street, Екатеринбург-Сити, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null, \"bad\": \"Provizia, ресторан на прилавке, 7, Верх-Исетский бульвар, Адмиральский-2, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620028, Russia\"}, {\"name\": \"АРТ-Капелька\", \"street\": null, \"bad\": \"МБ Вино и Цветы, 72, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"ЕГЭбург\", \"street\": null, \"bad\": \"Syndrome Bar, 13, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Маруся, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"30, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Бургеры и Креветки, 24, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"УрГЭУ-СИНХ\", \"street\": null, \"bad\": \"Столовая УрГЭУ, Kuybysheva Street, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Школа №10\", \"street\": null, \"bad\": \"Три толстяка, 60, улица Вайнера, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Уральская государственная консерватория\", \"street\": null, \"bad\": \"Double bar, 8Б, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}]}, \"index\": 56, \"rating\": 0}",
						"{\"good\": 44, \"park\": 8, \"cigarettes\": 4, \"alcohol\": 17, \"educational\": 25, \"transport\": {\"len\": 16, \"data\": [{\"name\": \"Клубника\", \"street\": null}, {\"name\": \"Talento\", \"street\": null}, {\"name\": \"Детский сад #184\", \"street\": null}, {\"name\": \"Школа № 145\", \"street\": null}, {\"name\": \"ЧОУ СОШ «Творчество»\", \"street\": \"улица Пионеров\"}, {\"name\": \"Школа № 146\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Детский сад Акадеша\", \"street\": null}, {\"name\": \"Детский сад № 501\", \"street\": null}, {\"name\": \"Детский сад № 450\", \"street\": null}, {\"name\": \"Детский сад № 230\", \"street\": null}, {\"name\": \"Детский сад № 230 \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад № 262\", \"street\": null}, {\"name\": \"Детский сад №91\", \"street\": null}, {\"name\": \"Детский сад №369\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 34, \"positive\": -12.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"Пивко, 6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Pizza mia, 23, Вокзальная улица, Мельница, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}, {\"name\": \"Детский сад №369\", \"street\": null, \"bad\": \"Сушкоф, 25, Mamina-Sibiryaka Street, Екатерининский Парк, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}]}, \"index\": 57, \"rating\": 0}",
						"{\"good\": 99, \"park\": 10, \"cigarettes\": 14, \"alcohol\": 29, \"educational\": 36, \"transport\": {\"len\": 28, \"data\": [{\"name\": \"Университет связи\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Ithub\", \"street\": null}, {\"name\": \"Школа №74\", \"street\": \"улица Крауля\"}, {\"name\": \"Школа № 184 «Новая Школа»\", \"street\": null}, {\"name\": \"Училище олимпийского резерва\", \"street\": \"улица Шаумяна\"}, {\"name\": \"Детский сад № 541\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 534 «НПО Автоматики»\", \"street\": null}, {\"name\": \"Школа № 168\", \"street\": null}, {\"name\": \"Детский сад, ясли\", \"street\": null}, {\"name\": \"Средняя школа № 57\", \"street\": null}, {\"name\": \"Детский сад № 559\", \"street\": null}, {\"name\": \"Детский сад № 143\", \"street\": null}, {\"name\": \"Детский сад № 462\", \"street\": null}, {\"name\": \"Детский сад № 485\", \"street\": null}, {\"name\": \"Детский сад № 302\", \"street\": null}, {\"name\": null, \"street\": \"улица Крауля\"}, {\"name\": \"Школа № 143\", \"street\": null}, {\"name\": \"Детский сад № 511\", \"street\": null}, {\"name\": \"Детский сад № 444\", \"street\": null}, {\"name\": \"Детский сад № 518\", \"street\": null}, {\"name\": \"Детский сад № 413\", \"street\": null}, {\"name\": \"Станция юных натуралистов\", \"street\": null}, {\"name\": \"Детский сад №373\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 43, \"positive\": 6.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Роббо клуб\", \"street\": null, \"bad\": \"Пив&ко, 30, Palmiro Tolyatti Street, Гулливер, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Subway, Встречный переулок, Париж, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620086, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Красное Белое, 22, Белореченская улица, Медгородок, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}, {\"name\": null, \"street\": \"улица Крауля\", \"bad\": \"Пивасик и карасик, 8, Kraulya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Детский сад № 511\", \"street\": null, \"bad\": \"PizzaMia, 53, Kraulya Street, Татищев, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}]}, \"index\": 58, \"rating\": 60}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 6, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Средняя школа № 83\", \"street\": null}, {\"name\": \"Детский сад № 351 \\\"Крепыш\\\"\", \"street\": null}, {\"name\": \"Детский сад комбинированного вида № 55\", \"street\": \"улица Миномётчиков\"}]}, \"bad\": 4, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 59, \"rating\": 40}",
						"{\"good\": 15, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 60, \"rating\": 100}",
						"{\"good\": 46, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 25, \"transport\": {\"len\": 13, \"data\": [{\"name\": \"УрЮИ МВД РФ\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": \"переулок Замятина\"}, {\"name\": null, \"street\": \"улица Баумана\"}, {\"name\": \"Школа-интернат №89\", \"street\": \"Даниловская улица\"}, {\"name\": \"Детский сад №76\", \"street\": null}, {\"name\": \"Детский сад №436\", \"street\": null}, {\"name\": \"Детский сад №440\", \"street\": null}, {\"name\": \"Детский сад №500\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 170\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 7, \"positive\": 16.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 61, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад\", \"street\": \"Водонасосная улица\"}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 62, \"rating\": 100}",
						"{\"good\": 58, \"park\": 15, \"cigarettes\": 5, \"alcohol\": 6, \"educational\": 11, \"transport\": {\"len\": 5, \"data\": [{\"name\": null, \"street\": \"Шорный переулок\"}, {\"name\": \"Детский сад № 75\", \"street\": null}, {\"name\": \"Детский сад № 63\", \"street\": null}, {\"name\": \"Детский сад № 479\", \"street\": null}, {\"name\": \"Специальная коррекционная школа № 169\", \"street\": null}]}, \"bad\": 21, \"positive\": 8.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Средняя школа №96\", \"street\": null, \"bad\": \"Пив&ко, 37, Хрустальная улица, Синие Камни, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620138, Russia\"}]}, \"index\": 63, \"rating\": 60}",
						"{\"good\": 42, \"park\": 4, \"cigarettes\": 0, \"alcohol\": 11, \"educational\": 13, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Школа № 122\", \"street\": null}, {\"name\": \"Детский сад № 131\", \"street\": null}, {\"name\": \"Детский сад № 51\", \"street\": null}, {\"name\": \"Школа № 129\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 11, \"positive\": 10.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад № 132\", \"street\": null, \"bad\": \"45, Расточная улица, Сортировка, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620050, Russia\"}, {\"name\": \"Детский сад № 132\", \"street\": null, \"bad\": \"Красное&Белое, 45, Расточная улица, Сортировка, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620050, Russia\"}]}, \"index\": 64, \"rating\": 60}",
						"{\"good\": 14, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 65, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 66, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 67, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 68, \"rating\": 100}",
						"{\"good\": 70, \"park\": 11, \"cigarettes\": 12, \"alcohol\": 31, \"educational\": 29, \"transport\": {\"len\": 18, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"УрГУ\", \"street\": null}, {\"name\": \"Школа Студия \\\"Okeyprofi\\\"\", \"street\": null}, {\"name\": \"Детский сад № 239 «Золотое Яблоко»\", \"street\": null}, {\"name\": \"ФГБОУ ВО Уральский ГАУ\", \"street\": \"улица Белинского\"}, {\"name\": \"KIBERone\", \"street\": \"улица Ткачей\"}, {\"name\": \"Интернат глухонемых\", \"street\": null}, {\"name\": \"Детский сад № 585\", \"street\": null}, {\"name\": \"Детский сад № 55\", \"street\": null}, {\"name\": \"Детский сад № 49\", \"street\": null}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null}, {\"name\": \"Дом Детского Творчества Октябрьского района\", \"street\": null}, {\"name\": \"Гимназия № 120\", \"street\": null}, {\"name\": \"Школа № 93\", \"street\": null}, {\"name\": \"Детский сад № 419\", \"street\": null}, {\"name\": \"Детский сад № 455\", \"street\": null}, {\"name\": \"Детский сад №465\", \"street\": null}, {\"name\": \"Школа-интернат «Эверест»\", \"street\": null}]}, \"bad\": 54, \"positive\": -19.0, \"violations\": {\"len\": 8, \"data\": [{\"name\": \"Школа Студия \\\"Okeyprofi\\\"\", \"street\": null, \"bad\": \"Красное&Белое, 64, Shchorsa Street, Чемпион Парк, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620130, Russia\"}, {\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Tveritina Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Red&White, 39, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Косулинская пивоварня, 41, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Центр развития ребёнка «Дошколёнок»\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null, \"bad\": \"Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Гимназия № 120\", \"street\": null, \"bad\": \"Красное&Белое, 64, Shchorsa Street, Чемпион Парк, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620130, Russia\"}]}, \"index\": 69, \"rating\": 0}",
						"{\"good\": 42, \"park\": 3, \"cigarettes\": 6, \"alcohol\": 6, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 11.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 70, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 71, \"rating\": 100}",
						"{\"good\": 179, \"park\": 6, \"cigarettes\": 12, \"alcohol\": 30, \"educational\": 34, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 48, \"positive\": 41.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 72, \"rating\": 100}",
						"{\"good\": 77, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 18, \"educational\": 10, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Чудо-Центр\", \"street\": null}, {\"name\": \"Оксфордский языковой центр\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад № 52\", \"street\": null}, {\"name\": \"Детский сад № 43 «Академия детства»\", \"street\": null}, {\"name\": null, \"street\": \"улица Соболева\"}, {\"name\": \"Детский сад № 151\", \"street\": null}]}, \"bad\": 21, \"positive\": 17.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 73, \"rating\": 100}",
						"{\"good\": 10, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 74, \"rating\": 100}",
						"{\"good\": 15, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 3, \"educational\": 4, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Чудо-Центр\", \"street\": null}, {\"name\": null, \"street\": \"улица Соболева\"}]}, \"bad\": 18, \"positive\": -10.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 75, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 76, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 77, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 78, \"rating\": 40}",
						"{\"good\": 37, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 11, \"educational\": 20, \"transport\": {\"len\": 11, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Средняя школа № 183\", \"street\": null}, {\"name\": \"Средняя школа № 170\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Екатеринбургский техникум «Автоматика»\", \"street\": \"Надеждинская улица\"}, {\"name\": \"Десткий сад № 179\", \"street\": null}, {\"name\": \"Детский сад № 175\", \"street\": null}, {\"name\": \"Детский сад № 197\", \"street\": null}, {\"name\": \"Школа № 148\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад комбинированного вида № 55\", \"street\": \"улица Миномётчиков\"}]}, \"bad\": 12, \"positive\": 6.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 79, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 80, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 81, \"rating\": 40}",
						"{\"good\": 12, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 82, \"rating\": 100}",
						"{\"good\": 0, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 83, \"rating\": 40}",
						"{\"good\": 42, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 18.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 84, \"rating\": 100}",
						"{\"good\": 14, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 85, \"rating\": 100}",
						"{\"good\": 27, \"park\": 4, \"cigarettes\": 4, \"alcohol\": 7, \"educational\": 12, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 15, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 86, \"rating\": 40}",
						"{\"good\": 39, \"park\": 11, \"cigarettes\": 3, \"alcohol\": 13, \"educational\": 15, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 26, \"positive\": -6.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 87, \"rating\": 40}",
						"{\"good\": 144, \"park\": 2, \"cigarettes\": 36, \"alcohol\": 39, \"educational\": 40, \"transport\": {\"len\": 24, \"data\": [{\"name\": \"Детско-юношеский клуб \\\"Тинейджер-шоу\\\"\", \"street\": null}, {\"name\": \"Лицей №128\", \"street\": null}, {\"name\": \"Детский сад №406\", \"street\": null}, {\"name\": \"Школа №81\", \"street\": null}, {\"name\": \"Детский сад №10\", \"street\": null}, {\"name\": \"Детский сад №165\", \"street\": null}, {\"name\": \"Детский сад №22\", \"street\": null}, {\"name\": \"Детский сад №319\", \"street\": null}, {\"name\": \"Детский сад №2\", \"street\": null}, {\"name\": \"Детский сад №569\", \"street\": null}, {\"name\": \"Детский сад №339\", \"street\": null}, {\"name\": \"Школа №138\", \"street\": null}, {\"name\": \"Детский сад №499\", \"street\": null}, {\"name\": \"Детский сад №387\", \"street\": null}, {\"name\": \"Детский сад №420\", \"street\": null}, {\"name\": \"Детский сад №377\", \"street\": null}, {\"name\": \"Детский сад №475\", \"street\": null}, {\"name\": \"Детский сад № 461\", \"street\": null}, {\"name\": \"Детский сад №244\", \"street\": null}, {\"name\": \"Детский сад № 15\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №203\", \"street\": null}, {\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"Детский сад №521\", \"street\": null}]}, \"bad\": 56, \"positive\": 16.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Школа-интернат №18\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Школа №95\", \"street\": null, \"bad\": \"МЕГА Фейерверки, улица Ломоносова, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Школа №95\", \"street\": null, \"bad\": \"проспект Космонавтов, Калиновский, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620058, Russia\"}, {\"name\": \"Детский сад №153\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}]}, \"index\": 88, \"rating\": 60}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 89, \"rating\": 100}",
						"{\"good\": 26, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 5, \"educational\": 6, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Чудо-Центр\", \"street\": null}, {\"name\": null, \"street\": \"улица Соболева\"}, {\"name\": \"Детский сад № 67\", \"street\": null}]}, \"bad\": 12, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 90, \"rating\": 100}",
						"{\"good\": 170, \"park\": 15, \"cigarettes\": 14, \"alcohol\": 30, \"educational\": 61, \"transport\": {\"len\": 47, \"data\": [{\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Карапуз\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детско-юношеский клуб \\\"Тинейджер-шоу\\\"\", \"street\": null}, {\"name\": \"интернат #111\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"Кировградская улица\"}, {\"name\": \"Гимназия №205 Театр\", \"street\": \"улица Победы\"}, {\"name\": \"Детский сад № 155 «Улыбка»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 135 «Радуга»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 129 «Колокольчик»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Школа №115\", \"street\": \"Фестивальная улица\"}, {\"name\": \"Гимназия № 144\", \"street\": null}, {\"name\": \"Школа №72\", \"street\": null}, {\"name\": \"Школа № 80\", \"street\": null}, {\"name\": \"Лицей №128\", \"street\": null}, {\"name\": \"Школа №178\", \"street\": null}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": \"Стахановская улица\"}, {\"name\": \"Детский сад №406\", \"street\": null}, {\"name\": \"Детский сад №411\", \"street\": null}, {\"name\": \"Школа №81\", \"street\": null}, {\"name\": \"Детский сад №10\", \"street\": null}, {\"name\": \"Детский сад №165\", \"street\": null}, {\"name\": \"Детский сад №22\", \"street\": null}, {\"name\": \"Детский сад №319\", \"street\": null}, {\"name\": \"Гимназия \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Начальная школа \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Школа \\\"Источник\\\"\", \"street\": null}, {\"name\": \"Детский сад № 371\", \"street\": null}, {\"name\": \"Детский сад № 399\", \"street\": null}, {\"name\": \"Детский сад № 318\", \"street\": null}, {\"name\": \"Детский сад № 432\", \"street\": null}, {\"name\": \"Детский сад №244\", \"street\": null}, {\"name\": \"Детский сад № 215\", \"street\": null}, {\"name\": \"Детский сад №134\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад № 478\", \"street\": null}, {\"name\": \"Детский сад №431\", \"street\": null}, {\"name\": \"Детский сад №382\", \"street\": null}, {\"name\": \"Детский сад №203\", \"street\": null}, {\"name\": \"Детский сад №514 \\\"Детство\\\"\", \"street\": null}, {\"name\": \"Детский сад № 355\", \"street\": null}, {\"name\": \"Детский сад Арт-Этюд\", \"street\": null}, {\"name\": \"Детский сад №40/228 Капитошка\", \"street\": null}, {\"name\": \"Детский сад №422\", \"street\": null}, {\"name\": \"Детский сад №153\", \"street\": null}, {\"name\": \"Начальная школа №113\", \"street\": null}]}, \"bad\": 35, \"positive\": 50.0, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Темное светлое, 101, улица Бакинских комиссаров, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}, {\"name\": \"Школа №113\", \"street\": \"улица Бакинских Комиссаров\", \"bad\": \"улица Бакинских комиссаров, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}, {\"name\": \"Школа № 80\", \"street\": null, \"bad\": \"Пив&ко, 35, улица Ильича, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Школа-интернат №18\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Детский сад № 318\", \"street\": null, \"bad\": \"Фауст, улица 40-летия Октября, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620088, Russia\"}, {\"name\": \"Детский сад №153\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}]}, \"index\": 91, \"rating\": 60}",
						"{\"good\": 60, \"park\": 6, \"cigarettes\": 0, \"alcohol\": 7, \"educational\": 28, \"transport\": {\"len\": 19, \"data\": [{\"name\": \"Детский сад №126\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"УрГУПС\", \"street\": null}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": null, \"street\": \"улица Черепанова\"}, {\"name\": \"Детский сад № 248\", \"street\": null}, {\"name\": \"Школа № 201 «Согласие»\", \"street\": null}, {\"name\": \"Средняя школа №208\", \"street\": null}, {\"name\": \"Детский сад № 125\", \"street\": null}, {\"name\": \"Детский сад № 272\", \"street\": null}, {\"name\": \"Детский сад № 123\", \"street\": null}, {\"name\": \"Детский сад № 199 Созидание\", \"street\": null}, {\"name\": \"Педагогический колледж\", \"street\": null}, {\"name\": \"Детский сад № 286\", \"street\": null}, {\"name\": \"Детский сад № 283\", \"street\": null}, {\"name\": \"Школа № 149\", \"street\": null}, {\"name\": \"Школа № 29\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null}]}, \"bad\": 15, \"positive\": 15.0, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Budo, 22, Opalikhinskaya Street, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"улица Одинарка, Ольховский Парк, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая, улица Единого Фронта, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}]}, \"index\": 92, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 93, \"rating\": 40}",
						"{\"good\": 20, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 18, \"positive\": -8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 94, \"rating\": 40}",
						"{\"good\": 116, \"park\": 12, \"cigarettes\": 7, \"alcohol\": 25, \"educational\": 41, \"transport\": {\"len\": 28, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"УрГУ\", \"street\": null}, {\"name\": \"Школа Студия \\\"Okeyprofi\\\"\", \"street\": null}, {\"name\": \"ФГБОУ ВО Уральский ГАУ\", \"street\": \"улица Белинского\"}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Интернат глухонемых\", \"street\": null}, {\"name\": \"Гимназия № 70\", \"street\": null}, {\"name\": \"Детский сад № 49\", \"street\": null}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Детский сад № 451\", \"street\": null}, {\"name\": \"Детский сад № 366, центр развития ребёнка\", \"street\": null}, {\"name\": \"Школа № 175\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Гимназия № 120\", \"street\": null}, {\"name\": \"Детский сад № 222\", \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Детский сад № 386 «Знайка»\", \"street\": null}, {\"name\": \"Детский сад № 233\", \"street\": null}, {\"name\": \"Детский сад № 79\", \"street\": null}, {\"name\": \"Лицей №3\", \"street\": null}, {\"name\": \"Детский сад № 419\", \"street\": null}, {\"name\": \"Детский сад № 455\", \"street\": null}, {\"name\": \"Детский сад № 11\", \"street\": null}, {\"name\": \"Гимназия № 39\", \"street\": null}, {\"name\": \"Детский сад №465\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа-интернат «Эверест»\", \"street\": null}, {\"name\": \"Школа №102\", \"street\": null}]}, \"bad\": 47, \"positive\": 11.0, \"violations\": {\"len\": 7, \"data\": [{\"name\": \"Школа Студия \\\"Okeyprofi\\\"\", \"street\": null, \"bad\": \"Красное&Белое, 64, Shchorsa Street, Чемпион Парк, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620130, Russia\"}, {\"name\": \"Интернат глухонемых\", \"street\": null, \"bad\": \"Магнум-винотека, 161, улица Белинского, Южные Ворота, Ботанический, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620089, Russia\"}, {\"name\": \"ГАОУ СПО СО Екатеринбургский Монтажный Колледж\", \"street\": \"улица Декабристов\", \"bad\": \"Столовая, 83А, улица Декабристов, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Red&White, 39, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Косулинская пивоварня, 41, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Гимназия № 120\", \"street\": null, \"bad\": \"Красное&Белое, 64, Shchorsa Street, Чемпион Парк, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620130, Russia\"}, {\"name\": \"Детский сад № 455\", \"street\": null, \"bad\": \"KFC, улица 8 Марта, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}]}, \"index\": 95, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 96, \"rating\": 40}",
						"{\"good\": 160, \"park\": 41, \"cigarettes\": 9, \"alcohol\": 34, \"educational\": 46, \"transport\": {\"len\": 28, \"data\": [{\"name\": \"ММИ УрФУ\", \"street\": null}, {\"name\": \"ЭТФ УрФУ\", \"street\": null}, {\"name\": \"Екатеринбургская академия современного искусства\", \"street\": null}, {\"name\": \"Институт развития образования\", \"street\": null}, {\"name\": \"Уральский промышленно-экономический техникум\", \"street\": null}, {\"name\": \"Сад чудес\", \"street\": null}, {\"name\": \"Уральский колледж экономики и права\", \"street\": \"улица Сони Морозовой\"}, {\"name\": \"Детский сад №99\", \"street\": null}, {\"name\": \"Лицей № 88\", \"street\": null}, {\"name\": \"Детский сад №276\", \"street\": null}, {\"name\": \"Лицей № 110 им. Л. К. Гришиной\", \"street\": null}, {\"name\": \"Детский сад № 276\", \"street\": null}, {\"name\": \"Школа № 13\", \"street\": null}, {\"name\": \"Гимназия № 94\", \"street\": null}, {\"name\": \"Детский сад № 520\", \"street\": null}, {\"name\": \"Детский сад № 441\", \"street\": null}, {\"name\": \"Детский сад № 363\", \"street\": null}, {\"name\": \"Гимназия № 8 им. Дягилева\", \"street\": null}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null}, {\"name\": \"Детский сад № 376\", \"street\": null}, {\"name\": \"Детский сад № 113\", \"street\": null}, {\"name\": \"Детский сад №550 Академия успеха\", \"street\": null}, {\"name\": \"школа №75\", \"street\": null}, {\"name\": \"Детский сад № 330 «Антошка»\", \"street\": null}, {\"name\": \"Гимназия № 37\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Химико-фармацевтический центр УрФУ\", \"street\": null}, {\"name\": \"Детский сад № 423\", \"street\": null}]}, \"bad\": 61, \"positive\": 19.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"KIBERone\", \"street\": \"улица Малышева\", \"bad\": \"А Ты Где, 137, улица Луначарского, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад № 276\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null, \"bad\": \"Первомайская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620108, Russia\"}, {\"name\": \"Уральский политехнический колледж\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Детский сад № 376\", \"street\": null, \"bad\": \"Red&White, 73, Bazhova Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}]}, \"index\": 97, \"rating\": 60}",
						"{\"good\": 87, \"park\": 12, \"cigarettes\": 6, \"alcohol\": 15, \"educational\": 23, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 29, \"positive\": 14.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 98, \"rating\": 100}",
						"{\"good\": 6, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 99, \"rating\": 100}",
						"{\"good\": 70, \"park\": 5, \"cigarettes\": 7, \"alcohol\": 23, \"educational\": 27, \"transport\": {\"len\": 23, \"data\": [{\"name\": \"Детский сад Мурзилка\", \"street\": null}, {\"name\": \"Talento\", \"street\": null}, {\"name\": \"Сёма\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": \"Июльская улица\"}, {\"name\": \"Маленькая страна\", \"street\": null}, {\"name\": \"Гимназия N35\", \"street\": null}, {\"name\": \"Академия робототехники RoboNest\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": null}, {\"name\": \"Детский сад №180\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": null}, {\"name\": \"Детский сад № 517\", \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": \"Детский сад № 322\", \"street\": null}, {\"name\": \"Средняя школа № 165\", \"street\": null}, {\"name\": \"Детский сад Акадеша\", \"street\": null}, {\"name\": \"Детский сад № 536 «Сказка»\", \"street\": null}, {\"name\": \"Детский сад № 588\", \"street\": null}, {\"name\": \"Детский сад № 468\", \"street\": null}, {\"name\": \"Детский сад № 533\", \"street\": null}, {\"name\": \"Детский сад № 459\", \"street\": null}, {\"name\": \"Детский сад № 236\", \"street\": null}]}, \"bad\": 27, \"positive\": 8.0, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"Пивко, 6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}]}, \"index\": 100, \"rating\": 60}",
						"{\"good\": 80, \"park\": 26, \"cigarettes\": 5, \"alcohol\": 19, \"educational\": 19, \"transport\": {\"len\": 15, \"data\": [{\"name\": \"Ясли\", \"street\": null}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": null}, {\"name\": \"Amante\", \"street\": null}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\"}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": \"Школа № 30\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Средняя школа №208\", \"street\": null}, {\"name\": \"Детский сад № 125\", \"street\": null}, {\"name\": \"Гимназия №155\", \"street\": null}, {\"name\": \"Детский сад № 372\", \"street\": null}, {\"name\": \"Детский сад № 393\", \"street\": null}, {\"name\": \"Детский сад № 174\", \"street\": null}, {\"name\": \"Техникум индустрии питания и услуг «Кулинар»\", \"street\": null}, {\"name\": \"Детский сад №369\", \"street\": null}]}, \"bad\": 32, \"positive\": 8.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Amante\", \"street\": null, \"bad\": \"XXXX, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\", \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"ФГОУ ВПО Уральская ГСХА\", \"street\": null, \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Pizza mia, 23, Вокзальная улица, Мельница, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}, {\"name\": \"Детский сад №369\", \"street\": null, \"bad\": \"Сушкоф, 25, Mamina-Sibiryaka Street, Екатерининский Парк, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}]}, \"index\": 101, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 102, \"rating\": 40}",
						"{\"good\": 79, \"park\": 6, \"cigarettes\": 7, \"alcohol\": 29, \"educational\": 33, \"transport\": {\"len\": 27, \"data\": [{\"name\": \"Маленький вундеркинд\", \"street\": null}, {\"name\": \"Вавилон\", \"street\": null}, {\"name\": \"Чудо-Центр\", \"street\": null}, {\"name\": \"Центр изучения английского языка Мергиной Марины\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа №74\", \"street\": \"улица Крауля\"}, {\"name\": \"Детский сад № 13\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 48\", \"street\": null}, {\"name\": \"Школа № 171\", \"street\": null}, {\"name\": \"Детский сад № 541\", \"street\": null}, {\"name\": \"Детский сад № 534 «НПО Автоматики»\", \"street\": null}, {\"name\": \"Детский сад № 143\", \"street\": null}, {\"name\": \"Школа № 121\", \"street\": null}, {\"name\": \"Менталитет\", \"street\": null}, {\"name\": \"Детский сад №348\", \"street\": null}, {\"name\": \"Школа №63\", \"street\": null}, {\"name\": \"Детский сад № 511\", \"street\": null}, {\"name\": \"Детский сад № 5\", \"street\": null}, {\"name\": \"Детский сад № 510\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": \"Детский сад № 539\", \"street\": null}, {\"name\": \"Детский сад компенсирующего вида № 466\", \"street\": null}, {\"name\": \"Детский сад компенсирующего вида № 205\", \"street\": null}, {\"name\": \"Детский сад № 67\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 42, \"positive\": -2.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Fanagoria, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Хмель и солод, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Пивкофф, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 511\", \"street\": null, \"bad\": \"PizzaMia, 53, Kraulya Street, Татищев, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}]}, \"index\": 103, \"rating\": 0}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Десткий сад № 179\", \"street\": null}, {\"name\": \"Детский сад комбинированного вида № 55\", \"street\": \"улица Миномётчиков\"}]}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 104, \"rating\": 100}",
						"{\"good\": 106, \"park\": 6, \"cigarettes\": 7, \"alcohol\": 34, \"educational\": 54, \"transport\": {\"len\": 40, \"data\": [{\"name\": \"Детский сад Мурзилка\", \"street\": null}, {\"name\": \"Клубника\", \"street\": null}, {\"name\": \"Talento\", \"street\": null}, {\"name\": \"Сёма\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Детский сад #184\", \"street\": null}, {\"name\": \"Гимназия N35\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа № 145\", \"street\": null}, {\"name\": \"ЧОУ СОШ «Творчество»\", \"street\": \"улица Пионеров\"}, {\"name\": \"Школа № 146\", \"street\": null}, {\"name\": \"Детский сад №180\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": null}, {\"name\": \"Детский сад № 517\", \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": \"Детский сад № 322\", \"street\": null}, {\"name\": \"Средняя школа № 165\", \"street\": null}, {\"name\": \"Детский сад №550 Академия успеха\", \"street\": null}, {\"name\": \"Детский сад Акадеша\", \"street\": null}, {\"name\": \"Детский сад № 536 «Сказка»\", \"street\": null}, {\"name\": \"Детский сад № 588\", \"street\": null}, {\"name\": \"Детский сад № 501\", \"street\": null}, {\"name\": \"Детский сад № 450\", \"street\": null}, {\"name\": \"Профессиональное училище парикмахерского мастерства\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 230\", \"street\": null}, {\"name\": \"школа №75\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Детский сад № 230 \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад № 262\", \"street\": null}, {\"name\": \"Гимназия № 212 «Екатеринбург — Париж»\", \"street\": null}, {\"name\": \"Детский сад № 423\", \"street\": null}, {\"name\": \"Детский сад №91\", \"street\": null}, {\"name\": \"Детский сад №369\", \"street\": null}, {\"name\": \"Детский сад №288\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": \"Уральская улица\"}, {\"name\": \"Средняя школа № 125\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 53, \"positive\": 0.0, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"Пивко, 6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Красное&Белое, 45, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Not Turkey kitchen, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Детский сад № 68\", \"street\": null, \"bad\": \"Не турецкая кухня, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Детский сад № 505\", \"street\": null, \"bad\": \"Красное&Белое, 16, Советская улица, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620067, Russia\"}]}, \"index\": 105, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 106, \"rating\": 40}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 107, \"rating\": 100}",
						"{\"good\": 12, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 7, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Школа № 122\", \"street\": null}, {\"name\": \"Детский сад № 46\", \"street\": null}, {\"name\": \"Детский сад № 132\", \"street\": null}, {\"name\": \"Детский сад № 312\", \"street\": null}, {\"name\": \"Школа № 129\", \"street\": null}, {\"name\": \"Детский просветительский центр / Воскресная школа\", \"street\": null}]}, \"bad\": 4, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 108, \"rating\": 100}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 109, \"rating\": 100}",
						"{\"good\": 23, \"park\": 7, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 110, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 111, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 112, \"rating\": 40}",
						"{\"good\": 15, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 113, \"rating\": 100}",
						"{\"good\": 14, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 114, \"rating\": 100}",
						"{\"good\": 73, \"park\": 11, \"cigarettes\": 6, \"alcohol\": 19, \"educational\": 31, \"transport\": {\"len\": 16, \"data\": [{\"name\": \"ММИ УрФУ\", \"street\": null}, {\"name\": \"ЭТФ УрФУ\", \"street\": null}, {\"name\": \"Детская хоровая школа №1\", \"street\": null}, {\"name\": \"Растём вместе\", \"street\": null}, {\"name\": \"Институт развития образования\", \"street\": null}, {\"name\": \"Сад чудес\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null}, {\"name\": \"Детский сад № 468\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Детский сад № 255\", \"street\": null}, {\"name\": \"Детский сад № 423\", \"street\": null}, {\"name\": \"Детский сад № 407 «Жаворонок»\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": \"Уральская улица\"}]}, \"bad\": 38, \"positive\": -1.5, \"violations\": {\"len\": 10, \"data\": [{\"name\": \"Гуманитарный университет\", \"street\": null, \"bad\": \"Столовая, 19, Студенческая улица, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}, {\"name\": \"Растём вместе\", \"street\": null, \"bad\": \"Столовая, 2, улица Кулибина, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Красное&Белое, 45, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Not Turkey kitchen, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Лицей № 130\", \"street\": null, \"bad\": \"Тройка, 26, Академическая улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"цветочный магазин, 10, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null, \"bad\": \"Первомайская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620108, Russia\"}, {\"name\": \"Детский сад № 68\", \"street\": null, \"bad\": \"Не турецкая кухня, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая № 2, 23, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}, {\"name\": \"Детский сад № 109\", \"street\": null, \"bad\": \"Красное&Белое, 10, Kuryinskiy Lane, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}]}, \"index\": 115, \"rating\": 0}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 8, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 116, \"rating\": 100}",
						"{\"good\": 67, \"park\": 12, \"cigarettes\": 5, \"alcohol\": 16, \"educational\": 16, \"transport\": {\"len\": 15, \"data\": [{\"name\": \"Уральский государственный аграрный колледж\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Ткачей\"}, {\"name\": \"Школа №28\", \"street\": null}, {\"name\": \"Интернат глухонемых\", \"street\": null}, {\"name\": \"Механический техникум\", \"street\": null}, {\"name\": \"Детский сад № 49\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Солнечный\", \"street\": null}, {\"name\": \"Детский сад №465\", \"street\": null}, {\"name\": \"Школа-интернат «Эверест»\", \"street\": null}, {\"name\": \"Школа №14\", \"street\": null}, {\"name\": \"Детский сад № 555\", \"street\": null}, {\"name\": \"Школа №102\", \"street\": null}]}, \"bad\": 35, \"positive\": -1.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Интернат глухонемых\", \"street\": null, \"bad\": \"Магнум-винотека, 161, улица Белинского, Южные Ворота, Ботанический, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620089, Russia\"}]}, \"index\": 117, \"rating\": 0}",
						"{\"good\": 12, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 118, \"rating\": 100}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 119, \"rating\": 100}",
						"{\"good\": 183, \"park\": 13, \"cigarettes\": 23, \"alcohol\": 36, \"educational\": 36, \"transport\": {\"len\": 26, \"data\": [{\"name\": \"ОЦ Вавилон\", \"street\": null}, {\"name\": \"Уральский государственный аграрный колледж\", \"street\": null}, {\"name\": \"Планета счастья\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа №28\", \"street\": null}, {\"name\": \"Интернат глухонемых\", \"street\": null}, {\"name\": \"Механический техникум\", \"street\": null}, {\"name\": \"№ 586 \\\"Остров детства\\\"\", \"street\": null}, {\"name\": \"Детский сад № 584\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 326\", \"street\": null}, {\"name\": \"Детский сад №544\", \"street\": null}, {\"name\": \"Лицей №3\", \"street\": null}, {\"name\": \"Детский сад № 11\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 18\", \"street\": null}, {\"name\": \"Детский сад № 147\", \"street\": null}, {\"name\": \"Солнечный\", \"street\": null}, {\"name\": \"Гимназия № 39\", \"street\": null}, {\"name\": \"Детский сад № 33\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа №14\", \"street\": null}, {\"name\": \"Детский сад № 555\", \"street\": null}, {\"name\": \"Школа №102\", \"street\": null}]}, \"bad\": 68, \"positive\": 23.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Планета счастья\", \"street\": null, \"bad\": \"Магнум-винотека, 1, улица Юлиуса Фучика, Два Капитана, Ботанический, Чкаловский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620130, Russia\"}, {\"name\": \"Интернат глухонемых\", \"street\": null, \"bad\": \"Магнум-винотека, 161, улица Белинского, Южные Ворота, Ботанический, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620089, Russia\"}, {\"name\": \"Детский сад\", \"street\": null, \"bad\": \"Pizza Mia, улица Белинского, Созвездие, Ботанический, Чкаловский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620089, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Самоцветный бульвар, Два Капитана, Ботанический, Чкаловский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620089, Russia\"}]}, \"index\": 120, \"rating\": 60}",
						"{\"good\": 33, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 16.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 121, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 122, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 123, \"rating\": 40}",
						"{\"good\": 8, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Уральский лесотехнический университет\", \"street\": \"Сибирский тракт\"}]}, \"bad\": 0, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 124, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 125, \"rating\": 100}",
						"{\"good\": 63, \"park\": 1, \"cigarettes\": 10, \"alcohol\": 14, \"educational\": 15, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 28, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 126, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 127, \"rating\": 100}",
						"{\"good\": 39, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 25, \"transport\": {\"len\": 17, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Средняя школа № 183\", \"street\": null}, {\"name\": \"Средняя школа № 83\", \"street\": null}, {\"name\": \"Средняя школа № 170\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Екатеринбургский техникум «Автоматика»\", \"street\": \"Надеждинская улица\"}, {\"name\": \"Десткий сад № 179\", \"street\": null}, {\"name\": \"Детский сад № 85\", \"street\": null}, {\"name\": \"Детский сад № 196\", \"street\": null}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 117\", \"street\": null}, {\"name\": \"Детский сад № 175\", \"street\": null}, {\"name\": \"Детский сад № 197\", \"street\": null}, {\"name\": \"Школа № 148\", \"street\": null}, {\"name\": \"Школа № 149\", \"street\": null}, {\"name\": \"Школа № 166\", \"street\": null}, {\"name\": \"Школа № 147\", \"street\": null}]}, \"bad\": 8, \"positive\": 11.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 128, \"rating\": 100}",
						"{\"good\": 151, \"park\": 0, \"cigarettes\": 23, \"alcohol\": 30, \"educational\": 45, \"transport\": {\"len\": 31, \"data\": [{\"name\": \"Детско-юношеский клуб \\\"Тинейджер-шоу\\\"\", \"street\": null}, {\"name\": \"интернат #111\", \"street\": null}, {\"name\": \"Детский сад №538\", \"street\": \"улица Бакинских Комиссаров\"}, {\"name\": \"Гимназия №205 Театр\", \"street\": \"улица Победы\"}, {\"name\": \"Школа №72\", \"street\": null}, {\"name\": \"Лицей №128\", \"street\": null}, {\"name\": \"Лицей №100\", \"street\": \"улица Ильича\"}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": \"Стахановская улица\"}, {\"name\": \"Детский сад №406\", \"street\": null}, {\"name\": \"Детский сад №411\", \"street\": null}, {\"name\": \"Школа №81\", \"street\": null}, {\"name\": \"Детский сад №10\", \"street\": null}, {\"name\": \"Детский сад №165\", \"street\": null}, {\"name\": \"Детский сад №22\", \"street\": null}, {\"name\": \"Детский сад №319\", \"street\": null}, {\"name\": \"Детский сад №2\", \"street\": null}, {\"name\": \"Детский сад №569\", \"street\": null}, {\"name\": \"Детский сад №339\", \"street\": null}, {\"name\": \"Детский сад №387\", \"street\": null}, {\"name\": \"Детский сад №420\", \"street\": null}, {\"name\": \"Детский сад №377\", \"street\": null}, {\"name\": \"Детский сад №244\", \"street\": null}, {\"name\": \"Детский сад №134\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №431\", \"street\": null}, {\"name\": \"Школа №103\", \"street\": null}, {\"name\": \"Детский сад №460\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №203\", \"street\": null}, {\"name\": \"Детский сад №422\", \"street\": null}, {\"name\": \"Начальная школа №113\", \"street\": null}]}, \"bad\": 37, \"positive\": 38.5, \"violations\": {\"len\": 7, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Темное светлое, 101, улица Бакинских комиссаров, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}, {\"name\": \"Школа №113\", \"street\": \"улица Бакинских Комиссаров\", \"bad\": \"улица Бакинских комиссаров, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}, {\"name\": \"Школа-интернат №18\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Школа № 27\", \"street\": null, \"bad\": \"Коммунистическая улица, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Школа №95\", \"street\": null, \"bad\": \"МЕГА Фейерверки, улица Ломоносова, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Коммунистическая улица, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Детский сад №153\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}]}, \"index\": 129, \"rating\": 60}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 130, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 131, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 132, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 133, \"rating\": 40}",
						"{\"good\": 55, \"park\": 12, \"cigarettes\": 2, \"alcohol\": 13, \"educational\": 27, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"Детская Музыкальная Школа №5 им. В. В. Знаменского\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": \"улица Баумана\"}, {\"name\": \"Школа №67\", \"street\": \"улица Стачек\"}, {\"name\": \"Учебный центр МРСК Урала\", \"street\": \"улица Электриков\"}, {\"name\": \"Детский сад №86\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Школа №66\", \"street\": null}, {\"name\": \"Школа №78\", \"street\": null}, {\"name\": \"Детский сад №523\", \"street\": null}, {\"name\": \"Школа Гелиос\", \"street\": null}, {\"name\": \"Детский сад № 170\", \"street\": null}, {\"name\": \"Детский сад №176\", \"street\": null}, {\"name\": \"Детский сад Гелиос\", \"street\": null}, {\"name\": \"Школа № 112\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 20, \"positive\": 7.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null, \"bad\": \"College canteen, 50, проспект Космонавтов, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"Коасное и Белое, 24, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"красно белое, 29, улица Баумана, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}]}, \"index\": 134, \"rating\": 60}",
						"{\"good\": 12, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 135, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 136, \"rating\": 40}",
						"{\"good\": 20, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 12, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": null, \"street\": \"улица Черепанова\"}, {\"name\": \"Детский сад № 248\", \"street\": null}, {\"name\": \"Школа № 201 «Согласие»\", \"street\": null}, {\"name\": \"Детский сад № 286\", \"street\": null}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 117\", \"street\": null}, {\"name\": \"Школа № 4\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 2, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 137, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 138, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 139, \"rating\": 40}",
						"{\"good\": 38, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 6, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 11, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 140, \"rating\": 100}",
						"{\"good\": 142, \"park\": 10, \"cigarettes\": 31, \"alcohol\": 43, \"educational\": 55, \"transport\": {\"len\": 35, \"data\": [{\"name\": null, \"street\": null}, {\"name\": null, \"street\": \"улица Баумана\"}, {\"name\": \"Лицей №128\", \"street\": null}, {\"name\": \"Школа-интернат №18\", \"street\": null}, {\"name\": \"Детский сад №411\", \"street\": null}, {\"name\": \"Детский сад №339\", \"street\": null}, {\"name\": \"РГППУ\", \"street\": \"Каширская улица\"}, {\"name\": null, \"street\": \"Каширская улица\"}, {\"name\": \"Школа №138\", \"street\": null}, {\"name\": \"Детский сад №499\", \"street\": null}, {\"name\": \"Детский сад №387\", \"street\": null}, {\"name\": \"Детский сад №420\", \"street\": null}, {\"name\": \"Детский сад №377\", \"street\": null}, {\"name\": \"Детский сад №475\", \"street\": null}, {\"name\": \"Детский сад № 461\", \"street\": null}, {\"name\": \"Детский сад №151\", \"street\": null}, {\"name\": \"Детский сад №576\", \"street\": null}, {\"name\": \"Детский сад №274\", \"street\": null}, {\"name\": \"Детский сад № 15\", \"street\": null}, {\"name\": \"Детский сад №168\", \"street\": null}, {\"name\": \"Детский сад №440\", \"street\": null}, {\"name\": \"Детский сад №477\", \"street\": null}, {\"name\": \"Детский сад №500\", \"street\": null}, {\"name\": \"Школа №46\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №460\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №176\", \"street\": null}, {\"name\": \"Детский сад Гелиос\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"Детский сад №521\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 58, \"positive\": 13.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Две ладошки\", \"street\": null, \"bad\": \"улица Победы, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Школа №95\", \"street\": null, \"bad\": \"МЕГА Фейерверки, улица Ломоносова, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Школа №95\", \"street\": null, \"bad\": \"проспект Космонавтов, Калиновский, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620058, Russia\"}, {\"name\": \"Детский сад №274\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}, {\"name\": \"Детский сад № 551\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}]}, \"index\": 141, \"rating\": 60}",
						"{\"good\": 30, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 3, \"educational\": 21, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"Средняя школа № 170\", \"street\": null}, {\"name\": \"Десткий сад № 179\", \"street\": null}, {\"name\": \"Детский сад № 18\", \"street\": null}, {\"name\": \"Детский сад № 123\", \"street\": null}, {\"name\": \"Детский сад № 196\", \"street\": null}, {\"name\": \"Детский сад № 175\", \"street\": null}, {\"name\": \"Детский сад № 197\", \"street\": null}, {\"name\": \"Школа № 148\", \"street\": null}, {\"name\": \"Школа № 149\", \"street\": null}, {\"name\": \"Школа № 166\", \"street\": null}, {\"name\": \"Школа № 29\", \"street\": null}, {\"name\": \"Школа № 6\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад комбинированного вида № 55\", \"street\": \"улица Миномётчиков\"}]}, \"bad\": 11, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 142, \"rating\": 100}",
						"{\"good\": 115, \"park\": 17, \"cigarettes\": 25, \"alcohol\": 52, \"educational\": 56, \"transport\": {\"len\": 38, \"data\": [{\"name\": \"Детская школа искусств №5\", \"street\": null}, {\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Карапуз\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Садик счастья\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"Кировградская улица\"}, {\"name\": \"Гимназия №205 Театр\", \"street\": \"улица Победы\"}, {\"name\": \"Детский сад № 155 «Улыбка»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 135 «Радуга»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 129 «Колокольчик»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Учебный центр МРСК Урала\", \"street\": \"улица Электриков\"}, {\"name\": \"Гимназия № 144\", \"street\": null}, {\"name\": \"Школа №72\", \"street\": null}, {\"name\": \"Школа № 80\", \"street\": null}, {\"name\": null, \"street\": \"улица Машиностроителей\"}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": \"Стахановская улица\"}, {\"name\": \"Детский сад №406\", \"street\": null}, {\"name\": \"Детский сад №411\", \"street\": null}, {\"name\": \"Гимназия \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Начальная школа \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Детский сад №86\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Школа \\\"Источник\\\"\", \"street\": null}, {\"name\": \"Детский сад № 432\", \"street\": null}, {\"name\": \"Детский сад № 215\", \"street\": null}, {\"name\": \"Детский сад №274\", \"street\": null}, {\"name\": \"Детский сад № 551\", \"street\": null}, {\"name\": \"Детский сад №523\", \"street\": null}, {\"name\": \"Детский сад № 428\", \"street\": null}, {\"name\": \"Детский сад № 478\", \"street\": null}, {\"name\": \"Детский сад №460\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №514 \\\"Детство\\\"\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад Арт-Этюд\", \"street\": null}, {\"name\": \"Детский сад №40/228 Капитошка\", \"street\": null}, {\"name\": \"Детский сад №422\", \"street\": null}]}, \"bad\": 72, \"positive\": -14.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Садик счастья\", \"street\": null, \"bad\": \"Магнум-винотека, 8, Кировградская улица, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Две ладошки\", \"street\": null, \"bad\": \"улица Победы, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Школа № 80\", \"street\": null, \"bad\": \"Пив&ко, 35, улица Ильича, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null, \"bad\": \"College canteen, 50, проспект Космонавтов, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Екатеринбургский промышленно-технологический техникум (ЕПТТ) им. В.М. Курочкина\", \"street\": \"улица Машиностроителей\", \"bad\": \"13, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Российский государственный профессионально-педагогический университет\", \"street\": null, \"bad\": \"Столовая, 11, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}]}, \"index\": 143, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 144, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 145, \"rating\": 40}",
						"{\"good\": 98, \"park\": 10, \"cigarettes\": 14, \"alcohol\": 25, \"educational\": 32, \"transport\": {\"len\": 23, \"data\": [{\"name\": \"Ithub\", \"street\": null}, {\"name\": \"Школа № 184 «Новая Школа»\", \"street\": null}, {\"name\": \"Гимназия № 70\", \"street\": null}, {\"name\": \"Уральский государственный горный университет (УГГУ)\", \"street\": \"улица Куйбышева\"}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Школа № 175\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 559\", \"street\": null}, {\"name\": \"Детский сад № 462\", \"street\": null}, {\"name\": \"Детский сад № 485\", \"street\": null}, {\"name\": \"Детский сад № 302\", \"street\": null}, {\"name\": \"Детский сад № 222\", \"street\": null}, {\"name\": \"Лицей № 173\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Детский сад № 386 «Знайка»\", \"street\": null}, {\"name\": \"Школа № 143\", \"street\": null}, {\"name\": \"Детский сад № 444\", \"street\": null}, {\"name\": \"Детский сад № 518\", \"street\": null}, {\"name\": \"Детский сад № 413\", \"street\": null}, {\"name\": \"Станция юных натуралистов\", \"street\": null}, {\"name\": \"Детский сад №373\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 36, \"positive\": 13.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Роббо клуб\", \"street\": null, \"bad\": \"Пив&ко, 30, Palmiro Tolyatti Street, Гулливер, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}, {\"name\": \"Лицей № 173\", \"street\": null, \"bad\": \"8, Kuybysheva Street, Мечта, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}]}, \"index\": 146, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 147, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 148, \"rating\": 40}",
						"{\"good\": 121, \"park\": 34, \"cigarettes\": 18, \"alcohol\": 39, \"educational\": 42, \"transport\": {\"len\": 25, \"data\": [{\"name\": \"ФЭУ УрФУ\", \"street\": null}, {\"name\": \"ММИ УрФУ\", \"street\": null}, {\"name\": \"ЭТФ УрФУ\", \"street\": null}, {\"name\": \"Екатеринбургская академия современного искусства\", \"street\": null}, {\"name\": \"Уральский промышленно-экономический техникум\", \"street\": null}, {\"name\": \"ТЭФ УрФУ\", \"street\": \"улица Софьи Ковалевской\"}, {\"name\": \"Детский сад №99\", \"street\": null}, {\"name\": \"Лицей № 88\", \"street\": null}, {\"name\": \"Детский сад №276\", \"street\": null}, {\"name\": null, \"street\": \"Комсомольская улица\"}, {\"name\": \"Детский сад № 276\", \"street\": null}, {\"name\": null, \"street\": \"Шорный переулок\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 75\", \"street\": null}, {\"name\": \"Средняя школа № 7\", \"street\": null}, {\"name\": \"Детский сад № 479\", \"street\": null}, {\"name\": \"Школа № 134\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Химико-фармацевтический центр УрФУ\", \"street\": null}, {\"name\": \"Детский сад № 123 ОАО «РЖД»\", \"street\": null}, {\"name\": \"Детский сад №34\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": \"Детский сад № 299\", \"street\": null}, {\"name\": \"Детский сад № 261 «Речецветик»\", \"street\": null}]}, \"bad\": 70, \"positive\": -9.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад № 276\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Уральский политехнический колледж\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}]}, \"index\": 149, \"rating\": 0}",
						"{\"good\": 125, \"park\": 43, \"cigarettes\": 7, \"alcohol\": 14, \"educational\": 28, \"transport\": {\"len\": 20, \"data\": [{\"name\": \"Детский сад № 45\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа № 64\", \"street\": null}, {\"name\": \"Школа № 85\", \"street\": null}, {\"name\": \"Медицинская академия (корпус № 5)\", \"street\": null}, {\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Детский сад № 561\", \"street\": null}, {\"name\": \"Школа № 109\", \"street\": null}, {\"name\": \"Средняя школа № 140\", \"street\": null}, {\"name\": \"Лицей № 159\", \"street\": null}, {\"name\": \"Детский сад № 29\", \"street\": null}, {\"name\": \"Школа № 152\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №31\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"Рябинка, детский сад № 156\", \"street\": null}]}, \"bad\": 21, \"positive\": 41.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа № 152\", \"street\": null, \"bad\": \"Здравница, Волгоградская улица, Миллениум, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}]}, \"index\": 150, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 151, \"rating\": 40}",
						"{\"good\": 57, \"park\": 6, \"cigarettes\": 7, \"alcohol\": 20, \"educational\": 13, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Детская хоровая школа №1\", \"street\": null}, {\"name\": \"Растём вместе\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Средняя школа № 165\", \"street\": null}, {\"name\": \"Детский сад № 588\", \"street\": null}, {\"name\": \"Детский сад № 468\", \"street\": null}, {\"name\": \"Детский сад № 459\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Детский сад № 236\", \"street\": null}]}, \"bad\": 28, \"positive\": 0.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Растём вместе\", \"street\": null, \"bad\": \"Столовая, 2, улица Кулибина, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"цветочный магазин, 10, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}]}, \"index\": 152, \"rating\": 60}",
						"{\"good\": 125, \"park\": 36, \"cigarettes\": 6, \"alcohol\": 53, \"educational\": 42, \"transport\": {\"len\": 27, \"data\": [{\"name\": \"Ясли\", \"street\": null}, {\"name\": \"Институт Машиноведения УрО РАН\", \"street\": null}, {\"name\": \"Школа Конфуция\", \"street\": null}, {\"name\": \"Детский сад #184\", \"street\": null}, {\"name\": \"Екатеринбургская детская театральная школа\", \"street\": null}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": null}, {\"name\": \"Sunday Rock\", \"street\": null}, {\"name\": \"Amante\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Лицей № 110 им. Л. К. Гришиной\", \"street\": null}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 376\", \"street\": null}, {\"name\": \"Детский сад № 113\", \"street\": null}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Детский сад № 450\", \"street\": null}, {\"name\": \"Профессиональное училище парикмахерского мастерства\", \"street\": null}, {\"name\": \"школа №75\", \"street\": null}, {\"name\": \"Гимназия №155\", \"street\": null}, {\"name\": \"Детский сад № 393\", \"street\": null}, {\"name\": \"Детский сад № 174\", \"street\": null}, {\"name\": \"Гимназия № 212 «Екатеринбург — Париж»\", \"street\": null}, {\"name\": \"Техникум индустрии питания и услуг «Кулинар»\", \"street\": null}, {\"name\": \"Детский сад №369\", \"street\": null}, {\"name\": \"Детский сад №288\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 90, \"positive\": -27.5, \"violations\": {\"len\": 19, \"data\": [{\"name\": \"Уральская государственная архитектурно-художественная академия\", \"street\": null, \"bad\": \"Базар, 23, Karla Libknekhta Street, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"ЕГЭбург\", \"street\": null, \"bad\": \"Syndrome Bar, 13, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Amante\", \"street\": null, \"bad\": \"XXXX, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"KIBERone\", \"street\": \"улица Малышева\", \"bad\": \"А Ты Где, 137, улица Луначарского, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\", \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад № 345\", \"street\": null, \"bad\": \"Красное&Белое, 76, улица Луначарского, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"Детский сад № 376\", \"street\": null, \"bad\": \"Red&White, 73, Bazhova Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}, {\"name\": \"Детский сад № 113\", \"street\": null, \"bad\": \"Кафе-пекарня, Shartashskaya Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"ФГОУ ВПО Уральская ГСХА\", \"street\": null, \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад №369\", \"street\": null, \"bad\": \"Сушкоф, 25, Mamina-Sibiryaka Street, Екатерининский Парк, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Subway, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Юность, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Сербский дворик, 53, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Killfish, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"А ты где?, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая, 4, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Dom Pechati, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Jawsspot, 3, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Уральская государственная консерватория\", \"street\": null, \"bad\": \"Double bar, 8Б, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}]}, \"index\": 153, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 154, \"rating\": 40}",
						"{\"good\": 109, \"park\": 24, \"cigarettes\": 9, \"alcohol\": 29, \"educational\": 59, \"transport\": {\"len\": 38, \"data\": [{\"name\": \"ФЭУ УрФУ\", \"street\": null}, {\"name\": \"ММИ УрФУ\", \"street\": null}, {\"name\": \"ЭТФ УрФУ\", \"street\": null}, {\"name\": \"Детская хоровая школа №1\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Растём вместе\", \"street\": null}, {\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Институт развития образования\", \"street\": null}, {\"name\": \"Сад чудес\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"ТЭФ УрФУ\", \"street\": \"улица Софьи Ковалевской\"}, {\"name\": \"Школа № 145\", \"street\": null}, {\"name\": \"Лицей № 88\", \"street\": null}, {\"name\": \"Детский сад №276\", \"street\": null}, {\"name\": \"Школа № 146\", \"street\": null}, {\"name\": \"Детский сад № 276\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 123\", \"street\": null}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null}, {\"name\": \"Детский сад № 376\", \"street\": null}, {\"name\": \"Детский сад № 517\", \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": \"Детский сад №550 Академия успеха\", \"street\": null}, {\"name\": \"Детский сад Акадеша\", \"street\": null}, {\"name\": \"Детский сад № 501\", \"street\": null}, {\"name\": \"Детский сад № 450\", \"street\": null}, {\"name\": \"Профессиональное училище парикмахерского мастерства\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 100\", \"street\": null}, {\"name\": \"Детский сад № 230\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Гимназия № 37\", \"street\": null}, {\"name\": \"Детский сад № 230 \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад № 262\", \"street\": null}, {\"name\": \"Химико-фармацевтический центр УрФУ\", \"street\": null}, {\"name\": \"Детский сад № 423\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": \"Уральская улица\"}]}, \"bad\": 60, \"positive\": -5.5, \"violations\": {\"len\": 10, \"data\": [{\"name\": \"Растём вместе\", \"street\": null, \"bad\": \"Столовая, 2, улица Кулибина, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Красное&Белое, 45, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Not Turkey kitchen, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Детский сад № 276\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"цветочный магазин, 10, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null, \"bad\": \"Первомайская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620108, Russia\"}, {\"name\": \"Уральский политехнический колледж\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Детский сад № 68\", \"street\": null, \"bad\": \"Не турецкая кухня, 47А, улица Блюхера, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Детский сад № 505\", \"street\": null, \"bad\": \"Красное&Белое, 16, Советская улица, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620067, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая № 2, 23, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}]}, \"index\": 155, \"rating\": 0}",
						"{\"good\": 91, \"park\": 11, \"cigarettes\": 3, \"alcohol\": 14, \"educational\": 29, \"transport\": {\"len\": 23, \"data\": [{\"name\": \"Университет связи\", \"street\": null}, {\"name\": \"Маленький вундеркинд\", \"street\": null}, {\"name\": \"Вавилон\", \"street\": null}, {\"name\": \"Центр изучения английского языка Мергиной Марины\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа № 184 «Новая Школа»\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 541\", \"street\": null}, {\"name\": \"Детский сад № 534 «НПО Автоматики»\", \"street\": null}, {\"name\": \"Школа № 168\", \"street\": null}, {\"name\": \"Детский сад, ясли\", \"street\": null}, {\"name\": \"Детский сад № 559\", \"street\": null}, {\"name\": \"Детский сад № 485\", \"street\": null}, {\"name\": null, \"street\": \"улица Крауля\"}, {\"name\": \"Школа № 121\", \"street\": null}, {\"name\": \"Менталитет\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": \"Детский сад №348\", \"street\": null}, {\"name\": \"Детский сад № 511\", \"street\": null}, {\"name\": \"Детский сад № 510\", \"street\": null}, {\"name\": \"Детский сад № 93\", \"street\": null}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 23, \"positive\": 22.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Subway, Встречный переулок, Париж, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620086, Russia\"}, {\"name\": \"Talisman\", \"street\": null, \"bad\": \"Красное Белое, 22, Белореченская улица, Медгородок, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620102, Russia\"}]}, \"index\": 156, \"rating\": 60}",
						"{\"good\": 62, \"park\": 4, \"cigarettes\": 16, \"alcohol\": 17, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 22, \"positive\": 9.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 157, \"rating\": 100}",
						"{\"good\": 16, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 158, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад\", \"street\": \"Водонасосная улица\"}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 159, \"rating\": 100}",
						"{\"good\": 132, \"park\": 3, \"cigarettes\": 34, \"alcohol\": 50, \"educational\": 36, \"transport\": {\"len\": 28, \"data\": [{\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Гимназия № 176\", \"street\": null}, {\"name\": null, \"street\": \"Комсомольская улица\"}, {\"name\": \"Детский сад № 308 Жемчужинка\", \"street\": null}, {\"name\": \"Детский сад № 62\", \"street\": null}, {\"name\": \"Гимназия № 45\", \"street\": null}, {\"name\": \"Школа «Славянская»\", \"street\": null}, {\"name\": \"Детский сад № 102\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null}, {\"name\": \"Детский сад № 144\", \"street\": null}, {\"name\": \"Школа № 157\", \"street\": null}, {\"name\": \"Детский сад № 41\", \"street\": null}, {\"name\": \"Школа № 151\", \"street\": null}, {\"name\": \"Школа № 150\", \"street\": null}, {\"name\": \"Детский сад № 389\", \"street\": null}, {\"name\": \"Детский сад № 453 «Радуга детства»\", \"street\": null}, {\"name\": \"Детский сад № 101\", \"street\": null}, {\"name\": \"Детский сад № 583\", \"street\": null}, {\"name\": \"Детский сад № 266\", \"street\": null}, {\"name\": \"Гимназия «Ор-Авнер»\", \"street\": null}, {\"name\": \"Детский сад № 145\", \"street\": null}, {\"name\": \"Детский сад № 416\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 469\", \"street\": null}, {\"name\": \"Детский сад № 313\", \"street\": null}, {\"name\": \"Школа № 134\", \"street\": null}, {\"name\": \"Специальная коррекционная школа № 169\", \"street\": null}, {\"name\": \"Детский сад № 81\", \"street\": null}]}, \"bad\": 61, \"positive\": 5.0, \"violations\": {\"len\": 7, \"data\": [{\"name\": \"Средняя школа №96\", \"street\": null, \"bad\": \"Пив&ко, 37, Хрустальная улица, Синие Камни, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620138, Russia\"}, {\"name\": \"Детский сад № 144\", \"street\": null, \"bad\": \"Красное&Белое, 33, улица Новгородцевой, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 157\", \"street\": null, \"bad\": \"Red&White, улица Новгородцевой, Парк Каменные Палатки, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 157\", \"street\": null, \"bad\": \"улица Новгородцевой, Парк Каменные Палатки, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 151\", \"street\": null, \"bad\": \"Панельная улица, МЖК, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 150\", \"street\": null, \"bad\": \"Хлеб, улица Новгородцевой, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Дом ребёнка № 5\", \"street\": null, \"bad\": \"Пив&Ко, 1, Сиреневый бульвар, МЖК, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}]}, \"index\": 160, \"rating\": 60}",
						"{\"good\": 16, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 4, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 161, \"rating\": 100}",
						"{\"good\": 10, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 162, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 163, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 164, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 165, \"rating\": 100}",
						"{\"good\": 22, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 4, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 166, \"rating\": 100}",
						"{\"good\": 79, \"park\": 13, \"cigarettes\": 13, \"alcohol\": 22, \"educational\": 32, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"ФЭУ УрФУ\", \"street\": null}, {\"name\": \"ММИ УрФУ\", \"street\": null}, {\"name\": \"ЭТФ УрФУ\", \"street\": null}, {\"name\": \"Растём вместе\", \"street\": null}, {\"name\": \"Уральский федеральный университет имени первого Президента России Б.Н. Ельцина\", \"street\": \"улица Мира\"}, {\"name\": \"ФТИ УрФУ\", \"street\": \"улица Мира\"}, {\"name\": \"ТЭФ УрФУ\", \"street\": \"улица Софьи Ковалевской\"}, {\"name\": null, \"street\": \"Комсомольская улица\"}, {\"name\": null, \"street\": null}, {\"name\": \"Гимназия № 45\", \"street\": null}, {\"name\": \"Детский сад № 389\", \"street\": null}, {\"name\": \"Гимназия «Ор-Авнер»\", \"street\": null}, {\"name\": \"Детский сад № 145\", \"street\": null}, {\"name\": \"Детский сад № 416\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 352\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": \"Химико-фармацевтический центр УрФУ\", \"street\": null}, {\"name\": \"Детский сад № 255\", \"street\": null}, {\"name\": \"Детский сад № 407 «Жаворонок»\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}]}, \"bad\": 41, \"positive\": -1.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Гуманитарный университет\", \"street\": null, \"bad\": \"Столовая, 19, Студенческая улица, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}, {\"name\": \"Растём вместе\", \"street\": null, \"bad\": \"Столовая, 2, улица Кулибина, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Лицей № 130\", \"street\": null, \"bad\": \"Тройка, 26, Академическая улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"цветочный магазин, 10, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая № 2, 23, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}, {\"name\": \"Детский сад № 109\", \"street\": null, \"bad\": \"Красное&Белое, 10, Kuryinskiy Lane, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}]}, \"index\": 167, \"rating\": 0}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 8, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 168, \"rating\": 100}",
						"{\"good\": 159, \"park\": 16, \"cigarettes\": 12, \"alcohol\": 20, \"educational\": 39, \"transport\": {\"len\": 38, \"data\": [{\"name\": \"Детский сад № 45\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Десятое королевство\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Акварелька\", \"street\": null}, {\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Гимназия № 161\", \"street\": null}, {\"name\": \"Школа № 65\", \"street\": \"улица Академика Постовского\"}, {\"name\": \"Школа №154\", \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": null}, {\"name\": \"Умка\", \"street\": \"Волгоградская улица\"}, {\"name\": \"Гимназия № 70\", \"street\": null}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Детский сад № 451\", \"street\": null}, {\"name\": \"Детский сад № 366, центр развития ребёнка\", \"street\": null}, {\"name\": \"Школа № 175\", \"street\": null}, {\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Школа № 109\", \"street\": null}, {\"name\": \"Школа № 152\", \"street\": null}, {\"name\": \"Детский сад № 222\", \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Детский сад №342\", \"street\": null}, {\"name\": \"Детский сад № 54\", \"street\": null}, {\"name\": \"Детский сад №71\", \"street\": null}, {\"name\": \"Детский сад №209\", \"street\": null}, {\"name\": \"Детский сад №31\", \"street\": null}, {\"name\": \"Детский сад № 50\", \"street\": null}, {\"name\": \"Детский сад № 79\", \"street\": null}, {\"name\": \"Лицей №3\", \"street\": null}, {\"name\": \"Детский сад № 11\", \"street\": null}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"Школа № 18\", \"street\": null}, {\"name\": \"Детский сад № 147\", \"street\": null}, {\"name\": \"Гимназия № 39\", \"street\": null}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\"}, {\"name\": \"Рябинка, детский сад № 156\", \"street\": null}]}, \"bad\": 34, \"positive\": 45.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null, \"bad\": \"Красное&Белое, 52, Amundsena Street, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Школа № 152\", \"street\": null, \"bad\": \"Здравница, Волгоградская улица, Миллениум, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Детский сад №71\", \"street\": null, \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Детский сад №209\", \"street\": null, \"bad\": \"Пив&ко, 64, улица Амундсена, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620147, Russia\"}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\", \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}]}, \"index\": 169, \"rating\": 60}",
						"{\"good\": 55, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 3, \"educational\": 7, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 22.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 170, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 171, \"rating\": 100}",
						"{\"good\": 8, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 172, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 173, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 174, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 175, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 4, \"alcohol\": 9, \"educational\": 6, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад № 370\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 13, \"positive\": -9.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 176, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 177, \"rating\": 40}",
						"{\"good\": 25, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 2, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 265\", \"street\": null}]}, \"bad\": 1, \"positive\": 11.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа №113\", \"street\": \"улица Бакинских Комиссаров\", \"bad\": \"улица Бакинских комиссаров, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}]}, \"index\": 178, \"rating\": 60}",
						"{\"good\": 24, \"park\": 1, \"cigarettes\": 4, \"alcohol\": 6, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 6, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 179, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 180, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 181, \"rating\": 40}",
						"{\"good\": 10, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 7, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 182, \"rating\": 100}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 183, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 184, \"rating\": 100}",
						"{\"good\": 17, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 5, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Детская Музыкальная Школа №5 им. В. В. Знаменского\", \"street\": null}, {\"name\": \"Школа №67\", \"street\": \"улица Стачек\"}, {\"name\": \"Школа №107\", \"street\": \"улица Корепина\"}, {\"name\": \"Детский сад № 170\", \"street\": null}]}, \"bad\": 1, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 185, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 186, \"rating\": 40}",
						"{\"good\": 57, \"park\": 12, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 13, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 18.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 187, \"rating\": 100}",
						"{\"good\": 23, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 6, \"educational\": 5, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Чудо-Центр\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": null, \"street\": \"улица Соболева\"}]}, \"bad\": 8, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 188, \"rating\": 100}",
						"{\"good\": 78, \"park\": 7, \"cigarettes\": 3, \"alcohol\": 13, \"educational\": 55, \"transport\": {\"len\": 35, \"data\": [{\"name\": \"Детская Музыкальная Школа №5 им. В. В. Знаменского\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": \"переулок Замятина\"}, {\"name\": null, \"street\": \"улица Баумана\"}, {\"name\": \"Школа №67\", \"street\": \"улица Стачек\"}, {\"name\": \"РГППУ\", \"street\": \"Каширская улица\"}, {\"name\": \"Школа-интернат №89\", \"street\": \"Даниловская улица\"}, {\"name\": null, \"street\": \"Каширская улица\"}, {\"name\": \"Школа №138\", \"street\": null}, {\"name\": \"Детский сад №499\", \"street\": null}, {\"name\": \"Детский сад №86\", \"street\": null}, {\"name\": \"Детский сад №120\", \"street\": null}, {\"name\": \"Детский сад №76\", \"street\": null}, {\"name\": \"Детский сад №576\", \"street\": null}, {\"name\": \"Средняя Школа №114\", \"street\": null}, {\"name\": \"Десткий сад №310\", \"street\": null}, {\"name\": \"Детский сад №274\", \"street\": null}, {\"name\": \"Детский сад № 15\", \"street\": null}, {\"name\": \"Детский сад №168\", \"street\": null}, {\"name\": \"Детский сад №440\", \"street\": null}, {\"name\": \"Детский сад №477\", \"street\": null}, {\"name\": \"Детский сад №500\", \"street\": null}, {\"name\": \"Школа №46\", \"street\": null}, {\"name\": \"Школа №66\", \"street\": null}, {\"name\": \"Школа Гелиос\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 170\", \"street\": null}, {\"name\": \"Детский сад №176\", \"street\": null}, {\"name\": \"Детский сад Гелиос\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №521\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа №167\", \"street\": null}]}, \"bad\": 17, \"positive\": 22.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад №274\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}, {\"name\": \"Детский сад № 551\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"Коасное и Белое, 24, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"красно белое, 29, улица Баумана, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}]}, \"index\": 189, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 190, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"KIBERone\", \"street\": \"улица Конструкторов\"}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 191, \"rating\": 100}",
						"{\"good\": 102, \"park\": 9, \"cigarettes\": 10, \"alcohol\": 22, \"educational\": 28, \"transport\": {\"len\": 19, \"data\": [{\"name\": \"интернат #111\", \"street\": null}, {\"name\": \"Екатеринбургская академия современного искусства (ЕАСИ)\", \"street\": \"улица Красных Партизан\"}, {\"name\": \"Детский сад № 155 «Улыбка»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 135 «Радуга»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Школа №115\", \"street\": \"Фестивальная улица\"}, {\"name\": \"Гимназия № 144\", \"street\": null}, {\"name\": \"Школа №72\", \"street\": null}, {\"name\": \"Школа \\\"Источник\\\"\", \"street\": null}, {\"name\": \"Детский сад № 371\", \"street\": null}, {\"name\": \"Детский сад № 399\", \"street\": null}, {\"name\": \"Детский сад № 318\", \"street\": null}, {\"name\": \"Детский сад № 432\", \"street\": null}, {\"name\": \"Детский сад № 158\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад №431\", \"street\": null}, {\"name\": \"Детский сад № 355\", \"street\": null}, {\"name\": \"Детский сад № 265\", \"street\": null}, {\"name\": \"Начальная школа №113\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 29, \"positive\": 22.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Школа №113\", \"street\": \"улица Бакинских Комиссаров\", \"bad\": \"улица Бакинских комиссаров, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}, {\"name\": \"Детский сад № 318\", \"street\": null, \"bad\": \"Фауст, улица 40-летия Октября, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620088, Russia\"}]}, \"index\": 192, \"rating\": 60}",
						"{\"good\": 27, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 10, \"educational\": 19, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": null, \"street\": \"улица Черепанова\"}, {\"name\": \"Детский сад № 248\", \"street\": null}, {\"name\": \"Школа № 201 «Согласие»\", \"street\": null}, {\"name\": \"Детский сад № 123\", \"street\": null}, {\"name\": \"Педагогический колледж\", \"street\": null}, {\"name\": \"Детский сад № 286\", \"street\": null}, {\"name\": \"Детский сад № 283\", \"street\": null}, {\"name\": \"Школа № 29\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null}]}, \"bad\": 22, \"positive\": -8.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Budo, 22, Opalikhinskaya Street, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"улица Одинарка, Ольховский Парк, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая, улица Единого Фронта, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}]}, \"index\": 193, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 194, \"rating\": 40}",
						"{\"good\": 35, \"park\": 2, \"cigarettes\": 5, \"alcohol\": 15, \"educational\": 13, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 20, \"positive\": -2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 195, \"rating\": 40}",
						"{\"good\": 101, \"park\": 8, \"cigarettes\": 9, \"alcohol\": 25, \"educational\": 36, \"transport\": {\"len\": 26, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 45\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Ithub\", \"street\": null}, {\"name\": \"Гимназия № 70\", \"street\": null}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Детский сад № 451\", \"street\": null}, {\"name\": \"Детский сад № 366, центр развития ребёнка\", \"street\": null}, {\"name\": \"Школа № 175\", \"street\": null}, {\"name\": \"Школа № 152\", \"street\": null}, {\"name\": \"Детский сад № 222\", \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Детский сад № 386 «Знайка»\", \"street\": null}, {\"name\": \"Детский сад № 444\", \"street\": null}, {\"name\": \"Детский сад № 518\", \"street\": null}, {\"name\": \"Детский сад № 413\", \"street\": null}, {\"name\": \"Детский сад № 233\", \"street\": null}, {\"name\": \"Детский сад № 79\", \"street\": null}, {\"name\": \"Лицей №3\", \"street\": null}, {\"name\": \"Детский сад № 455\", \"street\": null}, {\"name\": \"Детский сад № 11\", \"street\": null}, {\"name\": \"Станция юных натуралистов\", \"street\": null}, {\"name\": \"Школа № 18\", \"street\": null}, {\"name\": \"Детский сад № 147\", \"street\": null}, {\"name\": \"Гимназия № 39\", \"street\": null}]}, \"bad\": 38, \"positive\": 12.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Red&White, 39, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Детский сад № 55\", \"street\": null, \"bad\": \"Косулинская пивоварня, 41, улица Фрунзе, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Детский сад № 455\", \"street\": null, \"bad\": \"KFC, улица 8 Марта, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}]}, \"index\": 196, \"rating\": 60}",
						"{\"good\": 163, \"park\": 46, \"cigarettes\": 8, \"alcohol\": 77, \"educational\": 41, \"transport\": {\"len\": 28, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Школа риторики «Равновесие»\", \"street\": null}, {\"name\": \"Институт Машиноведения УрО РАН\", \"street\": null}, {\"name\": \"Школа Конфуция\", \"street\": null}, {\"name\": \"Уральский промышленно-экономический техникум\", \"street\": null}, {\"name\": \"Екатеринбургская детская театральная школа\", \"street\": null}, {\"name\": \"Уральский колледж экономики и права\", \"street\": \"улица Сони Морозовой\"}, {\"name\": \"Sunday Rock\", \"street\": null}, {\"name\": \"EnglishFit\", \"street\": null}, {\"name\": \"Amante\", \"street\": null}, {\"name\": \"Лицей № 110 им. Л. К. Гришиной\", \"street\": null}, {\"name\": \"Детский сад № 276\", \"street\": null}, {\"name\": \"Школа № 13\", \"street\": null}, {\"name\": \"Гимназия № 94\", \"street\": null}, {\"name\": \"Детский сад № 441\", \"street\": null}, {\"name\": \"Уральский институт экономики, управления и права\", \"street\": \"улица Луначарского\"}, {\"name\": \"Детский сад № 166 «Гнёздышко»\", \"street\": null}, {\"name\": \"Детский сад № 363\", \"street\": null}, {\"name\": \"Школа № 76\", \"street\": null}, {\"name\": \"Гимназия № 8 им. Дягилева\", \"street\": null}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 376\", \"street\": null}, {\"name\": \"Детский сад № 113\", \"street\": null}, {\"name\": \"Детский сад № 330 «Антошка»\", \"street\": null}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null}, {\"name\": \"Гимназия № 37\", \"street\": null}, {\"name\": \"Детский сад № 123 ОАО «РЖД»\", \"street\": null}]}, \"bad\": 120, \"positive\": -38.5, \"violations\": {\"len\": 25, \"data\": [{\"name\": \"Уральская государственная архитектурно-художественная академия\", \"street\": null, \"bad\": \"Базар, 23, Karla Libknekhta Street, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Коньяки Дагестана, 41, Улица Малышева, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Поль Бейкери;Лавкрафт, 64, Malysheva Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Gustoy Hookah Lounge, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Влади Bar, 51, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Amante\", \"street\": null, \"bad\": \"XXXX, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"KIBERone\", \"street\": \"улица Малышева\", \"bad\": \"А Ты Где, 137, улица Луначарского, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад № 276\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Школа № 13\", \"street\": null, \"bad\": \"Роспечать, Bazhova Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\", \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад № 345\", \"street\": null, \"bad\": \"Красное&Белое, 76, улица Луначарского, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"Уральский политехнический колледж\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Детский сад № 376\", \"street\": null, \"bad\": \"Red&White, 73, Bazhova Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}, {\"name\": \"Детский сад № 113\", \"street\": null, \"bad\": \"Кафе-пекарня, Shartashskaya Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"ФГОУ ВПО Уральская ГСХА\", \"street\": null, \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Российский экономический университет имени Г. В. Плеханова\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Subway, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Юность, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Сербский дворик, 53, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Killfish, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"А ты где?, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая, 4, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Dom Pechati, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Jawsspot, 3, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}]}, \"index\": 197, \"rating\": 0}",
						"{\"good\": 167, \"park\": 37, \"cigarettes\": 15, \"alcohol\": 19, \"educational\": 34, \"transport\": {\"len\": 33, \"data\": [{\"name\": \"Детский сад № 45\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Акварелька\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null}, {\"name\": \"Гимназия № 161\", \"street\": null}, {\"name\": \"Школа № 65\", \"street\": \"улица Академика Постовского\"}, {\"name\": \"Школа №154\", \"street\": null}, {\"name\": \"Школа № 64\", \"street\": null}, {\"name\": \"Детский сад № 26 «Лесовичок»\", \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": null}, {\"name\": \"Умка\", \"street\": \"Волгоградская улица\"}, {\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Детский сад № 561\", \"street\": null}, {\"name\": \"Школа № 109\", \"street\": null}, {\"name\": \"Средняя школа № 140\", \"street\": null}, {\"name\": \"Лицей № 159\", \"street\": null}, {\"name\": \"Детский сад № 29\", \"street\": null}, {\"name\": \"Школа № 152\", \"street\": null}, {\"name\": \"Детский сад №342\", \"street\": null}, {\"name\": \"Детский сад № 54\", \"street\": null}, {\"name\": \"Детский сад №71\", \"street\": null}, {\"name\": \"Свердловский колледж искусств и культуры\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №209\", \"street\": null}, {\"name\": \"Детский сад №31\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"Детский сад № 88\", \"street\": null}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\"}, {\"name\": \"Рябинка, детский сад № 156\", \"street\": null}]}, \"bad\": 30, \"positive\": 53.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null, \"bad\": \"Красное&Белое, 52, Amundsena Street, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Школа № 152\", \"street\": null, \"bad\": \"Здравница, Волгоградская улица, Миллениум, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Детский сад №71\", \"street\": null, \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Детский сад №209\", \"street\": null, \"bad\": \"Пив&ко, 64, улица Амундсена, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620147, Russia\"}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\", \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}]}, \"index\": 198, \"rating\": 60}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 199, \"rating\": 100}",
						"{\"good\": 8, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 200, \"rating\": 100}",
						"{\"good\": 95, \"park\": 17, \"cigarettes\": 1, \"alcohol\": 10, \"educational\": 25, \"transport\": {\"len\": 22, \"data\": [{\"name\": \"Ясли\", \"street\": null}, {\"name\": \"Детский сад №126\", \"street\": null}, {\"name\": \"Школа развития малыша - Кенгуру\", \"street\": \"улица Крылова\"}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": null}, {\"name\": \"УрГУПС\", \"street\": null}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": null, \"street\": \"улица Черепанова\"}, {\"name\": \"Детский сад № 248\", \"street\": null}, {\"name\": \"Школа № 201 «Согласие»\", \"street\": null}, {\"name\": \"Детский сад № 582\", \"street\": null}, {\"name\": \"Средняя школа №208\", \"street\": null}, {\"name\": \"Детский сад № 125\", \"street\": null}, {\"name\": \"Детский сад № 9\", \"street\": null}, {\"name\": \"Детский сад № 272\", \"street\": null}, {\"name\": \"Детский сад № 199 Созидание\", \"street\": null}, {\"name\": \"Педагогический колледж\", \"street\": null}, {\"name\": \"Гимназия №155\", \"street\": null}, {\"name\": \"Детский сад № 283\", \"street\": null}, {\"name\": \"Гимназия № 2\", \"street\": null}, {\"name\": \"Детский сад № 174\", \"street\": null}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null}]}, \"bad\": 17, \"positive\": 30.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Гимназия № 2\", \"street\": null, \"bad\": \"Красное&Белое, 8, улица Шевелёва, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null, \"bad\": \"Пивной гном, 10, улица Юмашева, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"улица Одинарка, Ольховский Парк, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая, улица Единого Фронта, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}]}, \"index\": 201, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 202, \"rating\": 40}",
						"{\"good\": 87, \"park\": 19, \"cigarettes\": 3, \"alcohol\": 28, \"educational\": 38, \"transport\": {\"len\": 26, \"data\": [{\"name\": \"Школа Конфуция\", \"street\": null}, {\"name\": \"Детский сад #184\", \"street\": null}, {\"name\": \"Школа № 145\", \"street\": null}, {\"name\": \"ЧОУ СОШ «Творчество»\", \"street\": \"улица Пионеров\"}, {\"name\": \"Школа № 146\", \"street\": null}, {\"name\": \"Детский сад № 376\", \"street\": null}, {\"name\": \"Детский сад № 113\", \"street\": null}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Детский сад №550 Академия успеха\", \"street\": null}, {\"name\": \"Детский сад № 501\", \"street\": null}, {\"name\": \"Детский сад № 450\", \"street\": null}, {\"name\": \"Профессиональное училище парикмахерского мастерства\", \"street\": null}, {\"name\": \"Детский сад № 230\", \"street\": null}, {\"name\": \"школа №75\", \"street\": null}, {\"name\": \"Гимназия №155\", \"street\": null}, {\"name\": \"Гимназия № 37\", \"street\": null}, {\"name\": \"Детский сад № 230 \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад № 262\", \"street\": null}, {\"name\": \"Детский сад № 393\", \"street\": null}, {\"name\": \"Детский сад № 174\", \"street\": null}, {\"name\": \"Гимназия № 212 «Екатеринбург — Париж»\", \"street\": null}, {\"name\": \"Техникум индустрии питания и услуг «Кулинар»\", \"street\": null}, {\"name\": \"Детский сад №369\", \"street\": null}, {\"name\": \"Детский сад №288\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 42, \"positive\": 1.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад № 345\", \"street\": null, \"bad\": \"Красное&Белое, 76, улица Луначарского, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"Детский сад № 113\", \"street\": null, \"bad\": \"Кафе-пекарня, Shartashskaya Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Pizza mia, 23, Вокзальная улица, Мельница, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}, {\"name\": \"Детский сад №369\", \"street\": null, \"bad\": \"Сушкоф, 25, Mamina-Sibiryaka Street, Екатерининский Парк, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}]}, \"index\": 203, \"rating\": 60}",
						"{\"good\": 132, \"park\": 6, \"cigarettes\": 5, \"alcohol\": 34, \"educational\": 35, \"transport\": {\"len\": 25, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Школа развития малыша - Кенгуру\", \"street\": \"улица Крылова\"}, {\"name\": null, \"street\": null}, {\"name\": \"Дом радости\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Татищева\"}, {\"name\": \"Школа №74\", \"street\": \"улица Крауля\"}, {\"name\": \"Детский сад № 143\", \"street\": null}, {\"name\": null, \"street\": \"улица Крауля\"}, {\"name\": \"Школа № 121\", \"street\": null}, {\"name\": \"Менталитет\", \"street\": null}, {\"name\": \"Детский сад № 272\", \"street\": null}, {\"name\": \"Детский сад № 562\", \"street\": null}, {\"name\": \"Детский сад № 368\", \"street\": null}, {\"name\": \"Детский сад № 199 Созидание\", \"street\": null}, {\"name\": \"Педагогический колледж\", \"street\": null}, {\"name\": \"Детский сад № 511\", \"street\": null}, {\"name\": \"Гимназия № 2\", \"street\": null}, {\"name\": \"Детский сад № 5\", \"street\": null}, {\"name\": \"Школа №185\", \"street\": null}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": \"улица Репина\"}, {\"name\": \"Уральский государственный медицинский университет\", \"street\": \"улица Репина\"}, {\"name\": \"Детский сад компенсирующего вида № 466\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 56, \"positive\": 10.0, \"violations\": {\"len\": 10, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null, \"bad\": \"Столовая, 17, Klyuchevskaya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null, \"bad\": \"Provizia, ресторан на прилавке, 7, Верх-Исетский бульвар, Адмиральский-2, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620028, Russia\"}, {\"name\": null, \"street\": \"улица Крауля\", \"bad\": \"Пивасик и карасик, 8, Kraulya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Fanagoria, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Хмель и солод, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Пивкофф, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 511\", \"street\": null, \"bad\": \"PizzaMia, 53, Kraulya Street, Татищев, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Гимназия № 2\", \"street\": null, \"bad\": \"Красное&Белое, 8, улица Шевелёва, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null, \"bad\": \"Пивной гном, 10, улица Юмашева, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}]}, \"index\": 204, \"rating\": 60}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 205, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад\", \"street\": \"Водонасосная улица\"}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 206, \"rating\": 100}",
						"{\"good\": 25, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 207, \"rating\": 100}",
						"{\"good\": 21, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 8, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Школа № 122\", \"street\": null}, {\"name\": \"Детский сад № 46\", \"street\": null}, {\"name\": \"Детский сад № 132\", \"street\": null}, {\"name\": \"Детский сад № 312\", \"street\": null}, {\"name\": \"Детский сад № 51\", \"street\": null}, {\"name\": \"Школа № 129\", \"street\": null}, {\"name\": \"Детский просветительский центр / Воскресная школа\", \"street\": null}]}, \"bad\": 5, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 208, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 209, \"rating\": 100}",
						"{\"good\": 71, \"park\": 2, \"cigarettes\": 14, \"alcohol\": 24, \"educational\": 19, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 28, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 210, \"rating\": 100}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 211, \"rating\": 40}",
						"{\"good\": 28, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 11.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 212, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 213, \"rating\": 100}",
						"{\"good\": 120, \"park\": 13, \"cigarettes\": 14, \"alcohol\": 35, \"educational\": 39, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 51, \"positive\": 9.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 214, \"rating\": 100}",
						"{\"good\": 82, \"park\": 4, \"cigarettes\": 23, \"alcohol\": 32, \"educational\": 23, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 37, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 215, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 216, \"rating\": 40}",
						"{\"good\": 240, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 30, \"educational\": 28, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"Джунгли\", \"street\": null}, {\"name\": \"Rio\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Оксфордский языковой центр\", \"street\": null}, {\"name\": \"Веселая радуга\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"проспект Академика Сахарова\"}, {\"name\": \"KIBERone\", \"street\": \"улица Академика Парина\"}, {\"name\": \"Школа № 16\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Детский сад № 52\", \"street\": null}, {\"name\": \"Детский сад № 44\", \"street\": null}, {\"name\": \"Профессиональное училище № 71\", \"street\": null}, {\"name\": \"Детский сад № 43 «Академия детства»\", \"street\": null}, {\"name\": \"Школа № 23\", \"street\": null}, {\"name\": \"Школа № 79\", \"street\": \"проспект Академика Сахарова\"}, {\"name\": \"Детский сад № 43\", \"street\": \"улица Академика Парина\"}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Детский сад № 150\", \"street\": null}, {\"name\": \"Детский сад № 151\", \"street\": null}, {\"name\": \"Школа № 31\", \"street\": null}]}, \"bad\": 39, \"positive\": 81.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Академика\", \"street\": null, \"bad\": \"Пан Разливан, 147, улица Краснолесья, 5-й квартал, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}, {\"name\": \"KIBERone\", \"street\": \"улица Академика Парина\", \"bad\": \"Пивная борода, 46/5, улица Академика Парина, Элевен, Близкий, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620905, Russia\"}, {\"name\": \"Детский сад № 43\", \"street\": null, \"bad\": \"МагBeer, 42, улица Вильгельма де Геннина, 5-й квартал, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}, {\"name\": \"Детский сад № 119\", \"street\": null, \"bad\": \"Drinken Bull, 21, улица Павла Шаманова, Аксиома, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}, {\"name\": \"Детский сад № 43\", \"street\": \"улица Академика Парина\", \"bad\": \"Pizza Rome, 40/3, улица Академика Парина, Элевен, Близкий, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}]}, \"index\": 217, \"rating\": 60}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 218, \"rating\": 40}",
						"{\"good\": 165, \"park\": 7, \"cigarettes\": 10, \"alcohol\": 21, \"educational\": 24, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"ОЦ Вавилон\", \"street\": null}, {\"name\": \"Десятое королевство\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Планета счастья\", \"street\": null}, {\"name\": \"Акварелька\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Гимназия № 161\", \"street\": null}, {\"name\": \"Школа №154\", \"street\": null}, {\"name\": \"Умка\", \"street\": \"Волгоградская улица\"}, {\"name\": \"Детский сад № 326\", \"street\": null}, {\"name\": \"Детский сад №342\", \"street\": null}, {\"name\": \"Детский сад № 54\", \"street\": null}, {\"name\": \"Детский сад №71\", \"street\": null}, {\"name\": \"Школа № 18\", \"street\": null}, {\"name\": \"Детский сад № 147\", \"street\": null}, {\"name\": \"Гимназия № 39\", \"street\": null}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\"}, {\"name\": \"Детский сад № 33\", \"street\": null}, {\"name\": \"Детский сад №11\", \"street\": null}, {\"name\": \"Школа №102\", \"street\": null}]}, \"bad\": 26, \"positive\": 56.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Планета счастья\", \"street\": null, \"bad\": \"Магнум-винотека, 1, улица Юлиуса Фучика, Два Капитана, Ботанический, Чкаловский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620130, Russia\"}, {\"name\": \"Детский сад №71\", \"street\": null, \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Самоцветный бульвар, Два Капитана, Ботанический, Чкаловский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620089, Russia\"}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\", \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}]}, \"index\": 219, \"rating\": 60}",
						"{\"good\": 6, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": -4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 220, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 221, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 222, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 223, \"rating\": 100}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 224, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 225, \"rating\": 40}",
						"{\"good\": 12, \"park\": 1, \"cigarettes\": 5, \"alcohol\": 14, \"educational\": 12, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Детский сад № 85\", \"street\": null}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 117\", \"street\": null}, {\"name\": \"Школа № 4\", \"street\": null}, {\"name\": \"Детский сад № 370\", \"street\": null}, {\"name\": \"Школа № 147\", \"street\": null}]}, \"bad\": 20, \"positive\": -14.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа №192\", \"street\": \"улица Машиностроителей\", \"bad\": \"Live beer, 6, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620143, Russia\"}]}, \"index\": 226, \"rating\": 0}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 227, \"rating\": 100}",
						"{\"good\": 84, \"park\": 0, \"cigarettes\": 10, \"alcohol\": 11, \"educational\": 24, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"интернат #111\", \"street\": null}, {\"name\": \"Детский сад №538\", \"street\": \"улица Бакинских Комиссаров\"}, {\"name\": \"Детский сад № 155 «Улыбка»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 135 «Радуга»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Школа №72\", \"street\": null}, {\"name\": \"Школа № 27\", \"street\": null}, {\"name\": \"Школа №81\", \"street\": null}, {\"name\": \"Детский сад №10\", \"street\": null}, {\"name\": \"Детский сад №2\", \"street\": null}, {\"name\": \"Детский сад №134\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №431\", \"street\": null}, {\"name\": \"Детский сад Арт-Этюд\", \"street\": null}, {\"name\": \"Детский сад №40/228 Капитошка\", \"street\": null}, {\"name\": \"Детский сад №153\", \"street\": null}, {\"name\": \"Детский сад № 265\", \"street\": null}, {\"name\": \"Начальная школа №113\", \"street\": null}]}, \"bad\": 14, \"positive\": 28.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Темное светлое, 101, улица Бакинских комиссаров, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}, {\"name\": \"Школа №113\", \"street\": \"улица Бакинских Комиссаров\", \"bad\": \"улица Бакинских комиссаров, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}, {\"name\": \"Школа № 27\", \"street\": null, \"bad\": \"Коммунистическая улица, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Коммунистическая улица, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Детский сад №153\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}]}, \"index\": 228, \"rating\": 60}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 229, \"rating\": 40}",
						"{\"good\": 28, \"park\": 3, \"cigarettes\": 5, \"alcohol\": 11, \"educational\": 9, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад № 355\", \"street\": null}, {\"name\": \"Детский сад № 265\", \"street\": null}, {\"name\": \"Детский сад № 370\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 17, \"positive\": -3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 230, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 231, \"rating\": 40}",
						"{\"good\": 56, \"park\": 12, \"cigarettes\": 8, \"alcohol\": 19, \"educational\": 34, \"transport\": {\"len\": 25, \"data\": [{\"name\": \"Карапуз\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детская Музыкальная Школа №5 им. В. В. Знаменского\", \"street\": null}, {\"name\": \"Садик счастья\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"Кировградская улица\"}, {\"name\": \"Школа №67\", \"street\": \"улица Стачек\"}, {\"name\": \"Учебный центр МРСК Урала\", \"street\": \"улица Электриков\"}, {\"name\": \"Школа № 80\", \"street\": null}, {\"name\": null, \"street\": \"улица Машиностроителей\"}, {\"name\": \"Детский сад №86\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Школа №66\", \"street\": null}, {\"name\": \"Школа №78\", \"street\": null}, {\"name\": \"Детский сад №523\", \"street\": null}, {\"name\": \"Школа Гелиос\", \"street\": null}, {\"name\": \"Детский сад № 428\", \"street\": null}, {\"name\": \"Детский сад № 478\", \"street\": null}, {\"name\": \"Детский сад № 170\", \"street\": null}, {\"name\": \"Детский сад №176\", \"street\": null}, {\"name\": \"Детский сад Гелиос\", \"street\": null}, {\"name\": \"Детский сад №514 \\\"Детство\\\"\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Российский государственный профессионально-педагогический университет\", \"street\": null}]}, \"bad\": 27, \"positive\": 1.0, \"violations\": {\"len\": 7, \"data\": [{\"name\": \"Садик счастья\", \"street\": null, \"bad\": \"Магнум-винотека, 8, Кировградская улица, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Две ладошки\", \"street\": null, \"bad\": \"улица Победы, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Школа № 80\", \"street\": null, \"bad\": \"Пив&ко, 35, улица Ильича, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null, \"bad\": \"College canteen, 50, проспект Космонавтов, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"Коасное и Белое, 24, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"красно белое, 29, улица Баумана, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}, {\"name\": \"Российский государственный профессионально-педагогический университет\", \"street\": null, \"bad\": \"Столовая, 11, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}]}, \"index\": 232, \"rating\": 60}",
						"{\"good\": 89, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 7, \"educational\": 8, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 15, \"positive\": 29.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 233, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 234, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 235, \"rating\": 40}",
						"{\"good\": 181, \"park\": 7, \"cigarettes\": 37, \"alcohol\": 56, \"educational\": 68, \"transport\": {\"len\": 50, \"data\": [{\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Карапуз\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детско-юношеский клуб \\\"Тинейджер-шоу\\\"\", \"street\": null}, {\"name\": \"Детский сад №538\", \"street\": \"улица Бакинских Комиссаров\"}, {\"name\": \"Гимназия №205 Театр\", \"street\": \"улица Победы\"}, {\"name\": \"Детский сад № 155 «Улыбка»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 135 «Радуга»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 129 «Колокольчик»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Школа № 68\", \"street\": null}, {\"name\": \"Школа №72\", \"street\": null}, {\"name\": \"Школа № 80\", \"street\": null}, {\"name\": \"Лицей №128\", \"street\": null}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": \"Стахановская улица\"}, {\"name\": \"Детский сад №406\", \"street\": null}, {\"name\": \"Детский сад №411\", \"street\": null}, {\"name\": \"Школа №81\", \"street\": null}, {\"name\": \"Детский сад №10\", \"street\": null}, {\"name\": \"Детский сад №165\", \"street\": null}, {\"name\": \"Детский сад №22\", \"street\": null}, {\"name\": \"Детский сад №319\", \"street\": null}, {\"name\": \"Гимназия \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Начальная школа \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Школа №138\", \"street\": null}, {\"name\": \"Детский сад №499\", \"street\": null}, {\"name\": \"Детский сад №420\", \"street\": null}, {\"name\": \"Детский сад №377\", \"street\": null}, {\"name\": \"Детский сад №475\", \"street\": null}, {\"name\": \"Детский сад № 461\", \"street\": null}, {\"name\": \"Детский сад №86\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Детский сад №244\", \"street\": null}, {\"name\": \"Детский сад №274\", \"street\": null}, {\"name\": \"Школа Гелиос\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №134\", \"street\": null}, {\"name\": \"Детский сад №232\", \"street\": null}, {\"name\": \"Детский сад № 428\", \"street\": null}, {\"name\": \"Детский сад №460\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №203\", \"street\": null}, {\"name\": \"Детский сад №514 \\\"Детство\\\"\", \"street\": null}, {\"name\": \"Детский сад №521\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №545\", \"street\": null}, {\"name\": \"Детский сад Арт-Этюд\", \"street\": null}, {\"name\": \"Детский сад №40/228 Капитошка\", \"street\": null}, {\"name\": \"Детский сад №422\", \"street\": null}, {\"name\": \"Школа №99\", \"street\": null}]}, \"bad\": 71, \"positive\": 19.5, \"violations\": {\"len\": 8, \"data\": [{\"name\": \"Две ладошки\", \"street\": null, \"bad\": \"улица Победы, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Школа № 80\", \"street\": null, \"bad\": \"Пив&ко, 35, улица Ильича, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Школа-интернат №18\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Школа № 27\", \"street\": null, \"bad\": \"Коммунистическая улица, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Детский сад №274\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}, {\"name\": \"Детский сад № 551\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Коммунистическая улица, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Детский сад №153\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620042, Russia\"}]}, \"index\": 236, \"rating\": 60}",
						"{\"good\": 10, \"park\": 4, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 2, \"transport\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null}]}, \"bad\": 4, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 237, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"KIBERone\", \"street\": \"улица Конструкторов\"}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 238, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 239, \"rating\": 100}",
						"{\"good\": 40, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Чудо-Центр\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": null, \"street\": \"улица Соболева\"}]}, \"bad\": 8, \"positive\": 12.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 240, \"rating\": 100}",
						"{\"good\": 81, \"park\": 11, \"cigarettes\": 2, \"alcohol\": 11, \"educational\": 29, \"transport\": {\"len\": 19, \"data\": [{\"name\": \"Детский сад №126\", \"street\": null}, {\"name\": \"Школа развития малыша - Кенгуру\", \"street\": \"улица Крылова\"}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"УрГУПС\", \"street\": null}, {\"name\": \"Детский сад № 248\", \"street\": null}, {\"name\": \"Школа № 201 «Согласие»\", \"street\": null}, {\"name\": \"Детский сад № 272\", \"street\": null}, {\"name\": \"Детский сад № 562\", \"street\": null}, {\"name\": \"Детский сад № 368\", \"street\": null}, {\"name\": \"Детский сад № 123\", \"street\": null}, {\"name\": \"Детский сад № 199 Созидание\", \"street\": null}, {\"name\": \"Педагогический колледж\", \"street\": null}, {\"name\": \"Детский сад № 286\", \"street\": null}, {\"name\": \"Детский сад № 283\", \"street\": null}, {\"name\": \"Гимназия № 2\", \"street\": null}, {\"name\": \"Школа № 29\", \"street\": null}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null}]}, \"bad\": 27, \"positive\": 13.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Budo, 22, Opalikhinskaya Street, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Гимназия № 2\", \"street\": null, \"bad\": \"Красное&Белое, 8, улица Шевелёва, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Детский сад № 414 «Солнышко»\", \"street\": null, \"bad\": \"Пивной гном, 10, улица Юмашева, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"улица Одинарка, Ольховский Парк, Вокзальный, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая, улица Единого Фронта, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}]}, \"index\": 241, \"rating\": 60}",
						"{\"good\": 105, \"park\": 17, \"cigarettes\": 10, \"alcohol\": 40, \"educational\": 42, \"transport\": {\"len\": 31, \"data\": [{\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Екатеринбургская академия современного искусства (ЕАСИ)\", \"street\": \"улица Красных Партизан\"}, {\"name\": \"KIBERone\", \"street\": \"Кировградская улица\"}, {\"name\": \"Гимназия №205 Театр\", \"street\": \"улица Победы\"}, {\"name\": \"Детский сад № 155 «Улыбка»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 135 «Радуга»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Детский сад № 129 «Колокольчик»\", \"street\": \"улица Индустрии\"}, {\"name\": \"Школа №115\", \"street\": \"Фестивальная улица\"}, {\"name\": \"Гимназия № 144\", \"street\": null}, {\"name\": \"Школа №72\", \"street\": null}, {\"name\": \"Школа № 80\", \"street\": null}, {\"name\": null, \"street\": \"улица Машиностроителей\"}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": \"Стахановская улица\"}, {\"name\": \"Гимназия \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Начальная школа \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Школа \\\"Источник\\\"\", \"street\": null}, {\"name\": \"Детский сад № 371\", \"street\": null}, {\"name\": \"Детский сад № 399\", \"street\": null}, {\"name\": \"Детский сад № 318\", \"street\": null}, {\"name\": \"Детский сад № 432\", \"street\": null}, {\"name\": \"Детский сад № 158\", \"street\": null}, {\"name\": \"Детский сад № 215\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад № 478\", \"street\": null}, {\"name\": \"Детский сад №514 \\\"Детство\\\"\", \"street\": null}, {\"name\": \"Детский сад № 355\", \"street\": null}, {\"name\": \"Детский сад Арт-Этюд\", \"street\": null}, {\"name\": \"Детский сад №40/228 Капитошка\", \"street\": null}, {\"name\": \"Детский сад №422\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 51, \"positive\": 1.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Школа №192\", \"street\": \"улица Машиностроителей\", \"bad\": \"Live beer, 6, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620143, Russia\"}, {\"name\": \"Школа № 80\", \"street\": null, \"bad\": \"Пив&ко, 35, улица Ильича, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Детский сад № 318\", \"street\": null, \"bad\": \"Фауст, улица 40-летия Октября, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620088, Russia\"}, {\"name\": \"Екатеринбургский промышленно-технологический техникум (ЕПТТ) им. В.М. Курочкина\", \"street\": \"улица Машиностроителей\", \"bad\": \"13, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Российский государственный профессионально-педагогический университет\", \"street\": null, \"bad\": \"Столовая, 11, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}]}, \"index\": 242, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 243, \"rating\": 40}",
						"{\"good\": 6, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад\", \"street\": \"Водонасосная улица\"}]}, \"bad\": 1, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 244, \"rating\": 100}",
						"{\"good\": 117, \"park\": 21, \"cigarettes\": 21, \"alcohol\": 89, \"educational\": 32, \"transport\": {\"len\": 16, \"data\": [{\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"IndiGo TheFirst\", \"street\": null}, {\"name\": \"АРТ-Капелька\", \"street\": null}, {\"name\": \"Study & Bonus\", \"street\": null}, {\"name\": \"Sunday Rock\", \"street\": null}, {\"name\": \"EnglishFit\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Сакко и Ванцетти\"}, {\"name\": \"KIBERone\", \"street\": \"Московская улица\"}, {\"name\": null, \"street\": null}, {\"name\": \"Лицей № 173\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null}, {\"name\": \"Школа №10\", \"street\": null}]}, \"bad\": 139, \"positive\": -80.5, \"violations\": {\"len\": 18, \"data\": [{\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null, \"bad\": \"Agave, 6А, переулок Центральный Рынок, Форум-Сити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Коньяки Дагестана, 41, Улица Малышева, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Поль Бейкери;Лавкрафт, 64, Malysheva Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"АРТ-Капелька\", \"street\": null, \"bad\": \"МБ Вино и Цветы, 72, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"ЕГЭбург\", \"street\": null, \"bad\": \"Syndrome Bar, 13, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Gustoy Hookah Lounge, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Влади Bar, 51, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"ГАОУ СПО СО Екатеринбургский Монтажный Колледж\", \"street\": \"улица Декабристов\", \"bad\": \"Столовая, 83А, улица Декабристов, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Лицей № 173\", \"street\": null, \"bad\": \"8, Kuybysheva Street, Мечта, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Маруся, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"30, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Бургеры и Креветки, 24, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"УрГЭУ-СИНХ\", \"street\": null, \"bad\": \"Столовая УрГЭУ, Kuybysheva Street, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Школа №10\", \"street\": null, \"bad\": \"Три толстяка, 60, улица Вайнера, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Российский экономический университет имени Г. В. Плеханова\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая УрФУ, 48А, улица Куйбышева, Армада, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"Уральская государственная консерватория\", \"street\": null, \"bad\": \"Double bar, 8Б, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}]}, \"index\": 245, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 246, \"rating\": 40}",
						"{\"good\": 76, \"park\": 21, \"cigarettes\": 1, \"alcohol\": 6, \"educational\": 13, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 28.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 247, \"rating\": 100}",
						"{\"good\": 8, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 248, \"rating\": 100}",
						"{\"good\": 127, \"park\": 32, \"cigarettes\": 13, \"alcohol\": 38, \"educational\": 37, \"transport\": {\"len\": 29, \"data\": [{\"name\": \"Школа риторики «Равновесие»\", \"street\": null}, {\"name\": \"Уральский промышленно-экономический техникум\", \"street\": null}, {\"name\": \"Екатеринбургская детская театральная школа\", \"street\": null}, {\"name\": \"Детский сад № 239 «Золотое Яблоко»\", \"street\": null}, {\"name\": \"Уральский колледж экономики и права\", \"street\": \"улица Сони Морозовой\"}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"ХТФ/МТФ УрФУ\", \"street\": \"улица Мира\"}, {\"name\": \"ИРИТ-РТФ УрФУ\", \"street\": \"улица Мира\"}, {\"name\": \"Детский сад №99\", \"street\": null}, {\"name\": \"Лицей № 88\", \"street\": null}, {\"name\": \"Детский сад №276\", \"street\": null}, {\"name\": \"Лицей № 110 им. Л. К. Гришиной\", \"street\": null}, {\"name\": \"Школа № 13\", \"street\": null}, {\"name\": \"Гимназия № 94\", \"street\": null}, {\"name\": \"Детский сад № 441\", \"street\": null}, {\"name\": \"Уральский институт экономики, управления и права\", \"street\": \"улица Луначарского\"}, {\"name\": \"Детский сад № 166 «Гнёздышко»\", \"street\": null}, {\"name\": \"Детский сад № 363\", \"street\": null}, {\"name\": null, \"street\": \"Шорный переулок\"}, {\"name\": \"Гимназия № 8 им. Дягилева\", \"street\": null}, {\"name\": \"Детский сад № 75\", \"street\": null}, {\"name\": \"Детский сад № 63\", \"street\": null}, {\"name\": \"Детский сад № 479\", \"street\": null}, {\"name\": \"Детский сад УрФУ\", \"street\": null}, {\"name\": \"Детский сад № 330 «Антошка»\", \"street\": null}, {\"name\": \"Детский сад № 123 ОАО «РЖД»\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 299\", \"street\": null}, {\"name\": \"Детский сад № 261 «Речецветик»\", \"street\": null}]}, \"bad\": 70, \"positive\": -6.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"KIBERone\", \"street\": \"улица Малышева\", \"bad\": \"А Ты Где, 137, улица Луначарского, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Школа № 13\", \"street\": null, \"bad\": \"Роспечать, Bazhova Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"Гимназия № 40\", \"street\": null, \"bad\": \"Роспечать, Dekabristov Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая УрФУ, 48А, улица Куйбышева, Армада, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Сербский дворик, 53, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}]}, \"index\": 249, \"rating\": 0}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 250, \"rating\": 100}",
						"{\"good\": 128, \"park\": 35, \"cigarettes\": 10, \"alcohol\": 47, \"educational\": 32, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"Ясли\", \"street\": null}, {\"name\": \"Театральный институт\", \"street\": null}, {\"name\": \"Институт Машиноведения УрО РАН\", \"street\": null}, {\"name\": \"Областной техникум дизайна и сервиса\", \"street\": null}, {\"name\": \"Sunday Rock\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа № 69\", \"street\": null}, {\"name\": \"УрГУПС\", \"street\": null}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": \"Детский сад № 582\", \"street\": null}, {\"name\": \"Средняя школа №208\", \"street\": null}, {\"name\": \"Детский сад № 9\", \"street\": null}, {\"name\": \"Детский сад № 199 Созидание\", \"street\": null}, {\"name\": \"Гимназия № 2\", \"street\": null}, {\"name\": \"Детский сад № 393\", \"street\": null}, {\"name\": \"Детский сад № 174\", \"street\": null}, {\"name\": \"Уральский музыкальный колледж\", \"street\": null}]}, \"bad\": 75, \"positive\": -11.0, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Театральный институт\", \"street\": null, \"bad\": \"Foodbox, Antona Valeka Street, Екатеринбург-Сити, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Уральская государственная архитектурно-художественная академия\", \"street\": null, \"bad\": \"Базар, 23, Karla Libknekhta Street, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Коньяки Дагестана, 41, Улица Малышева, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Поль Бейкери;Лавкрафт, 64, Malysheva Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"ЕГЭбург\", \"street\": null, \"bad\": \"Syndrome Bar, 13, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Уральская государственная консерватория\", \"street\": null, \"bad\": \"Double bar, 8Б, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}]}, \"index\": 251, \"rating\": 0}",
						"{\"good\": 28, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 13, \"transport\": {\"len\": 4, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 131\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад комбинированного вида № 55\", \"street\": \"улица Миномётчиков\"}]}, \"bad\": 9, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 252, \"rating\": 100}",
						"{\"good\": 123, \"park\": 25, \"cigarettes\": 7, \"alcohol\": 44, \"educational\": 45, \"transport\": {\"len\": 32, \"data\": [{\"name\": \"Школа Конфуция\", \"street\": null}, {\"name\": \"Уральский промышленно-экономический техникум\", \"street\": null}, {\"name\": \"Детский сад #184\", \"street\": null}, {\"name\": \"Екатеринбургская детская театральная школа\", \"street\": null}, {\"name\": \"Amante\", \"street\": null}, {\"name\": \"Детский сад №99\", \"street\": null}, {\"name\": \"Школа № 145\", \"street\": null}, {\"name\": \"Лицей № 88\", \"street\": null}, {\"name\": \"Детский сад №276\", \"street\": null}, {\"name\": \"Детский сад № 276\", \"street\": null}, {\"name\": \"Детский сад № 441\", \"street\": null}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 376\", \"street\": null}, {\"name\": \"Детский сад № 113\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Детский сад №550 Академия успеха\", \"street\": null}, {\"name\": \"Детский сад № 501\", \"street\": null}, {\"name\": \"Детский сад № 450\", \"street\": null}, {\"name\": \"Профессиональное училище парикмахерского мастерства\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 230\", \"street\": null}, {\"name\": \"школа №75\", \"street\": null}, {\"name\": \"Гимназия № 37\", \"street\": null}, {\"name\": \"Детский сад № 230 \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад № 262\", \"street\": null}, {\"name\": \"Гимназия № 212 «Екатеринбург — Париж»\", \"street\": null}, {\"name\": \"Техникум индустрии питания и услуг «Кулинар»\", \"street\": null}, {\"name\": \"Детский сад №369\", \"street\": null}, {\"name\": \"Детский сад №288\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": \"Уральская улица\"}, {\"name\": null, \"street\": null}]}, \"bad\": 75, \"positive\": -13.5, \"violations\": {\"len\": 19, \"data\": [{\"name\": \"Уральская государственная архитектурно-художественная академия\", \"street\": null, \"bad\": \"Базар, 23, Karla Libknekhta Street, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Amante\", \"street\": null, \"bad\": \"XXXX, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад № 276\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\", \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад № 345\", \"street\": null, \"bad\": \"Красное&Белое, 76, улица Луначарского, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"Уральский политехнический колледж\", \"street\": null, \"bad\": \"Столовая, 91, Lenin Avenue, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620062, Russia\"}, {\"name\": \"Детский сад № 376\", \"street\": null, \"bad\": \"Red&White, 73, Bazhova Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}, {\"name\": \"Детский сад № 113\", \"street\": null, \"bad\": \"Кафе-пекарня, Shartashskaya Street, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"ФГОУ ВПО Уральская ГСХА\", \"street\": null, \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Детский сад №369\", \"street\": null, \"bad\": \"Сушкоф, 25, Mamina-Sibiryaka Street, Екатерининский Парк, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620047, Russia\"}, {\"name\": \"Детский сад № 505\", \"street\": null, \"bad\": \"Красное&Белое, 16, Советская улица, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620067, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Subway, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Юность, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Сербский дворик, 53, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Killfish, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"А ты где?, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая, 4, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Dom Pechati, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Jawsspot, 3, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}]}, \"index\": 253, \"rating\": 0}",
						"{\"good\": 147, \"park\": 14, \"cigarettes\": 8, \"alcohol\": 42, \"educational\": 34, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null}, {\"name\": \"Университет связи\", \"street\": null}, {\"name\": \"IndiGo TheFirst\", \"street\": null}, {\"name\": \"Дом радости\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Сакко и Ванцетти\"}, {\"name\": \"KIBERone\", \"street\": \"улица Татищева\"}, {\"name\": \"Школа № 69\", \"street\": null}, {\"name\": \"Детский сад № 582\", \"street\": null}, {\"name\": null, \"street\": \"улица Крауля\"}, {\"name\": \"Детский сад № 9\", \"street\": null}, {\"name\": \"Лицей № 173\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Детский сад № 562\", \"street\": null}, {\"name\": \"Детский сад № 368\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": \"улица Репина\"}, {\"name\": \"Уральский государственный медицинский университет\", \"street\": \"улица Репина\"}, {\"name\": \"Детский сад №373\", \"street\": null}, {\"name\": \"Уральский музыкальный колледж\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 60, \"positive\": 13.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Уральская государственная медицинская академия\", \"street\": null, \"bad\": \"Столовая, 17, Klyuchevskaya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Уральский институт бизнеса им. И. А. Ильина\", \"street\": null, \"bad\": \"Agave, 6А, переулок Центральный Рынок, Форум-Сити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null, \"bad\": \"Provizia, ресторан на прилавке, 7, Верх-Исетский бульвар, Адмиральский-2, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620028, Russia\"}, {\"name\": null, \"street\": \"улица Крауля\", \"bad\": \"Пивасик и карасик, 8, Kraulya Street, Татищевский, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}, {\"name\": \"Лицей № 173\", \"street\": null, \"bad\": \"8, Kuybysheva Street, Мечта, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}]}, \"index\": 254, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 255, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 256, \"rating\": 40}",
						"{\"good\": 39, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 3, \"educational\": 28, \"transport\": {\"len\": 15, \"data\": [{\"name\": \"УрЮИ МВД РФ\", \"street\": null}, {\"name\": null, \"street\": \"переулок Замятина\"}, {\"name\": null, \"street\": \"улица Баумана\"}, {\"name\": \"РГППУ\", \"street\": \"Каширская улица\"}, {\"name\": \"Школа-интернат №89\", \"street\": \"Даниловская улица\"}, {\"name\": null, \"street\": \"Каширская улица\"}, {\"name\": \"Детский сад №76\", \"street\": null}, {\"name\": \"Средняя Школа №114\", \"street\": null}, {\"name\": \"Десткий сад №310\", \"street\": null}, {\"name\": \"Детский сад №440\", \"street\": null}, {\"name\": \"Детский сад №500\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 5, \"positive\": 14.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 257, \"rating\": 100}",
						"{\"good\": 95, \"park\": 13, \"cigarettes\": 11, \"alcohol\": 19, \"educational\": 28, \"transport\": {\"len\": 18, \"data\": [{\"name\": \"Екатеринбургская академия современного искусства\", \"street\": null}, {\"name\": null, \"street\": \"Шорный переулок\"}, {\"name\": \"Детский сад № 308 Жемчужинка\", \"street\": null}, {\"name\": \"Детский сад № 62\", \"street\": null}, {\"name\": \"Гимназия № 45\", \"street\": null}, {\"name\": \"Школа «Славянская»\", \"street\": null}, {\"name\": \"Детский сад № 102\", \"street\": null}, {\"name\": \"Детский сад № 103 Родники\", \"street\": null}, {\"name\": \"Школа № 157\", \"street\": null}, {\"name\": \"Детский сад № 41\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 63\", \"street\": null}, {\"name\": \"Детский сад № 479\", \"street\": null}, {\"name\": \"Школа № 134\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Специальная коррекционная школа № 169\", \"street\": null}, {\"name\": \"Детский сад №34\", \"street\": null}, {\"name\": \"Детский сад № 299\", \"street\": null}]}, \"bad\": 28, \"positive\": 19.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Средняя школа №96\", \"street\": null, \"bad\": \"Пив&ко, 37, Хрустальная улица, Синие Камни, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620138, Russia\"}, {\"name\": \"Школа № 157\", \"street\": null, \"bad\": \"Red&White, улица Новгородцевой, Парк Каменные Палатки, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 157\", \"street\": null, \"bad\": \"улица Новгородцевой, Парк Каменные Палатки, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}]}, \"index\": 258, \"rating\": 60}",
						"{\"good\": 44, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 7, \"educational\": 13, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Школа № 122\", \"street\": null}, {\"name\": \"Детский сад № 46\", \"street\": null}, {\"name\": \"Детский сад № 312\", \"street\": null}, {\"name\": \"Детский сад № 51\", \"street\": null}, {\"name\": \"Школа № 129\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский просветительский центр / Воскресная школа\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 11, \"positive\": 11.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад № 132\", \"street\": null, \"bad\": \"45, Расточная улица, Сортировка, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620050, Russia\"}, {\"name\": \"Детский сад № 132\", \"street\": null, \"bad\": \"Красное&Белое, 45, Расточная улица, Сортировка, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620050, Russia\"}]}, \"index\": 259, \"rating\": 60}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 260, \"rating\": 100}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 261, \"rating\": 100}",
						"{\"good\": 4, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 262, \"rating\": 100}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 263, \"rating\": 100}",
						"{\"good\": 116, \"park\": 28, \"cigarettes\": 14, \"alcohol\": 27, \"educational\": 46, \"transport\": {\"len\": 25, \"data\": [{\"name\": \"ФЭУ УрФУ\", \"street\": null}, {\"name\": \"ММИ УрФУ\", \"street\": null}, {\"name\": \"ЭТФ УрФУ\", \"street\": null}, {\"name\": \"Детская хоровая школа №1\", \"street\": null}, {\"name\": \"Екатеринбургская академия современного искусства\", \"street\": null}, {\"name\": \"Институт развития образования\", \"street\": null}, {\"name\": \"Сад чудес\", \"street\": null}, {\"name\": \"ТЭФ УрФУ\", \"street\": \"улица Софьи Ковалевской\"}, {\"name\": \"Детский сад №99\", \"street\": null}, {\"name\": \"Лицей № 88\", \"street\": null}, {\"name\": \"Детский сад №276\", \"street\": null}, {\"name\": null, \"street\": \"Комсомольская улица\"}, {\"name\": null, \"street\": null}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Екатеринбуржский колледж транспортного строительства\", \"street\": null}, {\"name\": \"Школа № 134\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Химико-фармацевтический центр УрФУ\", \"street\": null}, {\"name\": \"Детский сад № 255\", \"street\": null}, {\"name\": \"Детский сад № 423\", \"street\": null}, {\"name\": \"Детский сад № 407 «Жаворонок»\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": \"Уральская улица\"}]}, \"bad\": 60, \"positive\": -2.0, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Гуманитарный университет\", \"street\": null, \"bad\": \"Столовая, 19, Студенческая улица, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}, {\"name\": \"Лицей № 130\", \"street\": null, \"bad\": \"Тройка, 26, Академическая улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"цветочный магазин, 10, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null, \"bad\": \"Первомайская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620108, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая № 2, 23, Комсомольская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}, {\"name\": \"Детский сад № 109\", \"street\": null, \"bad\": \"Красное&Белое, 10, Kuryinskiy Lane, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}]}, \"index\": 264, \"rating\": 0}",
						"{\"good\": 108, \"park\": 10, \"cigarettes\": 11, \"alcohol\": 22, \"educational\": 19, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 46, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 265, \"rating\": 100}",
						"{\"good\": 37, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 7, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 18.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 266, \"rating\": 100}",
						"{\"good\": 8, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 267, \"rating\": 100}",
						"{\"good\": 6, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 268, \"rating\": 100}",
						"{\"good\": 13, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 17, \"positive\": -10.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 269, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 270, \"rating\": 40}",
						"{\"good\": 24, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 10.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 271, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 272, \"rating\": 100}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 273, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 274, \"rating\": 100}",
						"{\"good\": 3, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Екатеринбургский техникум «Автоматика»\", \"street\": \"Надеждинская улица\"}, {\"name\": \"Детский сад № 85\", \"street\": null}, {\"name\": \"Детский сад № 80\", \"street\": null}]}, \"bad\": 3, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 275, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 276, \"rating\": 100}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 277, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 278, \"rating\": 100}",
						"{\"good\": 9, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад №567\", \"street\": null}]}, \"bad\": 0, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 279, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 280, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 281, \"rating\": 40}",
						"{\"good\": 14, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 282, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 283, \"rating\": 40}",
						"{\"good\": 73, \"park\": 6, \"cigarettes\": 0, \"alcohol\": 4, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 31.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 284, \"rating\": 100}",
						"{\"good\": 29, \"park\": 11, \"cigarettes\": 2, \"alcohol\": 5, \"educational\": 7, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Учебный центр МРСК Урала\", \"street\": \"улица Электриков\"}, {\"name\": \"Школа №66\", \"street\": null}, {\"name\": \"Школа №78\", \"street\": null}, {\"name\": \"Детский сад №523\", \"street\": null}, {\"name\": \"Детский сад № 170\", \"street\": null}]}, \"bad\": 8, \"positive\": 6.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 285, \"rating\": 100}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 286, \"rating\": 100}",
						"{\"good\": 13, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 3, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 287, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 288, \"rating\": 40}",
						"{\"good\": 37, \"park\": 4, \"cigarettes\": 4, \"alcohol\": 10, \"educational\": 14, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 21, \"positive\": -2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 289, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 290, \"rating\": 100}",
						"{\"good\": 126, \"park\": 14, \"cigarettes\": 29, \"alcohol\": 50, \"educational\": 58, \"transport\": {\"len\": 38, \"data\": [{\"name\": \"Карапуз\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детско-юношеский клуб \\\"Тинейджер-шоу\\\"\", \"street\": null}, {\"name\": \"Детская Музыкальная Школа №5 им. В. В. Знаменского\", \"street\": null}, {\"name\": \"Садик счастья\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа №67\", \"street\": \"улица Стачек\"}, {\"name\": null, \"street\": \"улица Машиностроителей\"}, {\"name\": \"Детский сад №406\", \"street\": null}, {\"name\": \"Детский сад №411\", \"street\": null}, {\"name\": \"Гимназия \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Начальная школа \\\"Арт-этюд\\\"\", \"street\": \"улица Уральских Рабочих\"}, {\"name\": \"Детский сад № 461\", \"street\": null}, {\"name\": \"Детский сад №86\", \"street\": null}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Детский сад №446\", \"street\": null}, {\"name\": \"Детский сад №576\", \"street\": null}, {\"name\": \"Детский сад №274\", \"street\": null}, {\"name\": \"Детский сад № 15\", \"street\": null}, {\"name\": \"Детский сад №168\", \"street\": null}, {\"name\": \"Детский сад №440\", \"street\": null}, {\"name\": \"Детский сад №477\", \"street\": null}, {\"name\": \"Школа №46\", \"street\": null}, {\"name\": \"Школа №66\", \"street\": null}, {\"name\": \"Школа №78\", \"street\": null}, {\"name\": \"Детский сад №523\", \"street\": null}, {\"name\": \"Школа Гелиос\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 428\", \"street\": null}, {\"name\": \"Детский сад № 478\", \"street\": null}, {\"name\": \"Детский сад №460\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 170\", \"street\": null}, {\"name\": \"Детский сад №176\", \"street\": null}, {\"name\": \"Детский сад Гелиос\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Российский государственный профессионально-педагогический университет\", \"street\": null}]}, \"bad\": 68, \"positive\": -5.0, \"violations\": {\"len\": 8, \"data\": [{\"name\": \"Садик счастья\", \"street\": null, \"bad\": \"Магнум-винотека, 8, Кировградская улица, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Две ладошки\", \"street\": null, \"bad\": \"улица Победы, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Школа-интернат №18\", \"street\": null, \"bad\": \"улица Восстания, Квартал Новаторов, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620098, Russia\"}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null, \"bad\": \"College canteen, 50, проспект Космонавтов, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Детский сад №274\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}, {\"name\": \"Детский сад № 551\", \"street\": null, \"bad\": \"Лукоморье, 77, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620135, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"Коасное и Белое, 24, улица Старых Большевиков, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}, {\"name\": \"Детский сад №436\", \"street\": null, \"bad\": \"красно белое, 29, улица Баумана, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620091, Russia\"}]}, \"index\": 291, \"rating\": 0}",
						"{\"good\": 7, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 9, \"positive\": -5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 292, \"rating\": 40}",
						"{\"good\": 50, \"park\": 15, \"cigarettes\": 7, \"alcohol\": 23, \"educational\": 23, \"transport\": {\"len\": 16, \"data\": [{\"name\": \"Карапуз\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Садик счастья\", \"street\": null}, {\"name\": \"Екатеринбургская академия современного искусства (ЕАСИ)\", \"street\": \"улица Красных Партизан\"}, {\"name\": \"KIBERone\", \"street\": \"Кировградская улица\"}, {\"name\": \"Гимназия № 144\", \"street\": null}, {\"name\": null, \"street\": \"улица Машиностроителей\"}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Детский сад № 399\", \"street\": null}, {\"name\": \"Детский сад № 432\", \"street\": null}, {\"name\": \"Детский сад № 158\", \"street\": null}, {\"name\": \"Детский сад № 215\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад № 428\", \"street\": null}, {\"name\": \"Детский сад № 478\", \"street\": null}]}, \"bad\": 36, \"positive\": -11.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Садик счастья\", \"street\": null, \"bad\": \"Магнум-винотека, 8, Кировградская улица, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null, \"bad\": \"College canteen, 50, проспект Космонавтов, Эльмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620018, Russia\"}, {\"name\": \"Екатеринбургский промышленно-технологический техникум (ЕПТТ) им. В.М. Курочкина\", \"street\": \"улица Машиностроителей\", \"bad\": \"13, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}, {\"name\": \"Российский государственный профессионально-педагогический университет\", \"street\": null, \"bad\": \"Столовая, 11, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620012, Russia\"}]}, \"index\": 293, \"rating\": 0}",
						"{\"good\": 20, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 7, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 294, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 295, \"rating\": 40}",
						"{\"good\": 95, \"park\": 19, \"cigarettes\": 13, \"alcohol\": 32, \"educational\": 30, \"transport\": {\"len\": 15, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"УрГУ\", \"street\": null}, {\"name\": \"Детский сад № 239 «Золотое Яблоко»\", \"street\": null}, {\"name\": \"ФГБОУ ВО Уральский ГАУ\", \"street\": \"улица Белинского\"}, {\"name\": \"Екатеринбургский экономико-технологический колледж\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Детский сад № 585\", \"street\": null}, {\"name\": \"Уральский институт экономики, управления и права\", \"street\": \"улица Луначарского\"}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null}, {\"name\": \"Детский сад № 386 «Знайка»\", \"street\": null}, {\"name\": \"Детский сад № 419\", \"street\": null}, {\"name\": \"Детский сад № 455\", \"street\": null}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null}, {\"name\": \"Детский сад №465\", \"street\": null}, {\"name\": \"Школа-интернат «Эверест»\", \"street\": null}]}, \"bad\": 58, \"positive\": -10.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"ГАОУ СПО СО Екатеринбургский Монтажный Колледж\", \"street\": \"улица Декабристов\", \"bad\": \"Столовая, 83А, улица Декабристов, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null, \"bad\": \"Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Детский сад № 455\", \"street\": null, \"bad\": \"KFC, улица 8 Марта, Огни Екатеринбурга, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620144, Russia\"}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"УрГЭУ-СИНХ\", \"street\": null, \"bad\": \"Столовая УрГЭУ, Kuybysheva Street, Артек, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620219, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая УрФУ, 48А, улица Куйбышева, Армада, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}]}, \"index\": 296, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 297, \"rating\": 40}",
						"{\"good\": 84, \"park\": 22, \"cigarettes\": 14, \"alcohol\": 29, \"educational\": 27, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"Екатеринбургская академия современного искусства\", \"street\": null}, {\"name\": \"Школа № 13\", \"street\": null}, {\"name\": \"Гимназия № 94\", \"street\": null}, {\"name\": \"Детский сад № 166 «Гнёздышко»\", \"street\": null}, {\"name\": \"Детский сад № 363\", \"street\": null}, {\"name\": null, \"street\": \"Шорный переулок\"}, {\"name\": \"Детский сад № 75\", \"street\": null}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null}, {\"name\": \"Дом Детского Творчества Октябрьского района\", \"street\": null}, {\"name\": \"Детский сад № 63\", \"street\": null}, {\"name\": \"Детский сад № 479\", \"street\": null}, {\"name\": \"Школа № 134\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 123 ОАО «РЖД»\", \"street\": null}, {\"name\": \"Детский сад №34\", \"street\": null}, {\"name\": \"Детский сад № 299\", \"street\": null}, {\"name\": \"Детский сад № 261 «Речецветик»\", \"street\": null}]}, \"bad\": 41, \"positive\": 1.0, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Tveritina Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Школа № 13\", \"street\": null, \"bad\": \"Роспечать, Bazhova Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"Гимназия № 40\", \"street\": null, \"bad\": \"Роспечать, Dekabristov Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Центр развития ребёнка «Дошколёнок»\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null, \"bad\": \"Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}]}, \"index\": 298, \"rating\": 60}",
						"{\"good\": 96, \"park\": 29, \"cigarettes\": 9, \"alcohol\": 13, \"educational\": 24, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 15, \"positive\": 33.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 299, \"rating\": 100}",
						"{\"good\": 7, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 0.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Кулинария Смак, 2, Александровская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620066, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}]}, \"index\": 300, \"rating\": 60}",
						"{\"good\": 128, \"park\": 41, \"cigarettes\": 18, \"alcohol\": 102, \"educational\": 37, \"transport\": {\"len\": 21, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Театральный институт\", \"street\": null}, {\"name\": \"Институт Машиноведения УрО РАН\", \"street\": null}, {\"name\": \"Екатеринбургская детская театральная школа\", \"street\": null}, {\"name\": \"АРТ-Капелька\", \"street\": null}, {\"name\": \"Study & Bonus\", \"street\": null}, {\"name\": \"Sunday Rock\", \"street\": null}, {\"name\": \"EnglishFit\", \"street\": null}, {\"name\": \"Amante\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Уральский институт экономики, управления и права\", \"street\": \"улица Луначарского\"}, {\"name\": \"Школа № 76\", \"street\": null}, {\"name\": \"Гимназия № 8 им. Дягилева\", \"street\": null}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 113\", \"street\": null}, {\"name\": \"Детский сад № 582\", \"street\": null}, {\"name\": \"Гимназия № 5\", \"street\": null}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null}, {\"name\": \"Школа №10\", \"street\": null}]}, \"bad\": 169, \"positive\": -105.0, \"violations\": {\"len\": 28, \"data\": [{\"name\": \"Театральный институт\", \"street\": null, \"bad\": \"Foodbox, Antona Valeka Street, Екатеринбург-Сити, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Уральская государственная архитектурно-художественная академия\", \"street\": null, \"bad\": \"Базар, 23, Karla Libknekhta Street, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Коньяки Дагестана, 41, Улица Малышева, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Свердловское художественное училище им. И. Д. Шадра\", \"street\": null, \"bad\": \"Поль Бейкери;Лавкрафт, 64, Malysheva Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"АРТ-Капелька\", \"street\": null, \"bad\": \"МБ Вино и Цветы, 72, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"ЕГЭбург\", \"street\": null, \"bad\": \"Syndrome Bar, 13, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620014, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Gustoy Hookah Lounge, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"EnglishFit\", \"street\": null, \"bad\": \"Влади Bar, 51, улица Малышева, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Amante\", \"street\": null, \"bad\": \"XXXX, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"KIBERone\", \"street\": \"улица Малышева\", \"bad\": \"А Ты Где, 137, улица Луначарского, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Уральская государственная сельскохозяйственная академия\", \"street\": \"улица Тургенева\", \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"ФГОУ ВПО Уральская ГСХА\", \"street\": null, \"bad\": \"Столовая, 23, улица Тургенева, Бажовский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Маруся, Khokhryakova Street, Тринити, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"30, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Гимназия № 5\", \"street\": null, \"bad\": \"Бургеры и Креветки, 24, Malysheva Street, Тихвинъ, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Музыкально-эстетический педагогический колледж\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"Школа №10\", \"street\": null, \"bad\": \"Три толстяка, 60, улица Вайнера, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620077, Russia\"}, {\"name\": \"Российский экономический университет имени Г. В. Плеханова\", \"street\": null, \"bad\": \"Everest, 36, Gogolya Street, Эверест, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620151, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Subway, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая УрФУ, 48А, улица Куйбышева, Армада, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620026, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Юность, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Сербский дворик, 53, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 650075, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Killfish, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"А ты где?, 49, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Столовая, 4, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620083, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Dom Pechati, Lenin Avenue, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}, {\"name\": \"УрФУ\", \"street\": null, \"bad\": \"Jawsspot, 3, улица Тургенева, Бажовский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620075, Russia\"}, {\"name\": \"Уральская государственная консерватория\", \"street\": null, \"bad\": \"Double bar, 8Б, 8th March Street, Кольцо Екатерины, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620990, Russia\"}]}, \"index\": 301, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 302, \"rating\": 40}",
						"{\"good\": 68, \"park\": 4, \"cigarettes\": 7, \"alcohol\": 26, \"educational\": 36, \"transport\": {\"len\": 26, \"data\": [{\"name\": \"Детский сад Мурзилка\", \"street\": null}, {\"name\": \"Клубника\", \"street\": null}, {\"name\": \"Talento\", \"street\": null}, {\"name\": \"Сёма\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"ясли Лисинята\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": \"Июльская улица\"}, {\"name\": \"Маленькая страна\", \"street\": null}, {\"name\": \"Гимназия N35\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": null}, {\"name\": \"ЧОУ СОШ «Творчество»\", \"street\": \"улица Пионеров\"}, {\"name\": \"Школа № 146\", \"street\": null}, {\"name\": \"Детский сад №180\", \"street\": null}, {\"name\": \"Гимназия №35\", \"street\": null}, {\"name\": \"Детский сад № 517\", \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": \"Детский сад № 322\", \"street\": null}, {\"name\": \"Средняя школа № 165\", \"street\": null}, {\"name\": \"Детский сад Акадеша\", \"street\": null}, {\"name\": \"Детский сад № 536 «Сказка»\", \"street\": null}, {\"name\": \"Детский сад № 588\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 230\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Детский сад № 230 \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад №91\", \"street\": null}]}, \"bad\": 37, \"positive\": -3.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"Пивко, 6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}, {\"name\": \"Академия робототехники RoboNest\", \"street\": null, \"bad\": \"6, улица Учителей, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620137, Russia\"}]}, \"index\": 303, \"rating\": 0}",
						"{\"good\": 91, \"park\": 7, \"cigarettes\": 9, \"alcohol\": 36, \"educational\": 29, \"transport\": {\"len\": 20, \"data\": [{\"name\": \"ДЮСШ\", \"street\": null}, {\"name\": \"Вавилон\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Школа №74\", \"street\": \"улица Крауля\"}, {\"name\": \"Детский сад № 13\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 48\", \"street\": null}, {\"name\": \"Школа № 171\", \"street\": null}, {\"name\": \"Детский сад № 143\", \"street\": null}, {\"name\": \"Школа № 121\", \"street\": null}, {\"name\": \"Менталитет\", \"street\": null}, {\"name\": \"Школа №63\", \"street\": null}, {\"name\": \"Детский сад № 511\", \"street\": null}, {\"name\": \"Детский сад № 5\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": \"Детский сад компенсирующего вида № 466\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 53, \"positive\": -7.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Fanagoria, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Хмель и солод, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Пивкофф, 70, Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 249\", \"street\": null, \"bad\": \"Kraulya Street, Регата, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620131, Russia\"}, {\"name\": \"Детский сад № 511\", \"street\": null, \"bad\": \"PizzaMia, 53, Kraulya Street, Татищев, ВИЗ, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620109, Russia\"}]}, \"index\": 304, \"rating\": 0}",
						"{\"good\": 25, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 8, \"educational\": 15, \"transport\": {\"len\": 8, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Средняя школа № 183\", \"street\": null}, {\"name\": \"Средняя школа № 170\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Екатеринбургский техникум «Автоматика»\", \"street\": \"Надеждинская улица\"}, {\"name\": \"Десткий сад № 179\", \"street\": null}, {\"name\": \"Средняя школа № 172\", \"street\": null}, {\"name\": \"Детский сад комбинированного вида № 55\", \"street\": \"улица Миномётчиков\"}]}, \"bad\": 10, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 305, \"rating\": 100}",
						"{\"good\": 100, \"park\": 5, \"cigarettes\": 29, \"alcohol\": 39, \"educational\": 25, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 46, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 306, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 307, \"rating\": 100}",
						"{\"good\": 18, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 11, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"УрЮИ МВД РФ\", \"street\": null}, {\"name\": null, \"street\": \"переулок Замятина\"}, {\"name\": \"Школа-интернат №89\", \"street\": \"Даниловская улица\"}, {\"name\": \"Детский сад №76\", \"street\": null}, {\"name\": \"Десткий сад №310\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 1, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 308, \"rating\": 100}",
						"{\"good\": 42, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 11, \"educational\": 16, \"transport\": {\"len\": 8, \"data\": [{\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Екатеринбургский техникум «Автоматика»\", \"street\": \"Надеждинская улица\"}, {\"name\": \"Школа № 122\", \"street\": null}, {\"name\": \"Детский сад № 46\", \"street\": null}, {\"name\": \"Детский сад № 131\", \"street\": null}, {\"name\": \"Детская музыкальная школа № 7 им. С. В. Рахманинова\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 13, \"positive\": 8.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад № 132\", \"street\": null, \"bad\": \"45, Расточная улица, Сортировка, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620050, Russia\"}, {\"name\": \"Детский сад № 132\", \"street\": null, \"bad\": \"Красное&Белое, 45, Расточная улица, Сортировка, Железнодорожный район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620050, Russia\"}]}, \"index\": 309, \"rating\": 60}",
						"{\"good\": 77, \"park\": 7, \"cigarettes\": 14, \"alcohol\": 19, \"educational\": 17, \"transport\": {\"len\": 11, \"data\": [{\"name\": \"Детский сад № 308 Жемчужинка\", \"street\": null}, {\"name\": \"Детский сад № 62\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null}, {\"name\": \"Детский сад № 144\", \"street\": null}, {\"name\": \"Детский сад № 41\", \"street\": null}, {\"name\": \"Школа № 151\", \"street\": null}, {\"name\": \"Школа № 150\", \"street\": null}, {\"name\": \"Детский сад № 101\", \"street\": null}, {\"name\": \"Детский сад № 313\", \"street\": null}, {\"name\": \"Специальная коррекционная школа № 169\", \"street\": null}, {\"name\": \"Детский сад № 299\", \"street\": null}]}, \"bad\": 26, \"positive\": 12.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Средняя школа №96\", \"street\": null, \"bad\": \"Пив&ко, 37, Хрустальная улица, Синие Камни, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620138, Russia\"}, {\"name\": \"Детский сад № 144\", \"street\": null, \"bad\": \"Красное&Белое, 33, улица Новгородцевой, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 151\", \"street\": null, \"bad\": \"Панельная улица, МЖК, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 150\", \"street\": null, \"bad\": \"Хлеб, улица Новгородцевой, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}]}, \"index\": 310, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 311, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 312, \"rating\": 100}",
						"{\"good\": 14, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 313, \"rating\": 100}",
						"{\"good\": 10, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 11, \"transport\": {\"len\": 8, \"data\": [{\"name\": null, \"street\": \"переулок Замятина\"}, {\"name\": null, \"street\": \"Каширская улица\"}, {\"name\": \"Детский сад №76\", \"street\": null}, {\"name\": \"Средняя Школа №114\", \"street\": null}, {\"name\": \"Десткий сад №310\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа №167\", \"street\": null}]}, \"bad\": 1, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 314, \"rating\": 100}",
						"{\"good\": 58, \"park\": 17, \"cigarettes\": 7, \"alcohol\": 13, \"educational\": 14, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"KIBERone\", \"street\": \"улица Ткачей\"}, {\"name\": \"Детский сад № 49\", \"street\": null}, {\"name\": \"Детский сад № 75\", \"street\": null}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null}, {\"name\": \"Дом Детского Творчества Октябрьского района\", \"street\": null}, {\"name\": \"Детский сад № 63\", \"street\": null}, {\"name\": \"Детский сад № 479\", \"street\": null}]}, \"bad\": 34, \"positive\": -5.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Tveritina Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Школа № 62\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Гимназия № 40\", \"street\": null, \"bad\": \"Роспечать, Dekabristov Street, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Центр развития ребёнка «Дошколёнок»\", \"street\": null, \"bad\": \"Кухня у Истоминых, 20, Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}, {\"name\": \"Детский сад № 564 «Филипок»\", \"street\": null, \"bad\": \"Bolshakova Street, Clever Park, Парковый, Oktyabrsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620100, Russia\"}]}, \"index\": 315, \"rating\": 0}",
						"{\"good\": 10, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 316, \"rating\": 100}",
						"{\"good\": 114, \"park\": 27, \"cigarettes\": 30, \"alcohol\": 42, \"educational\": 44, \"transport\": {\"len\": 25, \"data\": [{\"name\": \"ФЭУ УрФУ\", \"street\": null}, {\"name\": \"ММИ УрФУ\", \"street\": null}, {\"name\": \"ЭТФ УрФУ\", \"street\": null}, {\"name\": \"Екатеринбургская академия современного искусства\", \"street\": null}, {\"name\": \"ТЭФ УрФУ\", \"street\": \"улица Софьи Ковалевской\"}, {\"name\": null, \"street\": \"Комсомольская улица\"}, {\"name\": \"Гимназия № 45\", \"street\": null}, {\"name\": \"Школа «Славянская»\", \"street\": null}, {\"name\": \"Детский сад № 102\", \"street\": null}, {\"name\": \"Свердловский областной медицинский колледж\", \"street\": null}, {\"name\": \"Школа № 157\", \"street\": null}, {\"name\": \"Детский сад № 41\", \"street\": null}, {\"name\": \"Детский сад № 389\", \"street\": null}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null}, {\"name\": \"Детский сад № 416\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 134\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Химико-фармацевтический центр УрФУ\", \"street\": null}, {\"name\": \"Детский сад № 255\", \"street\": null}, {\"name\": \"Детский сад № 407 «Жаворонок»\", \"street\": null}, {\"name\": \"Детский сад №34\", \"street\": null}, {\"name\": \"Детский сад № 109\", \"street\": null}, {\"name\": \"Детский сад № 299\", \"street\": null}]}, \"bad\": 61, \"positive\": -4.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Школа № 157\", \"street\": null, \"bad\": \"Red&White, улица Новгородцевой, Парк Каменные Палатки, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Школа № 157\", \"street\": null, \"bad\": \"улица Новгородцевой, Парк Каменные Палатки, ЖБИ, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620072, Russia\"}, {\"name\": \"Уральский институт Государственной противопожарной службы МЧС\", \"street\": null, \"bad\": \"Первомайская улица, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620108, Russia\"}, {\"name\": \"Детский сад № 109\", \"street\": null, \"bad\": \"Красное&Белое, 10, Kuryinskiy Lane, Парк Каменные Палатки, Втузгородок, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620049, Russia\"}]}, \"index\": 317, \"rating\": 0}",
						"{\"good\": 9, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 318, \"rating\": 100}",
						"{\"good\": 164, \"park\": 18, \"cigarettes\": 8, \"alcohol\": 14, \"educational\": 29, \"transport\": {\"len\": 29, \"data\": [{\"name\": \"Детский сад № 45\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Десятое королевство\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Акварелька\", \"street\": null}, {\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null}, {\"name\": \"Гимназия № 161\", \"street\": null}, {\"name\": \"Школа № 65\", \"street\": \"улица Академика Постовского\"}, {\"name\": \"Школа №154\", \"street\": null}, {\"name\": \"Детский сад № 26 «Лесовичок»\", \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": null}, {\"name\": \"Умка\", \"street\": \"Волгоградская улица\"}, {\"name\": \"Уральская государственная медицинская академия\", \"street\": null}, {\"name\": \"Детский сад № 561\", \"street\": null}, {\"name\": \"Школа № 109\", \"street\": null}, {\"name\": \"Средняя школа № 140\", \"street\": null}, {\"name\": \"Лицей № 159\", \"street\": null}, {\"name\": \"Школа № 152\", \"street\": null}, {\"name\": \"Детский сад №342\", \"street\": null}, {\"name\": \"Детский сад № 54\", \"street\": null}, {\"name\": \"Детский сад №71\", \"street\": null}, {\"name\": \"Свердловский колледж искусств и культуры\", \"street\": null}, {\"name\": \"Детский сад №209\", \"street\": null}, {\"name\": \"Детский сад №31\", \"street\": null}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"Детский сад № 88\", \"street\": null}, {\"name\": \"Детский сад № 147\", \"street\": null}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\"}, {\"name\": \"Рябинка, детский сад № 156\", \"street\": null}]}, \"bad\": 26, \"positive\": 56.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Школа скорочтения и развития интеллекта IQ007\", \"street\": null, \"bad\": \"Красное&Белое, 52, Amundsena Street, Юго-Западный, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Детский сад №71\", \"street\": null, \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}, {\"name\": \"Детский сад №209\", \"street\": null, \"bad\": \"Пив&ко, 64, улица Амундсена, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620147, Russia\"}, {\"name\": \"Муз школа №11\", \"street\": \"бульвар Денисова-Уральского\", \"bad\": \"Пресса, бульвар Денисова-Уральского, Апельсин, Leninsky District, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620146, Russia\"}]}, \"index\": 319, \"rating\": 60}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 320, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 321, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 322, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 323, \"rating\": 100}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 324, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 325, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 326, \"rating\": 40}",
						"{\"good\": 5, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 327, \"rating\": 40}",
						"{\"good\": 16, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 6, \"educational\": 18, \"transport\": {\"len\": 14, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Гимназия № 174\", \"street\": null}, {\"name\": \"Средняя школа № 183\", \"street\": null}, {\"name\": \"Средняя школа № 170\", \"street\": null}, {\"name\": \"Детский сад № 245\", \"street\": null}, {\"name\": \"Екатеринбургский техникум «Автоматика»\", \"street\": \"Надеждинская улица\"}, {\"name\": \"Детский сад № 85\", \"street\": null}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 117\", \"street\": null}, {\"name\": \"Детский сад № 175\", \"street\": null}, {\"name\": \"Школа № 148\", \"street\": null}, {\"name\": \"Школа № 166\", \"street\": null}, {\"name\": \"Детский сад № 370\", \"street\": null}, {\"name\": \"Школа № 147\", \"street\": null}]}, \"bad\": 7, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 328, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 329, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 330, \"rating\": 40}",
						"{\"good\": 9, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 5, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Школа № 53\", \"street\": null}]}, \"bad\": 1, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 331, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 332, \"rating\": 100}",
						"{\"good\": 30, \"park\": 8, \"cigarettes\": 4, \"alcohol\": 6, \"educational\": 8, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Talento\", \"street\": null}, {\"name\": \"Академия талантов\", \"street\": \"Июльская улица\"}, {\"name\": \"Маленькая страна\", \"street\": null}, {\"name\": \"Детский сад №180\", \"street\": null}, {\"name\": \"Детский сад № 459\", \"street\": null}]}, \"bad\": 7, \"positive\": 8.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"СУНЦ УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}, {\"name\": \"Специализированный учебно-научный центр УрФУ\", \"street\": \"улица Данилы Зверева\", \"bad\": \"Волховская улица, Уральский, Пионерский, Кировский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620037, Russia\"}]}, \"index\": 333, \"rating\": 60}",
						"{\"good\": 187, \"park\": 1, \"cigarettes\": 3, \"alcohol\": 32, \"educational\": 22, \"transport\": {\"len\": 18, \"data\": [{\"name\": \"Джунгли\", \"street\": null}, {\"name\": \"Rio\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Оксфордский языковой центр\", \"street\": null}, {\"name\": \"Веселая радуга\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Детский сад № 38\", \"street\": null}, {\"name\": \"Школа № 16\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад № 23 «Маленькая страна»\", \"street\": null}, {\"name\": \"Детский сад № 43\", \"street\": null}, {\"name\": \"Детский сад № 52\", \"street\": null}, {\"name\": \"Детский сад № 44\", \"street\": null}, {\"name\": \"Детский сад № 35\", \"street\": null}, {\"name\": \"Детский сад № 43 «Академия детства»\", \"street\": null}, {\"name\": \"Школа № 23\", \"street\": null}, {\"name\": \"Школа № 79\", \"street\": \"проспект Академика Сахарова\"}, {\"name\": \"Детский сад № 151\", \"street\": null}]}, \"bad\": 46, \"positive\": 47.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Rio\", \"street\": null, \"bad\": \"Красное&Белое, 135, улица Краснолесья, 5-й квартал, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}, {\"name\": \"Академика\", \"street\": null, \"bad\": \"Пан Разливан, 147, улица Краснолесья, 5-й квартал, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}, {\"name\": \"Детский сад № 38\", \"street\": null, \"bad\": \"Молоко, улица Вильгельма де Геннина, 2-й квартал, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}, {\"name\": \"Школа № 16\", \"street\": null, \"bad\": \"Молоко, улица Вильгельма де Геннина, 2-й квартал, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}, {\"name\": \"Детский сад № 43\", \"street\": null, \"bad\": \"МагBeer, 42, улица Вильгельма де Геннина, 5-й квартал, Академический район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620105, Russia\"}]}, \"index\": 334, \"rating\": 60}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 335, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 336, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 337, \"rating\": 40}",
						"{\"good\": 11, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 338, \"rating\": 100}",
						"{\"good\": 12, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Школа № 53\", \"street\": null}, {\"name\": \"Детский сад №567\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 0, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 339, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"KIBERone\", \"street\": \"улица Конструкторов\"}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 340, \"rating\": 100}",
						"{\"good\": 43, \"park\": 6, \"cigarettes\": 2, \"alcohol\": 7, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 14, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 341, \"rating\": 100}",
						"{\"good\": 64, \"park\": 8, \"cigarettes\": 8, \"alcohol\": 27, \"educational\": 21, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"Екатеринбургская академия современного искусства (ЕАСИ)\", \"street\": \"улица Красных Партизан\"}, {\"name\": \"Школа №115\", \"street\": \"Фестивальная улица\"}, {\"name\": \"Гимназия № 144\", \"street\": null}, {\"name\": \"Школа № 22\", \"street\": null}, {\"name\": \"Школа \\\"Источник\\\"\", \"street\": null}, {\"name\": \"Детский сад № 371\", \"street\": null}, {\"name\": \"Детский сад № 399\", \"street\": null}, {\"name\": \"Детский сад № 318\", \"street\": null}, {\"name\": \"Детский сад № 432\", \"street\": null}, {\"name\": \"Детский сад № 158\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Детский сад № 355\", \"street\": null}, {\"name\": \"Детский сад № 370\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 35, \"positive\": -3.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Школа №192\", \"street\": \"улица Машиностроителей\", \"bad\": \"Live beer, 6, улица Машиностроителей, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620143, Russia\"}, {\"name\": \"Детский сад № 318\", \"street\": null, \"bad\": \"Фауст, улица 40-летия Октября, Уралмаш, Орджоникидзевский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620088, Russia\"}]}, \"index\": 342, \"rating\": 0}",
						"{\"good\": 45, \"park\": 2, \"cigarettes\": 4, \"alcohol\": 20, \"educational\": 23, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"ДЮСШ\", \"street\": null}, {\"name\": \"Дом радости\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"Talisman\", \"street\": null}, {\"name\": \"KIBERone\", \"street\": \"улица Татищева\"}, {\"name\": \"Детский сад № 368\", \"street\": null}, {\"name\": \"Детский сад № 123\", \"street\": null}, {\"name\": \"Детский сад № 5\", \"street\": null}, {\"name\": \"Лицей №12\", \"street\": null}, {\"name\": \"Школа № 29\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад компенсирующего вида № 466\", \"street\": null}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 34, \"positive\": -11.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Talisman\", \"street\": null, \"bad\": \"Budo, 22, Opalikhinskaya Street, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}, {\"name\": \"Уральский государственный юридический университет\", \"street\": null, \"bad\": \"Столовая, улица Единого Фронта, Адмиральский, Заречный, Верх-Исетский район, Yekaterinburg, Yekaterinburg Municipality, Sverdlovsk Oblast, Ural Federal District, 620034, Russia\"}]}, \"index\": 343, \"rating\": 0}"
					],
					geo:[56.8519, 60.6122]
				},
				'Тула':{
					send:{
						"points": [
							[
								54.19386815222695,
								37.4987173621028
							],
							[
								54.215954398298,
								37.74936440789106
							],
							[
								54.16579946430091,
								37.75450402587995
							],
							[
								54.1485823364376,
								37.51508964283389
							],
							[
								54.228233343754816,
								37.437536096552314
							],
							[
								54.1546478809787,
								37.54886668862614
							],
							[
								54.24547969995566,
								37.596648020848846
							],
							[
								54.25153757911236,
								37.6305368300937
							],
							[
								54.24973811718174,
								37.44666863568531
							],
							[
								54.14293475058152,
								37.64195616678122
							],
							[
								54.22167686596812,
								37.62217876535873
							],
							[
								54.19966534270576,
								37.45215235718124
							],
							[
								54.14629672164144,
								37.549760398048655
							],
							[
								54.22184993599658,
								37.70270917731245
							],
							[
								54.137147399619174,
								37.768927299363305
							],
							[
								54.13896842800056,
								37.493185095066224
							],
							[
								54.24318466892064,
								37.63141725666027
							],
							[
								54.22117030452853,
								37.461287295549724
							],
							[
								54.225982988944985,
								37.47225224594761
							],
							[
								54.23586969326864,
								37.574660188218765
							],
							[
								54.16528137128277,
								37.513288825446686
							],
							[
								54.160473927692784,
								37.50233091514817
							],
							[
								54.215814424741275,
								37.66881269212144
							],
							[
								54.130619405219704,
								37.49408887739266
							],
							[
								54.21349336884467,
								37.70357546711993
							],
							[
								54.14880149257309,
								37.59540845926146
							],
							[
								54.2062168788338,
								37.64681029228651
							],
							[
								54.23252429140143,
								37.66706664829306
							],
							[
								54.227518903908354,
								37.575550761816295
							],
							[
								54.191984491961676,
								37.694301463644585
							],
							[
								54.22772504414045,
								37.656059767961615
							],
							[
								54.18718873436936,
								37.683299371899615
							],
							[
								54.1538687605375,
								37.76722194931726
							],
							[
								54.1978624270275,
								37.64768674019286
							],
							[
								54.24582262341473,
								37.757819185065934
							],
							[
								54.24102927648248,
								37.74679017272357
							],
							[
								54.24691848114927,
								37.70010831871121
							],
							[
								54.245227909874856,
								37.51614707450848
							],
							[
								54.251306228628074,
								37.55000085571298
							],
							[
								54.21717875818757,
								37.772267571317954
							],
							[
								54.23868884029222,
								37.78159236593054
							],
							[
								54.25171535770518,
								37.71112922152433
							],
							[
								54.23560661435914,
								37.49419265308792
							],
							[
								54.227877616156185,
								37.73662504619209
							],
							[
								54.223083460913664,
								37.72560501694074
							],
							[
								54.17510936398966,
								37.615597257883664
							],
							[
								54.17334772932347,
								37.432080627152914
							],
							[
								54.20141722170296,
								37.635814342635875
							],
							[
								54.17943767360628,
								37.465841231364365
							],
							[
								54.14540496611272,
								37.68764218318514
							],
							[
								54.14958564962372,
								37.45762353302616
							],
							[
								54.17170765828641,
								37.70790195174185
							],
							[
								54.16675568816841,
								37.61647891182656
							],
							[
								54.1447749259806,
								37.44668113058354
							],
							[
								54.16691364603991,
								37.696902255865716
							],
							[
								54.17279792339747,
								37.65031407546314
							],
							[
								54.17109057211965,
								37.46675097609589
							],
							[
								54.13704764316546,
								37.6885097508657
							],
							[
								54.185762068639306,
								37.579998528269726
							],
							[
								54.14306754262251,
								37.72235252997417
							],
							[
								54.19003863535752,
								37.43024773655698
							],
							[
								54.156087301014416,
								37.652063960515605
							],
							[
								54.20726913084398,
								37.58920477190996
							],
							[
								54.15128996005684,
								37.641079768095416
							],
							[
								54.15715458416471,
								37.59452323296435
							],
							[
								54.17759544928488,
								37.661305678665975
							],
							[
								54.20348556867782,
								37.52065226506454
							],
							[
								54.19867715124864,
								37.509683064756764
							],
							[
								54.13416060641541,
								37.48223805331558
							],
							[
								54.2249916944914,
								37.5298278261479
							],
							[
								54.19087779104386,
								37.75193569058779
							],
							[
								54.17489451692176,
								37.535215123620866
							],
							[
								54.19688875518001,
								37.785848246691245
							],
							[
								54.20120671324865,
								37.55536881183285
							],
							[
								54.16701807891044,
								37.777381581176
							],
							[
								54.19640082007444,
								37.54439302174167
							],
							[
								54.162229156992,
								37.7663687855984
							],
							[
								54.20928973564893,
								37.474070967257425
							],
							[
								54.18852816305768,
								37.786698446464285
							],
							[
								54.215373890702345,
								37.50787811830901
							],
							[
								54.18129390951687,
								37.729911828389895
							],
							[
								54.1399636265448,
								37.43574221651589
							],
							[
								54.18551988293352,
								37.499621267619695
							],
							[
								54.20759572085909,
								37.75022182992518
							],
							[
								54.18071069205255,
								37.48866100950879
							],
							[
								54.202803309719535,
								37.73920421086891
							],
							[
								54.172935425708566,
								37.730772203286634
							],
							[
								54.15338842169281,
								37.526047150583935
							],
							[
								54.237128138810725,
								37.597534674479625
							],
							[
								54.23304796580862,
								37.44849793946831
							],
							[
								54.15945183441902,
								37.55983271974355
							],
							[
								54.23232381496099,
								37.586540966283785
							],
							[
								54.12959383428432,
								37.55154679449768
							],
							[
								54.129782198631325,
								37.63185544039328
							],
							[
								54.22061231191169,
								37.67981914402537
							],
							[
								54.20852215647129,
								37.61206727271965
							],
							[
								54.128786435865734,
								37.769779486062916
							],
							[
								54.20447782887771,
								37.46310991310115
							],
							[
								54.234831565172556,
								37.63229734651291
							],
							[
								54.14377567160735,
								37.504135624616744
							],
							[
								54.23079509248874,
								37.483220698169184
							],
							[
								54.23002977768727,
								37.621297049356386
							],
							[
								54.15029632881201,
								37.779083646341576
							],
							[
								54.226645662421475,
								37.71372416978364
							],
							[
								54.242956792593176,
								37.55089637022674
							],
							[
								54.15110028661215,
								37.56072447942639
							],
							[
								54.21828871154168,
								37.7145884908687
							],
							[
								54.24902597223906,
								37.584763397828546
							],
							[
								54.24492271752968,
								37.43570289649633
							],
							[
								54.13542625884998,
								37.505037463275535
							],
							[
								54.13564755845915,
								37.58532465026949
							],
							[
								54.14044821131408,
								37.59629334782264
							],
							[
								54.237322947192716,
								37.67807703295508
							],
							[
								54.21916792151127,
								37.57644099505214
							],
							[
								54.1347086846927,
								37.723213554369906
							],
							[
								54.21436281063248,
								37.56545625070166
							],
							[
								54.21101594678087,
								37.657809741828345
							],
							[
								54.14071942765374,
								37.75706941882214
							],
							[
								54.17008823462555,
								37.52425022798193
							],
							[
								54.202661109722165,
								37.658684227112914
							],
							[
								54.196779658516945,
								37.70530705328364
							],
							[
								54.25061537346029,
								37.768851704515065
							],
							[
								54.25003768191696,
								37.527129542754935
							],
							[
								54.22196938276688,
								37.78329569535965
							],
							[
								54.24443337012658,
								37.65430845508795
							],
							[
								54.24041755375499,
								37.50516811157683
							],
							[
								54.23267117646444,
								37.74764857947825
							],
							[
								54.18221271738918,
								37.59186552572681
							],
							[
								54.178160591546266,
								37.44302730383641
							],
							[
								54.188263295906786,
								37.62570226109372
							],
							[
								54.184248412606166,
								37.47679644627698
							],
							[
								54.150198797281845,
								37.6986344622308
							],
							[
								54.15840182197589,
								37.61736022921526
							],
							[
								54.15439579667656,
								37.46856942471405
							],
							[
								54.17650107971298,
								37.71890514229867
							],
							[
								54.15360194958623,
								37.606382598723556
							],
							[
								54.17990942436742,
								37.626582293921636
							],
							[
								54.17590092151487,
								37.47770424595754
							],
							[
								54.141841088524394,
								37.69950006944614
							],
							[
								54.17260695098134,
								37.56991209422197
							],
							[
								54.14785883361385,
								37.733351356577316
							],
							[
								54.19891718470195,
								37.59009202868033
							],
							[
								54.19485227793263,
								37.441198298624435
							],
							[
								54.16088405482209,
								37.66305164469351
							],
							[
								54.194113819641295,
								37.5791096545355
							],
							[
								54.164255205423906,
								37.57080224250121
							],
							[
								54.18239238654292,
								37.672300777192355
							],
							[
								54.132253609609094,
								37.677522921198175
							],
							[
								54.20829340371405,
								37.53162496389533
							],
							[
								54.229799720984616,
								37.54080793279331
							],
							[
								54.19566884115973,
								37.76295286839947
							],
							[
								54.17970021737169,
								37.54618351322992
							],
							[
								54.20601202230147,
								37.56634810033726
							],
							[
								54.17180640655305,
								37.78839787112101
							],
							[
								54.214101062219534,
								37.4850355205229
							],
							[
								54.13161712568405,
								37.43665674172108
							],
							[
								54.22018308413019,
								37.51885122160978
							],
							[
								54.186086146894965,
								37.74092201086869
							],
							[
								54.19032849335825,
								37.51058502115984
							],
							[
								54.21238753728332,
								37.76124294979059
							],
							[
								54.177727278987156,
								37.741780418497136
							],
							[
								54.145038229989815,
								37.52694509785632
							],
							[
								54.14023253403945,
								37.51598953647484
							],
							[
								54.241931874654725,
								37.60853188726969
							],
							[
								54.21988836655271,
								37.43845217152543
							],
							[
								54.16654431703201,
								37.536111807243
							],
							[
								54.12854037477003,
								37.60903039475534
							],
							[
								54.246207569132075,
								37.45855075718097
							],
							[
								54.212256705366784,
								37.68068969999148
							],
							[
								54.13457935180418,
								37.6428322310559
							],
							[
								54.24139313847149,
								37.44758346232042
							],
							[
								54.14274854895197,
								37.5616158989299
							],
							[
								54.21332376157607,
								37.62306014434095
							],
							[
								54.21154319627911,
								37.43936789672862
							],
							[
								54.13357382161211,
								37.78078441159526
							],
							[
								54.13794537262515,
								37.55065376660767
							],
							[
								54.23963276292021,
								37.643301148135826
							],
							[
								54.23376540560662,
								37.68996017684281
							],
							[
								54.150857302967054,
								37.480425567791265
							],
							[
								54.155083889402384,
								37.79009599716439
							],
							[
								54.156931948970154,
								37.514189405889844
							],
							[
								54.24776403533374,
								37.56188544165568
							],
							[
								54.21763645873949,
								37.47316178026445
							],
							[
								54.209931568360275,
								37.715452481435314
							],
							[
								54.14524828068326,
								37.60726553419358
							],
							[
								54.207459202769606,
								37.6696852134261
							],
							[
								54.21812477842449,
								37.634056516847
							],
							[
								54.223972446327785,
								37.58742924090578
							],
							[
								54.205136609566566,
								37.70444142571381
							],
							[
								54.22416945440337,
								37.66793983714078
							],
							[
								54.18362773408955,
								37.69516872566055
							],
							[
								54.139499590542364,
								37.73421041783365
							],
							[
								54.19430608088354,
								37.65955837821999
							],
							[
								54.14550817462817,
								37.76807478717679
							],
							[
								54.18950778361627,
								37.648562853230125
							],
							[
								54.2374641410333,
								37.75867561765425
							],
							[
								54.24168921307915,
								37.52802931438427
							],
							[
								54.23687982808981,
								37.517048801394004
							],
							[
								54.22910546564776,
								37.7595317225127
							],
							[
								54.24815488486471,
								37.72301697371005
							],
							[
								54.24335898585779,
								37.711994535301
							],
							[
								54.24923338598757,
								37.665319268231656
							],
							[
								54.24748834910668,
								37.481404488461926
							],
							[
								54.219519706190376,
								37.73748509662555
							],
							[
								54.16981446122293,
								37.44394128318426
							],
							[
								54.18701472323233,
								37.6028474844231
							],
							[
								54.16500198943662,
								37.432996548173215
							],
							[
								54.193063155488254,
								37.63669275180646
							],
							[
								54.19131920558632,
								37.45306508988673
							],
							[
								54.157323852296514,
								37.67491334473816
							],
							[
								54.16320110894161,
								37.62834135159633
							],
							[
								54.141238366836575,
								37.458534178966346
							],
							[
								54.163349943698314,
								37.708766257107804
							],
							[
								54.16755323930849,
								37.47861169930499
							],
							[
								54.133483190654594,
								37.700365346268526
							],
							[
								54.18470889784357,
								37.63757082541716
							],
							[
								54.16274327969172,
								37.46766037381309
							],
							[
								54.12869013128104,
								37.689376987462616
							],
							[
								54.17741012637185,
								37.58088706261409
							],
							[
								54.15499203911274,
								37.70963023239513
							],
							[
								54.203719963912505,
								37.6010779011205
							],
							[
								54.18169327808175,
								37.431164356680696
							],
							[
								54.14773170489807,
								37.65293840207664
							],
							[
								54.17403639887893,
								37.67317196570053
							],
							[
								54.16905799319342,
								37.581775257762466
							],
							[
								54.169239847234145,
								37.66217882838667
							],
							[
								54.1393759193049,
								37.65381250991524
							],
							[
								54.19513652252698,
								37.52155227099833
							],
							[
								54.221450284704396,
								37.5417047187661
							],
							[
								54.18730920607541,
								37.763807337421156
							],
							[
								54.21664264544942,
								37.53072656667545
							],
							[
								54.182518539377256,
								37.75279212959141
							],
							[
								54.1867872845652,
								37.52245193333165
							],
							[
								54.20881912319339,
								37.77312072137785
							],
							[
								54.19285612002457,
								37.55626227533022
							],
							[
								54.15865729867651,
								37.77823277634071
							],
							[
								54.20575375785039,
								37.485942411937685
							],
							[
								54.20094282002722,
								37.47497980712498
							],
							[
								54.18016738006367,
								37.787548321212206
							],
							[
								54.13642803398937,
								37.44759371683106
							],
							[
								54.22725930769069,
								37.49509828640667
							],
							[
								54.19321670651146,
								37.71717947176982
							],
							[
								54.177171422177224,
								37.50052482816826
							],
							[
								54.19923685165608,
								37.751078924094905
							],
							[
								54.16936822055553,
								37.74263849812826
							],
							[
								54.16457675155199,
								37.73163224949151
							],
							[
								54.149843345902546,
								37.53790414828516
							],
							[
								54.228776384279726,
								37.59842098912832
							],
							[
								54.22470259954683,
								37.44941206732883
							],
							[
								54.17134962919821,
								37.54707824641169
							],
							[
								54.25102141871261,
								37.46952155706715
							],
							[
								54.21705361671033,
								37.69169768766757
							],
							[
								54.250283821184105,
								37.60764719566318
							],
							[
								54.14169351989564,
								37.61912185509888
							],
							[
								54.14755114351715,
								37.57258152018869
							],
							[
								54.22042443671683,
								37.59930696498887
							],
							[
								54.21635704003988,
								37.450325846101535
							],
							[
								54.238562492503455,
								37.700975603297984
							],
							[
								54.22647826822239,
								37.63317709984428
							],
							[
								54.155665904654654,
								37.49137649621899
							],
							[
								54.22244817388365,
								37.484128282666084
							],
							[
								54.23941401916008,
								37.56277865588303
							],
							[
								54.141935169672124,
								37.7799341913645
							],
							[
								54.16173842335617,
								37.52514886069103
							],
							[
								54.234607162808196,
								37.551791542415344
							],
							[
								54.13188254213009,
								37.516889087008664
							],
							[
								54.21472593416962,
								37.72646703812075
							],
							[
								54.132094740742296,
								37.59717789884068
							],
							[
								54.18842251605053,
								37.706172350018804
							],
							[
								54.22292520621366,
								37.64505639109998
							],
							[
								54.210816746431576,
								37.577330888121
							],
							[
								54.13114015854271,
								37.73506915114903
							],
							[
								54.22896772597185,
								37.67894825507679
							],
							[
								54.199103788842905,
								37.67055740124567
							],
							[
								54.15264953354083,
								37.744353674148805
							],
							[
								54.242256509057285,
								37.769706161574675
							],
							[
								54.250476422444734,
								37.688221336104
							],
							[
								54.24649801352599,
								37.539013332200376
							],
							[
								54.2456779752199,
								37.67720547746936
							],
							[
								54.233897451474355,
								37.77056029160346
							],
							[
								54.252300646581716,
								37.49238034779199
							],
							[
								54.22431288361807,
								37.74850665780471
							],
							[
								54.178661815824825,
								37.60373176924678
							],
							[
								54.174626356212286,
								37.454889510623985
							],
							[
								54.173860196927244,
								37.59275176639021
							],
							[
								54.20016924568036,
								37.61295027480491
							],
							[
								54.19613130233934,
								37.464020700065426
							],
							[
								54.162119043775924,
								37.68590605381605
							],
							[
								54.15004776576675,
								37.618241210242
							],
							[
								54.14604812342834,
								37.46947812899665
							],
							[
								54.16814298034467,
								37.71976748310774
							],
							[
								54.17635444912346,
								37.63844856365978
							],
							[
								54.172362620403305,
								37.489566517133554
							],
							[
								54.13827566136888,
								37.7113571934884
							],
							[
								54.171555361927524,
								37.62746199069183
							],
							[
								54.184505335175245,
								37.55715539767511
							],
							[
								54.15978469080353,
								37.72062949453117
							],
							[
								54.190565046765535,
								37.5909789465547
							],
							[
								54.18650653056749,
								37.442112975716206
							],
							[
								54.152528072403435,
								37.663924127776895
							],
							[
								54.160705669458395,
								37.58266311390867
							],
							[
								54.15665605877518,
								37.433912119940985
							],
							[
								54.17883236143148,
								37.68416859783973
							],
							[
								54.15590326948437,
								37.57169205109212
							],
							[
								54.14417190033299,
								37.66479627782735
							],
							[
								54.19994396963946,
								37.532523018003815
							],
							[
								54.22625733962717,
								37.552686372474696
							],
							[
								54.19209927827774,
								37.77482604283753
							],
							[
								54.13289089434425,
								37.45944447780653
							],
							[
								54.19159434357975,
								37.53342072919696
							],
							[
								54.21360936538953,
								37.78414687132527
							],
							[
								54.197661041816566,
								37.56723960931245
							],
							[
								54.16344524288089,
								37.78924709637651
							],
							[
								54.21056411500888,
								37.49690851537523
							],
							[
								54.23206985935981,
								37.50607179235867
							],
							[
								54.198010304669005,
								37.728190091768404
							],
							[
								54.18197964383104,
								37.5114866332781
							],
							[
								54.20402828501399,
								37.762098072585005
							],
							[
								54.17415909701131,
								37.75364824129304
							],
							[
								54.13668784860162,
								37.527842702703744
							],
							[
								54.16299885028241,
								37.547972638145424
							],
							[
								54.23357973456451,
								37.60941624058511
							],
							[
								54.158193926574164,
								37.53700814873267
							],
							[
								54.12833727788259,
								37.5287399653216
							],
							[
								54.237862007918984,
								37.459463285174955
							],
							[
								54.14649203275036,
								37.630099066575724
							],
							[
								54.134396621793,
								37.5625069784483
							],
							[
								54.208011287641604,
								37.45123927598589
							],
							[
								54.2252274012677,
								37.61030025580298
							],
							[
								54.20319783328781,
								37.44028327236175
							],
							[
								54.147317261263645,
								37.49228096807391
							],
							[
								54.2312790810783,
								37.644178937436095
							],
							[
								54.14250904954039,
								37.48133198332502
							],
							[
								54.22951625293321,
								37.460375464564784
							],
							[
								54.24422028923796,
								37.57376927406478
							],
							[
								54.22540960748848,
								37.69082909839926
							],
							[
								54.23020631066772,
								37.70184255610173
							],
							[
								54.130846322917996,
								37.57435944067401
							],
							[
								54.16882277031224,
								37.50142804394547
							],
							[
								54.21457113868067,
								37.645933509319484
							],
							[
								54.136894422292954,
								37.60814813280675
							],
							[
								54.20390090669169,
								37.68155992316564
							],
							[
								54.2097710961332,
								37.63493559771342
							],
							[
								54.21562088483737,
								37.58831717604978
							],
							[
								54.13593008869118,
								37.74606754042916
							],
							[
								54.2360793037324,
								37.65518427899648
							],
							[
								54.201574233231966,
								37.716316141672706
							],
							[
								54.195544916241,
								37.68242981373827
							],
							[
								54.18595086061957,
								37.660432195340675
							],
							[
								54.157439641601115,
								37.75535948353918
							],
							[
								54.24938718331751,
								37.745931437352496
							],
							[
								54.233340550485984,
								37.528928742116356
							],
							[
								54.22553820106618,
								37.77141409478885
							],
							[
								54.22074659761285,
								37.760387499828965
							],
							[
								54.247048279730606,
								37.780740212093505
							],
							[
								54.23979793661586,
								37.72387998492441
							],
							[
								54.243953727440754,
								37.49328667361571
							],
							[
								54.23914181768104,
								37.482312766833935
							],
							[
								54.23144079518063,
								37.72474266593827
							],
							[
								54.183462849085096,
								37.614715267194136
							],
							[
								54.16146813995151,
								37.44485491395883
							],
							[
								54.18778458379751,
								37.464931139420315
							],
							[
								54.153762099767846,
								37.68677428423173
							],
							[
								54.204970464865575,
								37.62394118649578
							],
							[
								54.18297287663717,
								37.453977474301354
							],
							[
								54.1489672940877,
								37.67578353564781
							],
							[
								54.154846665764346,
								37.62922037682705
							],
							[
								54.153121628086026,
								37.445768196359
							],
							[
								54.17527078533072,
								37.69603565633777
							],
							[
								54.18115294895473,
								37.64943863158977
							],
							[
								54.159205366341155,
								37.479518806517056
							],
							[
								54.15142621144447,
								37.72149117675724
							],
							[
								54.18930986953203,
								37.56813077782195
							],
							[
								54.146633944884606,
								37.71049387779248
							],
							[
								54.19536743937973,
								37.601962861778745
							],
							[
								54.15964497987545,
								37.64020303480745
							],
							[
								54.165507485734274,
								37.59363766873829
							],
							[
								54.165680220678524,
								37.67404282148575
							],
							[
								54.13581553896562,
								37.66566809503503
							],
							[
								54.13101994458974,
								37.654686284222
							],
							[
								54.20702561714801,
								37.50878076387216
							],
							[
								54.21310065555657,
								37.542601162117855
							],
							[
								54.178949380116016,
								37.764661479836974
							],
							[
								54.13770026030134,
								37.470386486858644
							],
							[
								54.183244525889116,
								37.534318097670706
							],
							[
								54.20524915607562,
								37.784997721707
							],
							[
								54.17843785514666,
								37.52335125226079
							],
							[
								54.20045929643845,
								37.77397354515548
							],
							[
								54.20475083389518,
								37.543497263044486
							],
							[
								54.17058936363654,
								37.76551529583383
							],
							[
								54.19740626113017,
								37.48684895710844
							],
							[
								54.2237219715576,
								37.50697512787026
							],
							[
								54.189652202621964,
								37.72905112461323
							],
							[
								54.12808095246649,
								37.44850595529998
							],
							[
								54.21891180778928,
								37.4960035737699
							],
							[
								54.18485898855352,
								37.71804247191558
							],
							[
								54.189058572412854,
								37.487755156232915
							],
							[
								54.21116160392656,
								37.73834481812175
							],
							[
								54.161008971955106,
								37.74349624994968
							],
							[
								54.141492575371615,
								37.538799806095696
							],
							[
								54.16780319201811,
								37.55894061968708
							],
							[
								54.24067499038281,
								37.58565235198952
							],
							[
								54.236578127531715,
								37.4366196716093
							],
							[
								54.246735021689794,
								37.61953260551942
							],
							[
								54.24267546928533,
								37.470432134547806
							],
							[
								54.138137210254435,
								37.630977421033975
							],
							[
								54.133339084717264,
								37.620002163977894
							],
							[
								54.13919882787683,
								37.57347064998477
							],
							[
								54.13314161533581,
								37.53969512235928
							],
							[
								54.23500242064506,
								37.71285951799091
							],
							[
								54.13235903711639,
								37.75792389681927
							],
							[
								54.212824163058755,
								37.462198778328855
							],
							[
								54.238382496379245,
								37.62041499614097
							],
							[
								54.23432932591152,
								37.471342364108324
							],
							[
								54.15212489467306,
								37.503233441973094
							],
							[
								54.23106380941594,
								37.56367152866962
							],
							[
								54.216874875118506,
								37.61118393311674
							],
							[
								54.212072296476336,
								37.60019260225504
							],
							[
								54.20869743362674,
								37.69256594483791
							],
							[
								54.20636821530313,
								37.72732872966708
							],
							[
								54.21937059170514,
								37.65693492217504
							],
							[
								54.1440004517367,
								37.58443780996877
							],
							[
								54.17363060302117,
								37.512387901308216
							],
							[
								54.20034105859231,
								37.69343387010031
							],
							[
								54.22271340645535,
								37.564564060210785
							],
							[
								54.24087893538098,
								37.66619312538713
							],
							[
								54.149079629267014,
								37.75621461445763
							],
							[
								54.190748183315826,
								37.67142925577088
							],
							[
								54.14428990566784,
								37.74521077091292
							],
							[
								54.242121010710186,
								37.68909092280788
							],
							[
								54.23814896404316,
								37.53991080400348
							],
							[
								54.23032920785271,
								37.782444193623654
							],
							[
								54.24459285777509,
								37.734903957759364
							],
							[
								54.248765054389274,
								37.50426408532723
							],
							[
								54.24798625138506,
								37.64242302300689
							],
							[
								54.23623533346931,
								37.735764666632875
							],
							[
								54.170308717511574,
								37.60461571644283
							],
							[
								54.1662796446657,
								37.455801199053305
							],
							[
								54.196616976190995,
								37.624821892015866
							],
							[
								54.19259571222828,
								37.47588830006546
							],
							[
								54.15855631657199,
								37.69776852443367
							],
							[
								54.191816143100134,
								37.613832939565455
							],
							[
								54.16195542864722,
								37.60549932620416
							],
							[
								54.15793274235149,
								37.45671253978789
							],
							[
								54.18006518252209,
								37.707037316108526
							],
							[
								54.16799980968254,
								37.63932596672603
							],
							[
								54.16401435781927,
								37.49047167930455
							],
							[
								54.12991718892061,
								37.712220179671256
							],
							[
								54.18095850580219,
								37.56902160606032
							],
							[
								54.15621788740207,
								37.732491967192466
							],
							[
								54.17615435905498,
								37.55804817906246
							],
							[
								54.20246537902349,
								37.578220441217326
							],
							[
								54.164442707299145,
								37.6511891850414
							],
							[
								54.15235315552132,
								37.58355063124627
							],
							[
								54.148309937693185,
								37.434827342655524
							],
							[
								54.170475797782075,
								37.685037491748616
							],
							[
								54.1406105464069,
								37.67665339440456
							],
							[
								54.2118344226636,
								37.51975191533391
							],
							[
								54.12935220764972,
								37.47129449849764
							],
							[
								54.21790732340414,
								37.55358086060042
							],
							[
								54.183739069066114,
								37.77567821461068
							],
							[
								54.188050614448535,
								37.545288438405
							],
							[
								54.20955711449326,
								37.55447500698801
							],
							[
								54.175378669158675,
								37.776530060661415
							],
							[
								54.202216229703424,
								37.49781311142043
							],
							[
								54.2285315527236,
								37.51795018369544
							],
							[
								54.194444823924066,
								37.74006327505523
							]
						],
						"dist": 1000
					},
					res:[
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 0, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": -2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 1, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 2, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 3, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 4, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 5, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 6, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 7, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 8, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 9, \"rating\": 40}",
						"{\"good\": 45, \"park\": 2, \"cigarettes\": 4, \"alcohol\": 6, \"educational\": 19, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"Центр образования 2 МБОУ\", \"street\": null}, {\"name\": \"Центр образования 7\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}, {\"name\": \"Земляничка\", \"street\": null}, {\"name\": \"Мальвина\", \"street\": null}, {\"name\": \"Детский сад 24\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"Демидовская улица\"}, {\"name\": \"Конфетка дошкольное отделение 43\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}]}, \"bad\": 11, \"positive\": 11.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 10, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 11, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 12, \"rating\": 40}",
						"{\"good\": 9, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 13, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 14, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 15, \"rating\": 40}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Центр образования 5\", \"street\": \"18-й Октябрьский проезд\"}]}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 16, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 17, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 18, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 19, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 20, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 21, \"rating\": 40}",
						"{\"good\": 23, \"park\": 3, \"cigarettes\": 3, \"alcohol\": 8, \"educational\": 11, \"transport\": {\"len\": 7, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Школа №60\", \"street\": \"улица Баженова\"}, {\"name\": \"Детский сад № 93\", \"street\": null}, {\"name\": \"Детский сад № 56\", \"street\": \"улица Шухова\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 118\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 8, \"positive\": 3.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null, \"bad\": \"Драфт, 13, улица Хворостухина, Глушанки, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300010, Russia\"}]}, \"index\": 22, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 23, \"rating\": 40}",
						"{\"good\": 17, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 5, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 6, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 24, \"rating\": 100}",
						"{\"good\": 26, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 9, \"educational\": 7, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад № 48\", \"street\": \"проспект Ленина\"}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": \"МБОУ ЦО N° 15\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": null}]}, \"bad\": 11, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 25, \"rating\": 100}",
						"{\"good\": 51, \"park\": 8, \"cigarettes\": 3, \"alcohol\": 12, \"educational\": 12, \"transport\": {\"len\": 4, \"data\": [{\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": null, \"street\": \"улица Глинки\"}, {\"name\": \"Детский сад № 93\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 17, \"positive\": 8.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": null, \"bad\": \"Автосуши Автопицца, 54, Епифанская улица, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"улица Чапаева, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}]}, \"index\": 26, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 27, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 28, \"rating\": 40}",
						"{\"good\": 73, \"park\": 5, \"cigarettes\": 0, \"alcohol\": 5, \"educational\": 14, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Гимназия №1\", \"street\": \"Приупская улица\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (школа)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Металлургов\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования – гимназия №1 (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад №130\", \"street\": null}]}, \"bad\": 7, \"positive\": 29.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 29, \"rating\": 100}",
						"{\"good\": 8, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}]}, \"bad\": 0, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 30, \"rating\": 100}",
						"{\"good\": 93, \"park\": 5, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 19, \"transport\": {\"len\": 13, \"data\": [{\"name\": \"Тульский государственный машиностроительный колледж имени Никиты Демидова\", \"street\": null}, {\"name\": \"Гимназия №1\", \"street\": \"Приупская улица\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (школа)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Металлургов\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №17 им. Героя Советского Союза И. П. Потехина\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования – гимназия №1 (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад №130\", \"street\": null}, {\"name\": \"Центр образования №24 (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}]}, \"bad\": 9, \"positive\": 37.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 31, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 32, \"rating\": 40}",
						"{\"good\": 60, \"park\": 9, \"cigarettes\": 4, \"alcohol\": 11, \"educational\": 14, \"transport\": {\"len\": 6, \"data\": [{\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": null, \"street\": \"улица Глинки\"}, {\"name\": \"Детский сад № 73\", \"street\": \"улица Серова\"}, {\"name\": \"Тульское суворовское военное училище\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 23, \"positive\": 7.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": null, \"bad\": \"Автосуши Автопицца, 54, Епифанская улица, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"улица Чапаева, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}]}, \"index\": 33, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 34, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 35, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 36, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 37, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 38, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 39, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 40, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 41, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 42, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 43, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 44, \"rating\": 40}",
						"{\"good\": 43, \"park\": 5, \"cigarettes\": 1, \"alcohol\": 11, \"educational\": 5, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Школа 39\", \"street\": null}, {\"name\": \"Тульская Духовная Семинария\", \"street\": \"Староникитская улица\"}, {\"name\": \"Вишенка\", \"street\": \"улица Макса Смирнова\"}, {\"name\": \"Центр образования №39\", \"street\": null}, {\"name\": \"МБДОУ «ЦРР – Д/С № 2»\", \"street\": null}]}, \"bad\": 15, \"positive\": 6.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Центр образования №39\", \"street\": null, \"bad\": \"Овощи и фрукты, улица Тимирязева, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}]}, \"index\": 45, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 46, \"rating\": 40}",
						"{\"good\": 55, \"park\": 8, \"cigarettes\": 3, \"alcohol\": 8, \"educational\": 9, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Тульская Православная классическая гимназия\", \"street\": \"улица Дзержинского\"}, {\"name\": \"Banana School\", \"street\": null}, {\"name\": \"Центр образования 2\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 20, \"positive\": 7.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": null, \"bad\": \"Автосуши Автопицца, 54, Епифанская улица, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"улица Чапаева, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}]}, \"index\": 47, \"rating\": 60}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 48, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 49, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 50, \"rating\": 40}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}]}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 51, \"rating\": 100}",
						"{\"good\": 38, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 4, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Школа 39\", \"street\": null}, {\"name\": \"Вишенка\", \"street\": \"улица Макса Смирнова\"}, {\"name\": \"Центр образования №39\", \"street\": null}, {\"name\": \"МБДОУ «ЦРР – Д/С № 2»\", \"street\": null}]}, \"bad\": 10, \"positive\": 9.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Центр образования №39\", \"street\": null, \"bad\": \"Овощи и фрукты, улица Тимирязева, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}]}, \"index\": 52, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 53, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 54, \"rating\": 100}",
						"{\"good\": 18, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 8, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 6, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 55, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 56, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 57, \"rating\": 100}",
						"{\"good\": 44, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 10, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Школа 33\", \"street\": null}, {\"name\": \"Детский сад 71\", \"street\": null}, {\"name\": \"Детский сад 72\", \"street\": null}, {\"name\": \"Школа 57\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": \"улица Вересаева\"}, {\"name\": \"Школа № 17\", \"street\": \"улица Фрунзе\"}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}]}, \"bad\": 2, \"positive\": 20.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 58, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 59, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 60, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 61, \"rating\": 40}",
						"{\"good\": 26, \"park\": 5, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 9.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 62, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 63, \"rating\": 40}",
						"{\"good\": 44, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 14, \"educational\": 14, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Школа №36\", \"street\": null}, {\"name\": \"Magic Dance\", \"street\": \"улица Николая Руднева\"}, {\"name\": \"Детский сад № 48\", \"street\": \"проспект Ленина\"}, {\"name\": \"Детский сад №27\", \"street\": \"улица Станиславского\"}, {\"name\": \"Муниципальное бюджетное общеобразовательное учреждение \\\"Центр образования № 36\\\"\", \"street\": \"улица Мезенцева\"}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": \"МБОУ ЦО N° 15\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": null}]}, \"bad\": 21, \"positive\": 1.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №42\\\"\", \"street\": \"улица Николая Руднева\", \"bad\": \"Пивовар, 54, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300026, Russia\"}]}, \"index\": 64, \"rating\": 60}",
						"{\"good\": 8, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 65, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 66, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 67, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 68, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Хрущёвская средняя общеобразовательная школа им. А.И. Миронова\", \"street\": \"Центральная улица\"}]}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 69, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 70, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 71, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 72, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад (Центр образования №44)\", \"street\": null}, {\"name\": \"Центр образования №44 им. Маршала Советского Союза Г.К. Жукова\", \"street\": \"Одоевское шоссе\"}, {\"name\": \"Центр образования №4\", \"street\": \"улица Рогова\"}]}, \"bad\": 3, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 73, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 74, \"rating\": 100}",
						"{\"good\": 8, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад (Центр образования №44)\", \"street\": null}, {\"name\": \"Детский сад (Центр образования №43)\", \"street\": null}, {\"name\": \"Центр образования №44 им. Маршала Советского Союза Г.К. Жукова\", \"street\": \"Одоевское шоссе\"}]}, \"bad\": 5, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 75, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 76, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 77, \"rating\": 100}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 78, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 79, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 80, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 81, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 82, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 83, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 84, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 85, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 86, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 87, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 88, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 89, \"rating\": 40}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 90, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 91, \"rating\": 40}",
						"{\"good\": 7, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 92, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 93, \"rating\": 40}",
						"{\"good\": 23, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 8, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 6, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 94, \"rating\": 100}",
						"{\"good\": 60, \"park\": 3, \"cigarettes\": 9, \"alcohol\": 12, \"educational\": 18, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"Детский сад №84\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"Центр образования 2 МБОУ\", \"street\": null}, {\"name\": \"Banana School\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"Демидовская улица\"}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (школа)\", \"street\": null}, {\"name\": \"Школа-сад №1\", \"street\": null}, {\"name\": \"Центр образования 2\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\"\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}]}, \"bad\": 22, \"positive\": 8.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа-сад №1\", \"street\": null, \"bad\": \"Ствольная улица, Малые Гончары, Зареченский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300044, Russia\"}]}, \"index\": 95, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 96, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 97, \"rating\": 40}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 6, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Земляничка\", \"street\": null}, {\"name\": \"Центр образования 5\", \"street\": \"18-й Октябрьский проезд\"}, {\"name\": \"Мальвина\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}]}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 98, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 99, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 100, \"rating\": 40}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 6, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Земляничка\", \"street\": null}, {\"name\": \"Мальвина\", \"street\": null}, {\"name\": \"Детский сад 24\", \"street\": \"улица Пузакова\"}]}, \"bad\": 1, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 101, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 102, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 103, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 104, \"rating\": 100}",
						"{\"good\": 7, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 105, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 106, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 107, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 108, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 109, \"rating\": 40}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 110, \"rating\": 100}",
						"{\"good\": 8, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Центр образования 14\", \"street\": null}, {\"name\": \"Детский сад № 48\", \"street\": \"проспект Ленина\"}]}, \"bad\": 1, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 111, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 112, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 113, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 114, \"rating\": 100}",
						"{\"good\": 5, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 115, \"rating\": 100}",
						"{\"good\": 45, \"park\": 5, \"cigarettes\": 4, \"alcohol\": 11, \"educational\": 13, \"transport\": {\"len\": 5, \"data\": [{\"name\": null, \"street\": \"улица Глинки\"}, {\"name\": \"Детский сад № 93\", \"street\": null}, {\"name\": \"Детский сад № 56\", \"street\": \"улица Шухова\"}, {\"name\": \"Детский сад № 118\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 13, \"positive\": 9.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 116, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 117, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 118, \"rating\": 40}",
						"{\"good\": 65, \"park\": 5, \"cigarettes\": 3, \"alcohol\": 12, \"educational\": 22, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Тульский государственный машиностроительный колледж имени Никиты Демидова\", \"street\": null}, {\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": null, \"street\": \"улица Глинки\"}, {\"name\": \"Центр образования №24 (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования №24 (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад № 93\", \"street\": null}, {\"name\": \"Детский сад № 56\", \"street\": \"улица Шухова\"}, {\"name\": \"Детский сад № 118\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 13, \"positive\": 19.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 119, \"rating\": 100}",
						"{\"good\": 33, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 6, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №18\\\" (школа)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Металлургов\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Кутузова\"}]}, \"bad\": 3, \"positive\": 13.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 120, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 121, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 122, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 123, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 124, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 125, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 126, \"rating\": 40}",
						"{\"good\": 57, \"park\": 5, \"cigarettes\": 0, \"alcohol\": 6, \"educational\": 14, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Школа 33\", \"street\": null}, {\"name\": \"Центр образования 1\", \"street\": null}, {\"name\": \"Малышок\", \"street\": null}, {\"name\": \"Тульский областной центр образования\", \"street\": null}, {\"name\": \"Школа 58\", \"street\": null}, {\"name\": null, \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"ГОУ СПО ТО \\\"ТТЭК им. А.Г. Рогова\\\"\", \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": \"улица Бундурина\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": null}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}, {\"name\": \"Школа № 17\", \"street\": \"улица Фрунзе\"}, {\"name\": \"МБОУ ЦО №20\", \"street\": null}]}, \"bad\": 8, \"positive\": 20.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 127, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 128, \"rating\": 40}",
						"{\"good\": 38, \"park\": 7, \"cigarettes\": 4, \"alcohol\": 15, \"educational\": 15, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Колледж культуры и искусств\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования - гимназия 11\\\"\", \"street\": \"Менделеевская улица\"}, {\"name\": \"Тульская Православная классическая гимназия\", \"street\": \"улица Дзержинского\"}, {\"name\": \"Областная спортивная школа олимпийского резерва\", \"street\": null}, {\"name\": \"Тульский коммунально-строительный техникум\", \"street\": \"проспект Ленина\"}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": \"Интернат Начального Общего образования № 2\", \"street\": null}, {\"name\": \"Детский Сад №173\", \"street\": null}, {\"name\": \"Тульская Духовная Семинария\", \"street\": \"Староникитская улица\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\"}, {\"name\": \"Тульский педагогический колледж №1\", \"street\": \"улица Пирогова\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого, учебный корпус №1\", \"street\": null}]}, \"bad\": 51, \"positive\": -32.0, \"violations\": {\"len\": 8, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": \"Советская улица\", \"bad\": \"Red&White, 17, Советская улица, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"РАНХиГС\", \"street\": \"проспект Ленина\", \"bad\": \"Щи Борщи, 28, проспект Ленина, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"3 сестры, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Мама Миа, улица Демонстрации, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Чебуречная, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"Детский Сад №173\", \"street\": null, \"bad\": \"улица Кауля, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Лепим-варим, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Ананасовый Экспресс, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}]}, \"index\": 129, \"rating\": 0}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 130, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 131, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 132, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 133, \"rating\": 40}",
						"{\"good\": 7, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (школа)\", \"street\": null}]}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 134, \"rating\": 100}",
						"{\"good\": 9, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Муниципальное бюджетное общеобразовательное учреждение \\\"Центр образования № 36\\\"\", \"street\": \"улица Мезенцева\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №42\\\"\", \"street\": \"улица Николая Руднева\"}]}, \"bad\": 1, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 135, \"rating\": 100}",
						"{\"good\": 33, \"park\": 7, \"cigarettes\": 3, \"alcohol\": 10, \"educational\": 13, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Школа 39\", \"street\": null}, {\"name\": \"Областная спортивная школа олимпийского резерва\", \"street\": null}, {\"name\": \"Тульский коммунально-строительный техникум\", \"street\": \"проспект Ленина\"}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": \"Интернат Начального Общего образования № 2\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Школа №8\", \"street\": null}, {\"name\": \"Школа №31\", \"street\": null}, {\"name\": \"Детский Сад №173\", \"street\": null}, {\"name\": \"Тульская Духовная Семинария\", \"street\": \"Староникитская улица\"}, {\"name\": \"Вишенка\", \"street\": \"улица Макса Смирнова\"}, {\"name\": \"Тульский педагогический колледж №1\", \"street\": \"улица Пирогова\"}]}, \"bad\": 13, \"positive\": 3.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Детский Сад №173\", \"street\": null, \"bad\": \"улица Кауля, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}]}, \"index\": 136, \"rating\": 60}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 137, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 138, \"rating\": 40}",
						"{\"good\": 43, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 8, \"educational\": 19, \"transport\": {\"len\": 15, \"data\": [{\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Детский сад №147\", \"street\": null}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Детский сад 11\", \"street\": null}, {\"name\": \"Школа 34\", \"street\": null}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": \"улица Седова\"}, {\"name\": \"Детский сад №110\", \"street\": null}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": null}, {\"name\": \"Гномики\", \"street\": null}, {\"name\": \"Средняя общеобразовательная школа №7\", \"street\": null}, {\"name\": null, \"street\": \"Оружейная улица\"}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}, {\"name\": \"Детский сад\", \"street\": \"улица Седова\"}]}, \"bad\": 11, \"positive\": 10.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Средняя общеобразовательная школа №7\", \"street\": null, \"bad\": \"33, Оружейная улица, Серебровский, Привокзальный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300028, Russia\"}, {\"name\": \"Тульский государственный университет\", \"street\": null, \"bad\": \"Пятый океан, 149, улица Болдина, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}]}, \"index\": 139, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 140, \"rating\": 40}",
						"{\"good\": 27, \"park\": 7, \"cigarettes\": 1, \"alcohol\": 10, \"educational\": 14, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Детский сад 71\", \"street\": null}, {\"name\": \"Школа 57\", \"street\": null}, {\"name\": \"Тульский областной медицинский колледж\", \"street\": null}, {\"name\": \"МБОУ Центр образования № 1 корус 2\", \"street\": null}, {\"name\": \"МБОУ  ЦО №1 корпус 2\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Центр образования №1 корпус \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": \"улица Вересаева\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": null}, {\"name\": \"Центр образованія № 1 корпус Антошка\", \"street\": null}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}, {\"name\": null, \"street\": null}]}, \"bad\": 17, \"positive\": -3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 141, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 142, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 143, \"rating\": 40}",
						"{\"good\": 24, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 11, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Детский сад 71\", \"street\": null}, {\"name\": \"Детский сад 72\", \"street\": null}, {\"name\": \"Школа 57\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": \"улица Вересаева\"}, {\"name\": \"Центр образованія № 1 корпус Антошка\", \"street\": null}, {\"name\": \"Школа № 17\", \"street\": \"улица Фрунзе\"}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}, {\"name\": null, \"street\": null}]}, \"bad\": 5, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 144, \"rating\": 100}",
						"{\"good\": 36, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 12, \"educational\": 16, \"transport\": {\"len\": 11, \"data\": [{\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Детский сад №147\", \"street\": null}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Школа 34\", \"street\": null}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": \"улица Седова\"}, {\"name\": \"Детский сад №110\", \"street\": null}, {\"name\": \"Гномики\", \"street\": null}, {\"name\": null, \"street\": \"Оружейная улица\"}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}, {\"name\": \"Детский сад\", \"street\": \"улица Седова\"}]}, \"bad\": 16, \"positive\": 2.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Средняя общеобразовательная школа №7\", \"street\": null, \"bad\": \"33, Оружейная улица, Серебровский, Привокзальный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300028, Russia\"}, {\"name\": \"Тульский государственный университет\", \"street\": null, \"bad\": \"Пятый океан, 149, улица Болдина, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}]}, \"index\": 145, \"rating\": 60}",
						"{\"good\": 6, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 146, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 147, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 148, \"rating\": 100}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Хрущёвская средняя общеобразовательная школа им. А.И. Миронова\", \"street\": \"Центральная улица\"}, {\"name\": \"Детский сад общеразвивающего вида, с. Хрущёво\", \"street\": \"Совхозная улица\"}, {\"name\": null, \"street\": null}]}, \"bad\": 1, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 149, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 150, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 151, \"rating\": 40}",
						"{\"good\": 8, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Центр образования №4\", \"street\": \"улица Рогова\"}]}, \"bad\": 3, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 152, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 153, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 154, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 155, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 156, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 157, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 158, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 159, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 160, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 161, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 162, \"rating\": 40}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 163, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 164, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 165, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 166, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 167, \"rating\": 40}",
						"{\"good\": 48, \"park\": 2, \"cigarettes\": 4, \"alcohol\": 15, \"educational\": 15, \"transport\": {\"len\": 10, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Школа №60\", \"street\": \"улица Баженова\"}, {\"name\": \"Детский сад № 56\", \"street\": \"улица Шухова\"}, {\"name\": null, \"street\": null}, {\"name\": \"Филиал ДШИ №1\", \"street\": null}, {\"name\": \"Детский сад № 118\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №5 Мир детства\", \"street\": null}, {\"name\": \"Школа №50\", \"street\": null}]}, \"bad\": 16, \"positive\": 8.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null, \"bad\": \"Драфт, 13, улица Хворостухина, Глушанки, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300010, Russia\"}]}, \"index\": 168, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 169, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 170, \"rating\": 40}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 171, \"rating\": 100}",
						"{\"good\": 53, \"park\": 4, \"cigarettes\": 9, \"alcohol\": 13, \"educational\": 17, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"Центр образования 2 МБОУ\", \"street\": null}, {\"name\": \"Центр образования 7\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}, {\"name\": \"Banana School\", \"street\": null}, {\"name\": \"Детский сад 24\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"Демидовская улица\"}, {\"name\": \"Конфетка дошкольное отделение 43\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования 2\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}]}, \"bad\": 22, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 172, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 173, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 174, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 175, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 176, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 177, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 178, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 179, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 180, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 181, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 182, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 183, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 184, \"rating\": 40}",
						"{\"good\": 52, \"park\": 4, \"cigarettes\": 5, \"alcohol\": 13, \"educational\": 16, \"transport\": {\"len\": 11, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": \"МБОУ \\\"Гимназия №30\\\"\", \"street\": \"улица Кирова\"}, {\"name\": \"Школа №60\", \"street\": \"улица Баженова\"}, {\"name\": null, \"street\": \"улица Глинки\"}, {\"name\": \"Детский сад № 93\", \"street\": null}, {\"name\": \"Детский сад № 56\", \"street\": \"улица Шухова\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 118\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 13, \"positive\": 13.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null, \"bad\": \"Драфт, 13, улица Хворостухина, Глушанки, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300010, Russia\"}]}, \"index\": 185, \"rating\": 60}",
						"{\"good\": 36, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 1, \"educational\": 11, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Центр образования 2 МБОУ\", \"street\": null}, {\"name\": \"Центр образования 7\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"Демидовская улица\"}, {\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}, {\"name\": \"Конфетка дошкольное отделение 43\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}]}, \"bad\": 7, \"positive\": 11.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 186, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Малые Гончары\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (школа)\", \"street\": null}]}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 187, \"rating\": 100}",
						"{\"good\": 12, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 188, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 189, \"rating\": 100}",
						"{\"good\": 38, \"park\": 4, \"cigarettes\": 0, \"alcohol\": 4, \"educational\": 14, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №18\\\" (школа)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Металлургов\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Кутузова\"}, {\"name\": \"Средняя школа № 49\", \"street\": \"улица Макара Мазая\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования – гимназия №1 (дошкольное отделение)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (школа)\", \"street\": null}]}, \"bad\": 7, \"positive\": 12.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null, \"bad\": \"Pranzo, 11/8, улица Металлургов, Криволучье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300016, Russia\"}]}, \"index\": 190, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 191, \"rating\": 40}",
						"{\"good\": 51, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 8, \"educational\": 14, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Тульский государственный машиностроительный колледж имени Никиты Демидова\", \"street\": null}, {\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": \"Центр образования №24 (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования №24 (дошкольное отделение)\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 21\", \"street\": null}]}, \"bad\": 9, \"positive\": 16.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 192, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 193, \"rating\": 40}",
						"{\"good\": 24, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 6, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Детский Сад №173\", \"street\": null}, {\"name\": null, \"street\": \"улица Калинина\"}]}, \"bad\": 10, \"positive\": 2.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": null, \"bad\": \"Автосуши Автопицца, 54, Епифанская улица, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}, {\"name\": \"Детский Сад №173\", \"street\": null, \"bad\": \"улица Кауля, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}]}, \"index\": 194, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 195, \"rating\": 40}",
						"{\"good\": 6, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад общеразвивающего вида, с. Хрущёво\", \"street\": \"Совхозная улица\"}, {\"name\": null, \"street\": null}]}, \"bad\": 0, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 196, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад общеразвивающего вида, с. Хрущёво\", \"street\": \"Совхозная улица\"}, {\"name\": null, \"street\": null}]}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 197, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 198, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 199, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 200, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 201, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 202, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": -3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 203, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 204, \"rating\": 40}",
						"{\"good\": 41, \"park\": 7, \"cigarettes\": 0, \"alcohol\": 13, \"educational\": 28, \"transport\": {\"len\": 22, \"data\": [{\"name\": \"Школа 33\", \"street\": null}, {\"name\": \"Центр образования 1\", \"street\": null}, {\"name\": \"Тульский областной центр образования\", \"street\": null}, {\"name\": \"Тульский областной медицинский колледж\", \"street\": null}, {\"name\": \"Колледж культуры и искусств\", \"street\": null}, {\"name\": \"Школа Возрождение\", \"street\": null}, {\"name\": \"Областная спортивная школа олимпийского резерва\", \"street\": null}, {\"name\": \"Big Ben\", \"street\": null}, {\"name\": \"МБОУ Центр образования № 1 корус 2\", \"street\": null}, {\"name\": \"Тульский коммунально-строительный техникум\", \"street\": \"проспект Ленина\"}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": \"МБОУ  ЦО №1 корпус 2\", \"street\": null}, {\"name\": \"ГОУ СПО ТО \\\"ТТЭК им. А.Г. Рогова\\\"\", \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": \"улица Бундурина\"}, {\"name\": null, \"street\": null}, {\"name\": \"Центр образования №1 корпус \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": \"улица Вересаева\"}, {\"name\": \"МБОУ ЦО №27 Корпус 3\", \"street\": null}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": null}, {\"name\": \"Центр образованія № 1 корпус Антошка\", \"street\": null}, {\"name\": \"Школа № 17\", \"street\": \"улица Фрунзе\"}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}]}, \"bad\": 31, \"positive\": -10.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": \"Советская улица\", \"bad\": \"Red&White, 17, Советская улица, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"РАНХиГС\", \"street\": \"проспект Ленина\", \"bad\": \"Щи Борщи, 28, проспект Ленина, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"3 сестры, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Мама Миа, улица Демонстрации, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Чебуречная, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}]}, \"index\": 205, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 206, \"rating\": 40}",
						"{\"good\": 53, \"park\": 9, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 9, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"МБОУ \\\"Центр образования - гимназия 11\\\"\", \"street\": \"Менделеевская улица\"}, {\"name\": \"Тульская Православная классическая гимназия\", \"street\": \"улица Дзержинского\"}, {\"name\": \"Британника\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого, учебный корпус №1\", \"street\": null}]}, \"bad\": 17, \"positive\": 9.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": null, \"bad\": \"Автосуши Автопицца, 54, Епифанская улица, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"улица Чапаева, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}]}, \"index\": 207, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 208, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 209, \"rating\": 40}",
						"{\"good\": 10, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 210, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 211, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 212, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 213, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 214, \"rating\": 100}",
						"{\"good\": 28, \"park\": 4, \"cigarettes\": 4, \"alcohol\": 6, \"educational\": 11, \"transport\": {\"len\": 10, \"data\": [{\"name\": \"МБОУ \\\"Центр образования - гимназия 11\\\"\", \"street\": \"Менделеевская улица\"}, {\"name\": \"Тульская Православная классическая гимназия\", \"street\": \"улица Дзержинского\"}, {\"name\": \"Интернат Начального Общего образования № 2\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Школа №8\", \"street\": null}, {\"name\": \"Школа №31\", \"street\": null}, {\"name\": \"Тульский Сельскохозяйственный Колледж\", \"street\": null}, {\"name\": \"Детский Сад №173\", \"street\": null}, {\"name\": \"Тульская Духовная Семинария\", \"street\": \"Староникитская улица\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого, учебный корпус №1\", \"street\": null}]}, \"bad\": 14, \"positive\": 0.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Детский Сад №173\", \"street\": null, \"bad\": \"улица Кауля, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}]}, \"index\": 215, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 216, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 217, \"rating\": 100}",
						"{\"good\": 56, \"park\": 4, \"cigarettes\": 0, \"alcohol\": 7, \"educational\": 21, \"transport\": {\"len\": 16, \"data\": [{\"name\": \"Школа 33\", \"street\": null}, {\"name\": \"Детский сад 72\", \"street\": null}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Детский сад 11\", \"street\": null}, {\"name\": \"Школа 34\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": \"улица Седова\"}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": null}, {\"name\": \"Школа 58\", \"street\": null}, {\"name\": \"Гномики\", \"street\": null}, {\"name\": null, \"street\": \"Оружейная улица\"}, {\"name\": null, \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"Детский сад №95\", \"street\": null}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}, {\"name\": \"детсад №55\", \"street\": \"улица Циолковского\"}, {\"name\": \"Детский сад\", \"street\": \"улица Седова\"}]}, \"bad\": 7, \"positive\": 21.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 218, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 219, \"rating\": 40}",
						"{\"good\": 45, \"park\": 4, \"cigarettes\": 4, \"alcohol\": 21, \"educational\": 15, \"transport\": {\"len\": 10, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Центр образования №1 корпус \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}, {\"name\": \"Школа-сад №1\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\"\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образованія № 1 корпус Антошка\", \"street\": null}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}, {\"name\": null, \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}]}, \"bad\": 33, \"positive\": -10.5, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": \"Советская улица\", \"bad\": \"Red&White, 17, Советская улица, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"Школа-сад №1\", \"street\": null, \"bad\": \"Ствольная улица, Малые Гончары, Зареченский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300044, Russia\"}]}, \"index\": 220, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 221, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 222, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 223, \"rating\": 100}",
						"{\"good\": 57, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 16, \"educational\": 28, \"transport\": {\"len\": 18, \"data\": [{\"name\": \"Школа №36\", \"street\": null}, {\"name\": \"Magic Dance\", \"street\": \"улица Николая Руднева\"}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Детский сад 11\", \"street\": null}, {\"name\": \"Школа 34\", \"street\": null}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": \"улица Седова\"}, {\"name\": \"Детский сад №110\", \"street\": null}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": null}, {\"name\": \"Школа 58\", \"street\": null}, {\"name\": \"Гномики\", \"street\": null}, {\"name\": null, \"street\": \"Оружейная улица\"}, {\"name\": null, \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"Детский сад №27\", \"street\": \"улица Станиславского\"}, {\"name\": \"Муниципальное бюджетное общеобразовательное учреждение \\\"Центр образования № 36\\\"\", \"street\": \"улица Мезенцева\"}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}, {\"name\": \"детсад №55\", \"street\": \"улица Циолковского\"}]}, \"bad\": 22, \"positive\": 6.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Средняя общеобразовательная школа №7\", \"street\": null, \"bad\": \"33, Оружейная улица, Серебровский, Привокзальный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300028, Russia\"}, {\"name\": \"Тульский государственный университет\", \"street\": null, \"bad\": \"Пятый океан, 149, улица Болдина, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"МБОУ \\\"Центр образования №42\\\"\", \"street\": \"улица Николая Руднева\", \"bad\": \"Пивовар, 54, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300026, Russia\"}]}, \"index\": 224, \"rating\": 60}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 225, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 226, \"rating\": 40}",
						"{\"good\": 5, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 227, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 228, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 229, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 230, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 231, \"rating\": 40}",
						"{\"good\": 5, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 232, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 233, \"rating\": 40}",
						"{\"good\": 4, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад 72\", \"street\": null}, {\"name\": \"Детский сад (Центр образования №44)\", \"street\": null}, {\"name\": \"Центр образования №4\", \"street\": \"улица Рогова\"}]}, \"bad\": 1, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 234, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 235, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 236, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 237, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 238, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 239, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 240, \"rating\": 40}",
						"{\"good\": 5, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 241, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 242, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 243, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 244, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 245, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 246, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Малые Гончары\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}]}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 247, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 248, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 249, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 250, \"rating\": 40}",
						"{\"good\": 20, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 7, \"educational\": 7, \"transport\": {\"len\": 6, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Школа №60\", \"street\": \"улица Баженова\"}, {\"name\": null, \"street\": null}, {\"name\": \"Филиал ДШИ №1\", \"street\": null}, {\"name\": \"Детский сад №5 Мир детства\", \"street\": null}, {\"name\": \"Школа №50\", \"street\": null}]}, \"bad\": 8, \"positive\": 2.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null, \"bad\": \"Драфт, 13, улица Хворостухина, Глушанки, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300010, Russia\"}]}, \"index\": 251, \"rating\": 60}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 252, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 253, \"rating\": 40}",
						"{\"good\": 26, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 6, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Детский сад № 48\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": \"улица Генерала Маргелова\"}, {\"name\": \"МБОУ ЦО N° 15\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": null}]}, \"bad\": 9, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 254, \"rating\": 100}",
						"{\"good\": 22, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 10, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Детский сад №84\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Малые Гончары\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": null, \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (школа)\", \"street\": null}, {\"name\": \"Школа-сад №1\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\"\", \"street\": null}]}, \"bad\": 3, \"positive\": 8.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа-сад №1\", \"street\": null, \"bad\": \"Ствольная улица, Малые Гончары, Зареченский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300044, Russia\"}]}, \"index\": 255, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 256, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 257, \"rating\": 40}",
						"{\"good\": 19, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 9, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Земляничка\", \"street\": null}, {\"name\": \"Мальвина\", \"street\": null}, {\"name\": \"Детский сад 24\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}, {\"name\": \"Конфетка дошкольное отделение 43\", \"street\": null}]}, \"bad\": 3, \"positive\": 6.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 258, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 259, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 260, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 261, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 262, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 263, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 264, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 265, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 266, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 267, \"rating\": 100}",
						"{\"good\": 39, \"park\": 4, \"cigarettes\": 0, \"alcohol\": 4, \"educational\": 11, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №18\\\" (школа)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Металлургов\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Кутузова\"}, {\"name\": \"Средняя школа № 49\", \"street\": \"улица Макара Мазая\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (школа)\", \"street\": null}]}, \"bad\": 5, \"positive\": 14.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null, \"bad\": \"Pranzo, 11/8, улица Металлургов, Криволучье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300016, Russia\"}]}, \"index\": 268, \"rating\": 60}",
						"{\"good\": 19, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Дошколенок\", \"street\": null}, {\"name\": \"Зареченская детская школа искусств Школы искусств\", \"street\": \"Октябрьская улица\"}, {\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}]}, \"bad\": 1, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 269, \"rating\": 100}",
						"{\"good\": 7, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 270, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 271, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 272, \"rating\": 40}",
						"{\"good\": 90, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 14, \"educational\": 17, \"transport\": {\"len\": 13, \"data\": [{\"name\": \"Тульский государственный машиностроительный колледж имени Никиты Демидова\", \"street\": null}, {\"name\": \"Гимназия №1\", \"street\": \"Приупская улица\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": null, \"street\": \"улица Калинина\"}, {\"name\": \"МБОУ \\\"Гимназия №30\\\"\", \"street\": \"улица Кирова\"}, {\"name\": \"Центр образования – гимназия №1 (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад №130\", \"street\": null}, {\"name\": null, \"street\": \"улица Глинки\"}, {\"name\": \"Центр образования №24 (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад № 56\", \"street\": \"улица Шухова\"}, {\"name\": null, \"street\": null}]}, \"bad\": 14, \"positive\": 31.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 273, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 274, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 275, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 276, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 277, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 278, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 279, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 280, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 281, \"rating\": 40}",
						"{\"good\": 57, \"park\": 9, \"cigarettes\": 2, \"alcohol\": 13, \"educational\": 17, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"Школа 33\", \"street\": null}, {\"name\": \"Центр образования 1\", \"street\": null}, {\"name\": \"Малышок\", \"street\": null}, {\"name\": \"Тульский областной центр образования\", \"street\": null}, {\"name\": \"Школа 58\", \"street\": null}, {\"name\": \"Колледж культуры и искусств\", \"street\": null}, {\"name\": \"Областная спортивная школа олимпийского резерва\", \"street\": null}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": null, \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"ГОУ СПО ТО \\\"ТТЭК им. А.Г. Рогова\\\"\", \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"Центр образования №39\", \"street\": null}, {\"name\": \"детсад №55\", \"street\": \"улица Циолковского\"}, {\"name\": \"МБОУ ЦО №20\", \"street\": null}, {\"name\": \"МБДОУ «ЦРР – Д/С № 2»\", \"street\": null}]}, \"bad\": 18, \"positive\": 10.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Центр образования №39\", \"street\": null, \"bad\": \"Овощи и фрукты, улица Тимирязева, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}]}, \"index\": 282, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 283, \"rating\": 40}",
						"{\"good\": 75, \"park\": 5, \"cigarettes\": 3, \"alcohol\": 18, \"educational\": 14, \"transport\": {\"len\": 10, \"data\": [{\"name\": \"Малышок\", \"street\": null}, {\"name\": \"Школа 58\", \"street\": null}, {\"name\": null, \"street\": \"Оружейная улица\"}, {\"name\": null, \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\"}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}, {\"name\": \"Центр образования №39\", \"street\": null}, {\"name\": \"детсад №55\", \"street\": \"улица Циолковского\"}, {\"name\": \"МБОУ ЦО №20\", \"street\": null}]}, \"bad\": 20, \"positive\": 17.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\", \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"Центр образования №39\", \"street\": null, \"bad\": \"Овощи и фрукты, улица Тимирязева, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}, {\"name\": \"Тульский государственный университет\", \"street\": null, \"bad\": \"Пятый океан, 149, улица Болдина, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}]}, \"index\": 284, \"rating\": 60}",
						"{\"good\": 65, \"park\": 8, \"cigarettes\": 7, \"alcohol\": 26, \"educational\": 20, \"transport\": {\"len\": 13, \"data\": [{\"name\": \"Школа Возрождение\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования - гимназия 11\\\"\", \"street\": \"Менделеевская улица\"}, {\"name\": \"Тульская Православная классическая гимназия\", \"street\": \"улица Дзержинского\"}, {\"name\": \"Big Ben\", \"street\": null}, {\"name\": \"Banana School\", \"street\": null}, {\"name\": \"МБОУ  ЦО №1 корпус 2\", \"street\": null}, {\"name\": \"Центр образования №1 корпус \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого, учебный корпус №1\", \"street\": null}, {\"name\": \"Лицей №2 (бывший 73)\", \"street\": null}, {\"name\": \"Центр образования 2\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}]}, \"bad\": 65, \"positive\": -32.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": \"Советская улица\", \"bad\": \"Red&White, 17, Советская улица, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"3 сестры, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Мама Миа, улица Демонстрации, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Чебуречная, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Лепим-варим, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Ананасовый Экспресс, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}]}, \"index\": 285, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 286, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 287, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 288, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 289, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 290, \"rating\": 40}",
						"{\"good\": 23, \"park\": 2, \"cigarettes\": 5, \"alcohol\": 8, \"educational\": 8, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Интернат Начального Общего образования № 2\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Школа №8\", \"street\": null}, {\"name\": \"Школа №31\", \"street\": null}, {\"name\": \"Детский Сад №173\", \"street\": null}, {\"name\": \"Тульская Духовная Семинария\", \"street\": \"Староникитская улица\"}, {\"name\": \"Вишенка\", \"street\": \"улица Макса Смирнова\"}]}, \"bad\": 12, \"positive\": -0.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Детский Сад №173\", \"street\": null, \"bad\": \"улица Кауля, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}]}, \"index\": 291, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 292, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 293, \"rating\": 100}",
						"{\"good\": 30, \"park\": 4, \"cigarettes\": 3, \"alcohol\": 7, \"educational\": 8, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Школа 39\", \"street\": null}, {\"name\": \"Интернат Начального Общего образования № 2\", \"street\": null}, {\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Школа №8\", \"street\": null}, {\"name\": \"Школа №31\", \"street\": null}, {\"name\": \"Вишенка\", \"street\": \"улица Макса Смирнова\"}, {\"name\": \"МБДОУ «ЦРР – Д/С № 2»\", \"street\": null}]}, \"bad\": 10, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 294, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 295, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 296, \"rating\": 40}",
						"{\"good\": 51, \"park\": 7, \"cigarettes\": 1, \"alcohol\": 10, \"educational\": 20, \"transport\": {\"len\": 18, \"data\": [{\"name\": \"Школа 33\", \"street\": null}, {\"name\": \"Детский сад 71\", \"street\": null}, {\"name\": \"Центр образования 1\", \"street\": null}, {\"name\": \"Тульский областной центр образования\", \"street\": null}, {\"name\": \"Школа 57\", \"street\": null}, {\"name\": \"Тульский областной медицинский колледж\", \"street\": null}, {\"name\": \"МБОУ Центр образования № 1 корус 2\", \"street\": null}, {\"name\": \"МБОУ  ЦО №1 корпус 2\", \"street\": null}, {\"name\": \"ГОУ СПО ТО \\\"ТТЭК им. А.Г. Рогова\\\"\", \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": \"улица Бундурина\"}, {\"name\": null, \"street\": null}, {\"name\": \"Центр образования №1 корпус \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": \"улица Вересаева\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": null}, {\"name\": \"Центр образованія № 1 корпус Антошка\", \"street\": null}, {\"name\": \"Школа № 17\", \"street\": \"улица Фрунзе\"}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}, {\"name\": null, \"street\": null}]}, \"bad\": 16, \"positive\": 9.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 297, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 298, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 299, \"rating\": 40}",
						"{\"good\": 58, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 21, \"educational\": 20, \"transport\": {\"len\": 11, \"data\": [{\"name\": \"Школа №36\", \"street\": null}, {\"name\": \"Magic Dance\", \"street\": \"улица Николая Руднева\"}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Детский сад №110\", \"street\": null}, {\"name\": \"Детский сад №27\", \"street\": \"улица Станиславского\"}, {\"name\": \"Муниципальное бюджетное общеобразовательное учреждение \\\"Центр образования № 36\\\"\", \"street\": \"улица Мезенцева\"}, {\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\"}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"МБОУ ЦО N° 15\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": null}]}, \"bad\": 30, \"positive\": -1.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Средняя общеобразовательная школа №7\", \"street\": null, \"bad\": \"33, Оружейная улица, Серебровский, Привокзальный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300028, Russia\"}, {\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\", \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"Тульский государственный университет\", \"street\": null, \"bad\": \"Пятый океан, 149, улица Болдина, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"МБОУ \\\"Центр образования №42\\\"\", \"street\": \"улица Николая Руднева\", \"bad\": \"Пивовар, 54, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300026, Russia\"}]}, \"index\": 300, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 301, \"rating\": 40}",
						"{\"good\": 7, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 3, \"educational\": 2, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Средняя школа № 49\", \"street\": \"улица Макара Мазая\"}]}, \"bad\": 3, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 302, \"rating\": 100}",
						"{\"good\": 35, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 11, \"educational\": 8, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад №110\", \"street\": null}, {\"name\": \"Детский сад № 48\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": \"улица Генерала Маргелова\"}, {\"name\": null, \"street\": null}]}, \"bad\": 16, \"positive\": 1.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Средняя общеобразовательная школа №7\", \"street\": null, \"bad\": \"33, Оружейная улица, Серебровский, Привокзальный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300028, Russia\"}]}, \"index\": 303, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 304, \"rating\": 40}",
						"{\"good\": 8, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад (Центр образования №44)\", \"street\": null}, {\"name\": \"Детский сад (Центр образования №43)\", \"street\": null}, {\"name\": \"Центр образования №44 им. Маршала Советского Союза Г.К. Жукова\", \"street\": \"Одоевское шоссе\"}, {\"name\": \"Детский сад\", \"street\": null}]}, \"bad\": 3, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 305, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 306, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 307, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 308, \"rating\": 40}",
						"{\"good\": 6, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад (Центр образования №44)\", \"street\": null}, {\"name\": \"Детский сад (Центр образования №43)\", \"street\": null}, {\"name\": \"Центр образования №44 им. Маршала Советского Союза Г.К. Жукова\", \"street\": \"Одоевское шоссе\"}]}, \"bad\": 5, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 309, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 310, \"rating\": 40}",
						"{\"good\": 8, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад 71\", \"street\": null}, {\"name\": \"Школа 57\", \"street\": null}, {\"name\": \"Центр образования №4\", \"street\": \"улица Рогова\"}]}, \"bad\": 3, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 311, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 312, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 313, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 314, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 315, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 316, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 317, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 318, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 319, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 320, \"rating\": 40}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 321, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 322, \"rating\": 40}",
						"{\"good\": 9, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 323, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 324, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 325, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 326, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 327, \"rating\": 40}",
						"{\"good\": 22, \"park\": 1, \"cigarettes\": 3, \"alcohol\": 4, \"educational\": 8, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"Мальвина\", \"street\": null}, {\"name\": \"Детский сад 24\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Малые Гончары\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (школа)\", \"street\": null}]}, \"bad\": 7, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 328, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 329, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 330, \"rating\": 40}",
						"{\"good\": 9, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Дошколенок\", \"street\": null}, {\"name\": \"Центр образования 5\", \"street\": null}, {\"name\": \"Зареченская детская школа искусств Школы искусств\", \"street\": \"Октябрьская улица\"}, {\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}]}, \"bad\": 0, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 331, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 332, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 333, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 334, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 335, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 336, \"rating\": 40}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 337, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 338, \"rating\": 40}",
						"{\"good\": 21, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": \"улица Глинки\"}]}, \"bad\": 2, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 339, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 340, \"rating\": 40}",
						"{\"good\": 53, \"park\": 3, \"cigarettes\": 4, \"alcohol\": 16, \"educational\": 15, \"transport\": {\"len\": 9, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Школа №60\", \"street\": \"улица Баженова\"}, {\"name\": \"Детский сад № 56\", \"street\": \"улица Шухова\"}, {\"name\": \"Филиал ДШИ №1\", \"street\": null}, {\"name\": \"Детский сад № 118\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №5 Мир детства\", \"street\": null}, {\"name\": \"Школа №50\", \"street\": null}]}, \"bad\": 17, \"positive\": 9.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 341, \"rating\": 100}",
						"{\"good\": 38, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 6, \"educational\": 11, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Центр образования 2 МБОУ\", \"street\": null}, {\"name\": \"Центр образования 7\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}, {\"name\": \"Banana School\", \"street\": null}, {\"name\": \"Конфетка дошкольное отделение 43\", \"street\": null}, {\"name\": \"Центр образования 2\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}]}, \"bad\": 12, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 342, \"rating\": 100}",
						"{\"good\": 17, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 6, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Малые Гончары\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (школа)\", \"street\": null}, {\"name\": \"Школа-сад №1\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\"\", \"street\": null}]}, \"bad\": 2, \"positive\": 6.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа-сад №1\", \"street\": null, \"bad\": \"Ствольная улица, Малые Гончары, Зареченский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300044, Russia\"}]}, \"index\": 343, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 344, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}]}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 345, \"rating\": 40}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 346, \"rating\": 100}",
						"{\"good\": 94, \"park\": 4, \"cigarettes\": 2, \"alcohol\": 10, \"educational\": 18, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Тульский государственный машиностроительный колледж имени Никиты Демидова\", \"street\": null}, {\"name\": \"Гимназия №1\", \"street\": \"Приупская улица\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (школа)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Металлургов\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Кутузова\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования – гимназия №1 (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад №130\", \"street\": null}, {\"name\": \"Центр образования №24 (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}]}, \"bad\": 12, \"positive\": 35.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 347, \"rating\": 100}",
						"{\"good\": 21, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 8, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Тульский государственный машиностроительный колледж имени Никиты Демидова\", \"street\": null}, {\"name\": \"Центр образования №24 (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования №24 (дошкольное отделение)\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Центр образования №24 (дошкольное отделение)\", \"street\": \"Приупская улица\"}]}, \"bad\": 2, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 348, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 349, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 350, \"rating\": 40}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Хрущёвская средняя общеобразовательная школа им. А.И. Миронова\", \"street\": \"Центральная улица\"}, {\"name\": \"Детский сад общеразвивающего вида, с. Хрущёво\", \"street\": \"Совхозная улица\"}, {\"name\": null, \"street\": null}]}, \"bad\": 0, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 351, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 352, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 353, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 354, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 355, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 356, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 357, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 358, \"rating\": 40}",
						"{\"good\": 32, \"park\": 7, \"cigarettes\": 2, \"alcohol\": 15, \"educational\": 15, \"transport\": {\"len\": 13, \"data\": [{\"name\": \"Тульский областной центр образования\", \"street\": null}, {\"name\": \"Колледж культуры и искусств\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования - гимназия 11\\\"\", \"street\": \"Менделеевская улица\"}, {\"name\": \"Областная спортивная школа олимпийского резерва\", \"street\": null}, {\"name\": \"Тульский коммунально-строительный техникум\", \"street\": \"проспект Ленина\"}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": \"Тульская Духовная Семинария\", \"street\": \"Староникитская улица\"}, {\"name\": \"ГОУ СПО ТО \\\"ТТЭК им. А.Г. Рогова\\\"\", \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": \"улица Бундурина\"}, {\"name\": \"Вишенка\", \"street\": \"улица Макса Смирнова\"}, {\"name\": \"Тульский педагогический колледж №1\", \"street\": \"улица Пирогова\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого, учебный корпус №1\", \"street\": null}]}, \"bad\": 36, \"positive\": -20.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"РАНХиГС\", \"street\": \"проспект Ленина\", \"bad\": \"Щи Борщи, 28, проспект Ленина, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}]}, \"index\": 359, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 360, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 361, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 362, \"rating\": 40}",
						"{\"good\": 35, \"park\": 2, \"cigarettes\": 8, \"alcohol\": 20, \"educational\": 13, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Центр образования 7\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}, {\"name\": \"Banana School\", \"street\": null}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Радость моя\", \"street\": null}, {\"name\": \"Центр образования 2\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}]}, \"bad\": 38, \"positive\": -20.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": null, \"bad\": \"Автосуши Автопицца, 54, Епифанская улица, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Лепим-варим, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Ананасовый Экспресс, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}]}, \"index\": 363, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 364, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 365, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 366, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 367, \"rating\": 40}",
						"{\"good\": 7, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 5, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Средняя школа № 49\", \"street\": \"улица Макара Мазая\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (школа)\", \"street\": null}]}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null, \"bad\": \"Pranzo, 11/8, улица Металлургов, Криволучье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300016, Russia\"}]}, \"index\": 368, \"rating\": 60}",
						"{\"good\": 26, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 369, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 370, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 371, \"rating\": 40}",
						"{\"good\": 12, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад 71\", \"street\": null}, {\"name\": \"Детский сад 72\", \"street\": null}, {\"name\": \"Школа 57\", \"street\": null}]}, \"bad\": 1, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 372, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 373, \"rating\": 40}",
						"{\"good\": 47, \"park\": 9, \"cigarettes\": 1, \"alcohol\": 23, \"educational\": 29, \"transport\": {\"len\": 20, \"data\": [{\"name\": \"Центр образования 1\", \"street\": null}, {\"name\": \"Тульский областной медицинский колледж\", \"street\": null}, {\"name\": \"Колледж культуры и искусств\", \"street\": null}, {\"name\": \"Школа Возрождение\", \"street\": null}, {\"name\": \"Big Ben\", \"street\": null}, {\"name\": \"МБОУ Центр образования № 1 корус 2\", \"street\": null}, {\"name\": \"Тульский коммунально-строительный техникум\", \"street\": \"проспект Ленина\"}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": \"МБОУ  ЦО №1 корпус 2\", \"street\": null}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": \"улица Бундурина\"}, {\"name\": null, \"street\": null}, {\"name\": \"Центр образования №1 корпус \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": \"улица Вересаева\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}, {\"name\": \"Центр образованія № 1 корпус Антошка\", \"street\": null}, {\"name\": \"Школа № 17\", \"street\": \"улица Фрунзе\"}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}, {\"name\": null, \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}]}, \"bad\": 47, \"positive\": -23.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": \"Советская улица\", \"bad\": \"Red&White, 17, Советская улица, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"РАНХиГС\", \"street\": \"проспект Ленина\", \"bad\": \"Щи Борщи, 28, проспект Ленина, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"3 сестры, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Мама Миа, улица Демонстрации, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Чебуречная, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}]}, \"index\": 374, \"rating\": 0}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 375, \"rating\": 40}",
						"{\"good\": 68, \"park\": 5, \"cigarettes\": 4, \"alcohol\": 21, \"educational\": 19, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Школа №36\", \"street\": null}, {\"name\": \"Magic Dance\", \"street\": \"улица Николая Руднева\"}, {\"name\": null, \"street\": \"Оружейная улица\"}, {\"name\": \"Детский сад №27\", \"street\": \"улица Станиславского\"}, {\"name\": \"Муниципальное бюджетное общеобразовательное учреждение \\\"Центр образования № 36\\\"\", \"street\": \"улица Мезенцева\"}, {\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\"}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}, {\"name\": \"Центр образования №16\", \"street\": null}, {\"name\": \"Центр образования №39\", \"street\": null}, {\"name\": \"детсад №55\", \"street\": \"улица Циолковского\"}, {\"name\": \"МБОУ ЦО №20\", \"street\": null}]}, \"bad\": 27, \"positive\": 7.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\", \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"Центр образования №39\", \"street\": null, \"bad\": \"Овощи и фрукты, улица Тимирязева, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}, {\"name\": \"Тульский государственный университет\", \"street\": null, \"bad\": \"Пятый океан, 149, улица Болдина, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"МБОУ \\\"Центр образования №42\\\"\", \"street\": \"улица Николая Руднева\", \"bad\": \"Пивовар, 54, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300026, Russia\"}]}, \"index\": 376, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 377, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 378, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 379, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 380, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 381, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 382, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 383, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 384, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 385, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 386, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 387, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад (Центр образования №43)\", \"street\": null}, {\"name\": \"Учебный центр профессиональной квалификации ОАО РЖД\", \"street\": \"Одоевское шоссе\"}]}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 388, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 389, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 390, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 391, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 392, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 393, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 394, \"rating\": 40}",
						"{\"good\": 10, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (школа)\", \"street\": null}]}, \"bad\": 2, \"positive\": 3.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null, \"bad\": \"Pranzo, 11/8, улица Металлургов, Криволучье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300016, Russia\"}]}, \"index\": 395, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 396, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": -2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 397, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 398, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 399, \"rating\": 40}",
						"{\"good\": 10, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 13, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Детский сад №147\", \"street\": null}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Детский сад 11\", \"street\": null}, {\"name\": \"Школа 9\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": \"улица Седова\"}, {\"name\": \"Детский сад №110\", \"street\": null}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": null}, {\"name\": \"Гномики\", \"street\": null}, {\"name\": \"МДОУ, Центр образования 9 им. генерала А.Н. Ермакова\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": \"улица Седова\"}]}, \"bad\": 3, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 400, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 401, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 402, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Центр образования 5\", \"street\": \"18-й Октябрьский проезд\"}, {\"name\": \"Центр образования №5\", \"street\": null}]}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 403, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 404, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 405, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 406, \"rating\": 40}",
						"{\"good\": 11, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Центр образования 14\", \"street\": null}, {\"name\": null, \"street\": \"улица Генерала Маргелова\"}]}, \"bad\": 1, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 407, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 408, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 409, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 410, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 411, \"rating\": 100}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Земляничка\", \"street\": null}, {\"name\": \"Центр образования 5\", \"street\": \"18-й Октябрьский проезд\"}]}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 412, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 413, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 414, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 415, \"rating\": 40}",
						"{\"good\": 60, \"park\": 1, \"cigarettes\": 6, \"alcohol\": 9, \"educational\": 20, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"Детский сад №84\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (школа)\", \"street\": null}, {\"name\": \"Banana School\", \"street\": null}, {\"name\": \"Детский сад 24\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Малые Гончары\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"Демидовская улица\"}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (школа)\", \"street\": null}, {\"name\": \"Школа-сад №1\", \"street\": null}, {\"name\": \"Центр образования 2\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\"\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": null}]}, \"bad\": 16, \"positive\": 14.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа-сад №1\", \"street\": null, \"bad\": \"Ствольная улица, Малые Гончары, Зареченский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300044, Russia\"}]}, \"index\": 416, \"rating\": 60}",
						"{\"good\": 50, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 7, \"educational\": 10, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Детский сад №84\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 31\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (дошкольное отделение)\", \"street\": \"улица Пузакова\"}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №10 имени А. В. Чернова\\\" (школа)\", \"street\": null}, {\"name\": \"Школа-сад №1\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\"\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования №12\\\" (дошкольное отделение)\", \"street\": null}]}, \"bad\": 9, \"positive\": 16.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Школа-сад №1\", \"street\": null, \"bad\": \"Ствольная улица, Малые Гончары, Зареченский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300044, Russia\"}]}, \"index\": 417, \"rating\": 60}",
						"{\"good\": 32, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 9, \"educational\": 7, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 418, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 419, \"rating\": 40}",
						"{\"good\": 19, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 6, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад № 26\", \"street\": null}, {\"name\": \"Центр образования №7\", \"street\": \"улица Гончарова\"}, {\"name\": \"Детский сад № 118\", \"street\": null}]}, \"bad\": 5, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 420, \"rating\": 100}",
						"{\"good\": 25, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 5, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад № 48\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": \"улица Генерала Маргелова\"}, {\"name\": \"МБОУ ЦО N° 15\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": null}]}, \"bad\": 2, \"positive\": 10.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 421, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 422, \"rating\": 40}",
						"{\"good\": 78, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 9, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Гимназия №1\", \"street\": \"Приупская улица\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад\", \"street\": null}, {\"name\": \"Центр образования – гимназия №1 (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад №130\", \"street\": null}]}, \"bad\": 7, \"positive\": 32.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 423, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 424, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 425, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 426, \"rating\": 40}",
						"{\"good\": 59, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 6, \"educational\": 10, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Тульский государственный машиностроительный колледж имени Никиты Демидова\", \"street\": null}, {\"name\": \"Гимназия №1\", \"street\": \"Приупская улица\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}, {\"name\": \"Центр образования – гимназия №1 (дошкольное отделение)\", \"street\": null}, {\"name\": \"Детский сад №130\", \"street\": null}, {\"name\": \"Центр образования №24 (школа)\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null}]}, \"bad\": 6, \"positive\": 23.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 427, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 428, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 429, \"rating\": 40}",
						"{\"good\": 6, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Хрущёвская средняя общеобразовательная школа им. А.И. Миронова\", \"street\": \"Центральная улица\"}, {\"name\": \"Детский сад общеразвивающего вида, с. Хрущёво\", \"street\": \"Совхозная улица\"}, {\"name\": null, \"street\": null}]}, \"bad\": 1, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 430, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 431, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 432, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 433, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 434, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 435, \"rating\": 40}",
						"{\"good\": 53, \"park\": 6, \"cigarettes\": 4, \"alcohol\": 16, \"educational\": 16, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Школа №36\", \"street\": null}, {\"name\": \"Magic Dance\", \"street\": \"улица Николая Руднева\"}, {\"name\": \"Малышок\", \"street\": null}, {\"name\": \"Школа 58\", \"street\": null}, {\"name\": null, \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"Детский сад №27\", \"street\": \"улица Станиславского\"}, {\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\"}, {\"name\": null, \"street\": null}, {\"name\": \"Центр образования №39\", \"street\": null}, {\"name\": \"детсад №55\", \"street\": \"улица Циолковского\"}, {\"name\": \"МБОУ ЦО №20\", \"street\": null}, {\"name\": \"МБДОУ «ЦРР – Д/С № 2»\", \"street\": null}]}, \"bad\": 20, \"positive\": 6.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\", \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"Центр образования №39\", \"street\": null, \"bad\": \"Овощи и фрукты, улица Тимирязева, Красный Перекоп, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300007, Russia\"}, {\"name\": \"МБОУ \\\"Центр образования №42\\\"\", \"street\": \"улица Николая Руднева\", \"bad\": \"Пивовар, 54, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300026, Russia\"}]}, \"index\": 436, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 437, \"rating\": 40}",
						"{\"good\": 45, \"park\": 8, \"cigarettes\": 7, \"alcohol\": 23, \"educational\": 15, \"transport\": {\"len\": 10, \"data\": [{\"name\": \"МБОУ \\\"Центр образования - гимназия 11\\\"\", \"street\": \"Менделеевская улица\"}, {\"name\": \"Тульская Православная классическая гимназия\", \"street\": \"улица Дзержинского\"}, {\"name\": \"Big Ben\", \"street\": null}, {\"name\": \"Тульский коммунально-строительный техникум\", \"street\": \"проспект Ленина\"}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\"}, {\"name\": \"Тульский педагогический колледж №1\", \"street\": \"улица Пирогова\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого, учебный корпус №1\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}]}, \"bad\": 66, \"positive\": -43.5, \"violations\": {\"len\": 8, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": null, \"bad\": \"Автосуши Автопицца, 54, Епифанская улица, Заречье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300001, Russia\"}, {\"name\": \"Компьютерная академия ШАГ\", \"street\": \"Советская улица\", \"bad\": \"Red&White, 17, Советская улица, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"РАНХиГС\", \"street\": \"проспект Ленина\", \"bad\": \"Щи Борщи, 28, проспект Ленина, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"3 сестры, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Мама Миа, улица Демонстрации, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Чебуречная, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Лепим-варим, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Ананасовый Экспресс, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}]}, \"index\": 438, \"rating\": 0}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 439, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 440, \"rating\": 40}",
						"{\"good\": 58, \"park\": 10, \"cigarettes\": 2, \"alcohol\": 29, \"educational\": 29, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"Центр образования 1\", \"street\": null}, {\"name\": \"Тульский областной центр образования\", \"street\": null}, {\"name\": \"Колледж культуры и искусств\", \"street\": null}, {\"name\": \"Школа Возрождение\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования - гимназия 11\\\"\", \"street\": \"Менделеевская улица\"}, {\"name\": \"Тульская Православная классическая гимназия\", \"street\": \"улица Дзержинского\"}, {\"name\": \"Областная спортивная школа олимпийского резерва\", \"street\": null}, {\"name\": \"Big Ben\", \"street\": null}, {\"name\": \"Тульский коммунально-строительный техникум\", \"street\": \"проспект Ленина\"}, {\"name\": \"Лицей №1\", \"street\": \"Пушкинская улица\"}, {\"name\": \"МБОУ  ЦО №1 корпус 2\", \"street\": null}, {\"name\": \"Тульская Духовная Семинария\", \"street\": \"Староникитская улица\"}, {\"name\": \"ГОУ СПО ТО \\\"ТТЭК им. А.Г. Рогова\\\"\", \"street\": \"улица Ф.Энгельса\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": \"улица Бундурина\"}, {\"name\": \"Центр образования №1 корпус \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\"}, {\"name\": \"Тульский педагогический колледж №1\", \"street\": \"улица Пирогова\"}, {\"name\": \"МБОУ ЦО №27 Корпус 4\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого, учебный корпус №1\", \"street\": null}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": \"Черниковский переулок\"}]}, \"bad\": 69, \"positive\": -40.0, \"violations\": {\"len\": 7, \"data\": [{\"name\": \"Компьютерная академия ШАГ\", \"street\": \"Советская улица\", \"bad\": \"Red&White, 17, Советская улица, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"РАНХиГС\", \"street\": \"проспект Ленина\", \"bad\": \"Щи Борщи, 28, проспект Ленина, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"3 сестры, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Мама Миа, улица Демонстрации, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"English Jet\", \"street\": \"улица Демонстрации\", \"bad\": \"Чебуречная, 12/14/16, Советская улица, Белоусовский парк, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300041, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Лепим-варим, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}, {\"name\": \"Профессиональный Лицей № 4\", \"street\": \"улица Металлистов\", \"bad\": \"Ананасовый Экспресс, Казанская набережная, Заречье, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300000, Russia\"}]}, \"index\": 441, \"rating\": 0}",
						"{\"good\": 27, \"park\": 1, \"cigarettes\": 3, \"alcohol\": 10, \"educational\": 14, \"transport\": {\"len\": 10, \"data\": [{\"name\": \"Школа №36\", \"street\": null}, {\"name\": \"Magic Dance\", \"street\": \"улица Николая Руднева\"}, {\"name\": \"Детский сад №27\", \"street\": \"улица Станиславского\"}, {\"name\": \"Муниципальное бюджетное общеобразовательное учреждение \\\"Центр образования № 36\\\"\", \"street\": \"улица Мезенцева\"}, {\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\"}, {\"name\": null, \"street\": null}, {\"name\": \"Центр образования №39\", \"street\": null}, {\"name\": \"детсад №55\", \"street\": \"улица Циолковского\"}, {\"name\": \"ТГПУ им.Л.Н. Толстого\", \"street\": null}, {\"name\": \"МБДОУ «ЦРР – Д/С № 2»\", \"street\": null}]}, \"bad\": 11, \"positive\": 2.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад № 79\", \"street\": \"улица Шевченко\", \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red&White, 27, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300012, Russia\"}, {\"name\": \"МБОУ \\\"Центр образования №42\\\"\", \"street\": \"улица Николая Руднева\", \"bad\": \"Пивовар, 54, улица Николая Руднева, Зеленстрой, Центральный территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300026, Russia\"}]}, \"index\": 442, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 443, \"rating\": 40}",
						"{\"good\": 16, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 8, \"transport\": {\"len\": 4, \"data\": [{\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"МБОУ \\\"Центр образования №18\\\" (дошкольное отделение)\", \"street\": \"улица Волкова\"}, {\"name\": \"Средняя школа № 49\", \"street\": \"улица Макара Мазая\"}, {\"name\": \"МБОУ \\\"Центр образования № 29\\\" (школа)\", \"street\": null}]}, \"bad\": 5, \"positive\": 3.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ \\\"Центр образования № 29\\\" (дошкольное отделение)\", \"street\": null, \"bad\": \"Pranzo, 11/8, улица Металлургов, Криволучье, Пролетарский территориальный округ, Tula, городской округ Тула, Tula Oblast, Central Federal District, 300016, Russia\"}]}, \"index\": 444, \"rating\": 60}",
						"{\"good\": 11, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 6, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Детский сад №146\", \"street\": null}, {\"name\": \"Школа №8\", \"street\": null}, {\"name\": \"Школа №31\", \"street\": null}, {\"name\": \"Вишенка\", \"street\": \"улица Макса Смирнова\"}, {\"name\": null, \"street\": null}]}, \"bad\": 8, \"positive\": -2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 445, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 446, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 447, \"rating\": 100}",
						"{\"good\": 21, \"park\": 4, \"cigarettes\": 0, \"alcohol\": 3, \"educational\": 6, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Детский сад 72\", \"street\": null}, {\"name\": \"Детский сад 11\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": \"улица Седова\"}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": null}, {\"name\": null, \"street\": \"улица Тульского Рабочего Полка\"}]}, \"bad\": 3, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 448, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 449, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 8, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Детский сад 11\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": \"улица Седова\"}, {\"name\": \"Центр образования 32\", \"street\": null}, {\"name\": \"Школа 32\", \"street\": null}, {\"name\": \"Гномики\", \"street\": null}, {\"name\": \"МДОУ, Центр образования 9 им. генерала А.Н. Ермакова\", \"street\": null}, {\"name\": \"Детский сад\", \"street\": \"улица Седова\"}]}, \"bad\": 2, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 450, \"rating\": 100}",
						"{\"good\": 14, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 3, \"educational\": 6, \"transport\": {\"len\": 6, \"data\": [{\"name\": null, \"street\": null}, {\"name\": \"Детский сад №46\", \"street\": \"улица Вересаева\"}, {\"name\": \"Центр образования №4\", \"street\": \"улица Рогова\"}, {\"name\": \"Центр образованія № 1 корпус Антошка\", \"street\": null}, {\"name\": \"Центр образования №1 корпус 1\", \"street\": \"улица Вересаева\"}, {\"name\": null, \"street\": null}]}, \"bad\": 6, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 451, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 452, \"rating\": 100}",
						"{\"good\": 48, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 11, \"educational\": 10, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Детский сад № 48\", \"street\": \"проспект Ленина\"}, {\"name\": \"Муниципальное бюджетное общеобразовательное учреждение \\\"Центр образования № 36\\\"\", \"street\": \"улица Мезенцева\"}, {\"name\": null, \"street\": \"улица Генерала Маргелова\"}, {\"name\": \"Детский сад № 121\", \"street\": null}, {\"name\": \"МБОУ ЦО N° 15\", \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": null}]}, \"bad\": 14, \"positive\": 10.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 453, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 454, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 455, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 456, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 457, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 458, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 459, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 460, \"rating\": 100}",
						"{\"good\": 6, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад (Центр образования №44)\", \"street\": null}, {\"name\": \"Центр образования №44 им. Маршала Советского Союза Г.К. Жукова\", \"street\": \"Одоевское шоссе\"}]}, \"bad\": 5, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 461, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 462, \"rating\": 100}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 463, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 464, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Детский сад общеразвивающего вида, с. Хрущёво\", \"street\": \"Совхозная улица\"}, {\"name\": null, \"street\": null}]}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 465, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 466, \"rating\": 40}"
					],
					geo: [54.1902, 37.610]
				},
				'Тверь':{
					send:{
						"points": [
							[
								56.8161756676116,
								35.89336189621147
							],
							[
								56.86681669811561,
								35.84908427629017
							],
							[
								56.91559950056393,
								35.99926937627163
							],
							[
								56.80796185154497,
								35.89464234787415
							],
							[
								56.87401972826474,
								35.726762985781804
							],
							[
								56.825579000256894,
								36.07370673600416
							],
							[
								56.83483737754675,
								35.97528565322379
							],
							[
								56.85541520875981,
								35.86299569169858
							],
							[
								56.90194451938221,
								35.92850904247468
							],
							[
								56.894156876178954,
								35.9904207459043
							],
							[
								56.848451395261456,
								36.045970227507745
							],
							[
								56.87453770410362,
								35.78726166433199
							],
							[
								56.89955985303714,
								36.062475837669
							],
							[
								56.89053365405353,
								35.94241927918516
							],
							[
								56.8850670359813,
								35.87047007695859
							],
							[
								56.80568268792421,
								35.81027561460385
							],
							[
								56.90097170504155,
								36.02581172447209
							],
							[
								56.820203508053766,
								36.00177748009116
							],
							[
								56.85166395900595,
								36.03334703711888
							],
							[
								56.84119972353164,
								35.73201978063583
							],
							[
								56.82160985930386,
								35.96520321979389
							],
							[
								56.824814875707105,
								35.95259064436297
							],
							[
								56.84537577650778,
								35.84033887730629
							],
							[
								56.85996151554532,
								35.813807044580095
							],
							[
								56.86668253088798,
								36.06747238825977
							],
							[
								56.89279408355669,
								35.80861193016556
							],
							[
								56.90877605845612,
								35.963877826406936
							],
							[
								56.8011257853517,
								35.85939592256855
							],
							[
								56.86448653979511,
								35.764627675915456
							],
							[
								56.894131309460626,
								35.77202391252901
							],
							[
								56.83299395698385,
								35.73333265619115
							],
							[
								56.823934455177856,
								35.83160357814135
							],
							[
								56.831658518720054,
								35.76985354911918
							],
							[
								56.88050292862186,
								35.91970701224086
							],
							[
								56.820266395697196,
								35.783766042777245
							],
							[
								56.83843783791121,
								36.02323602788972
							],
							[
								56.84764884871083,
								35.92481334643221
							],
							[
								56.887253141209044,
								35.73675880199733
							],
							[
								56.83078049214287,
								35.86685716150914
							],
							[
								56.878214903868795,
								35.83516649786383
							],
							[
								56.859060918050375,
								35.91091515592337
							],
							[
								56.849914980285405,
								35.79116954617345
							],
							[
								56.864497746033656,
								35.98284729800112
							],
							[
								56.91278511904428,
								36.07261889852846
							],
							[
								56.898297036744154,
								35.88052894420966
							],
							[
								56.86589140648709,
								35.94623738967899
							],
							[
								56.91419789879827,
								36.0359397752028
							],
							[
								56.86488985859107,
								36.043465652337346
							],
							[
								56.81799129124293,
								35.91730196080793
							],
							[
								56.83852115439891,
								35.805084842053695
							],
							[
								56.810218341447154,
								35.76116456458356
							],
							[
								56.85761033885459,
								35.72939244237244
							],
							[
								56.906834818714984,
								35.72149770740745
							],
							[
								56.831630396424345,
								35.98790200172038
							],
							[
								56.83804271331343,
								35.96266861227973
							],
							[
								56.87366384097821,
								35.88438426710798
							],
							[
								56.857240176755475,
								35.88695189058391
							],
							[
								56.850242033696304,
								36.06996763759906
							],
							[
								56.9128854898125,
								35.85396740182169
							],
							[
								56.8831218048895,
								36.06497512242837
							],
							[
								56.804762401411324,
								35.90724805642565
							],
							[
								56.89234738649073,
								35.966416482884775
							],
							[
								56.82199958069823,
								36.02574688086386
							],
							[
								56.88453701532515,
								36.02832552481021
							],
							[
								56.854874875933604,
								36.02072314780589
							],
							[
								56.90696028401026,
								35.939871301326036
							],
							[
								56.843047359480344,
								35.75593470907446
							],
							[
								56.82341279661085,
								35.989164403650534
							],
							[
								56.84401043761748,
								35.87690074681261
							],
							[
								56.810565771916664,
								36.03961253703536
							],
							[
								56.8777249357271,
								35.99294803167732
							],
							[
								56.86314679795039,
								35.80118626860093
							],
							[
								56.84720394207825,
								35.86428336728584
							],
							[
								56.87911950562417,
								35.956323139001924
							],
							[
								56.80334829562412,
								35.72597914365151
							],
							[
								56.91058758811904,
								35.987891417295614
							],
							[
								56.804319992979124,
								35.84679263469076
							],
							[
								56.84023170573368,
								36.04722175699041
							],
							[
								56.90284102740151,
								35.831281732197965
							],
							[
								56.88231987821631,
								35.94369249654561
							],
							[
								56.83121997463097,
								35.92736342526852
							],
							[
								56.87000558164764,
								35.836460375107414
							],
							[
								56.81115965850954,
								35.882035955970466
							],
							[
								56.82210253077722,
								35.80768127376323
							],
							[
								56.82879617892398,
								36.061090109206354
							],
							[
								56.81435582232984,
								35.86942888187968
							],
							[
								56.88910433704009,
								35.76070273758771
							],
							[
								56.89042788910392,
								35.724131408312125
							],
							[
								56.905140268357215,
								35.915871847359995
							],
							[
								56.800553815695515,
								36.01690283191925
							],
							[
								56.881401475717105,
								35.82253933559252
							],
							[
								56.897360200230445,
								35.977784425920014
							],
							[
								56.87771903026662,
								35.77463695795453
							],
							[
								56.84806468182399,
								35.98537566967493
							],
							[
								56.88825721248301,
								35.85783979221117
							],
							[
								56.849461710236326,
								35.948780229427065
							],
							[
								56.91599667266821,
								36.05997453154183
							],
							[
								56.808870992225124,
								35.79767219274869
							],
							[
								56.821191057242764,
								35.9046917870543
							],
							[
								56.84035513292256,
								35.82901640403934
							],
							[
								56.8120576545711,
								35.785068097314934
							],
							[
								56.908690695366694,
								35.74544967277861
							],
							[
								56.828018247474986,
								35.939977379132486
							],
							[
								56.83343011731292,
								36.01187486429161
							],
							[
								56.86043399569552,
								35.87433003519849
							],
							[
								56.89597669720832,
								35.79598082908763
							],
							[
								56.875486629346675,
								35.90835682515217
							],
							[
								56.8676659131578,
								35.75200678309745
							],
							[
								56.89730965462342,
								35.759393369132425
							],
							[
								56.853457230275964,
								36.057343265873065
							],
							[
								56.8348405628566,
								35.75724296293827
							],
							[
								56.83617174185898,
								35.720722636903304
							],
							[
								56.91471762966386,
								35.87795613350548
							],
							[
								56.80657437834617,
								35.93118469017024
							],
							[
								56.895548078473254,
								35.95378136140957
							],
							[
								56.82712404667569,
								35.818993786960775
							],
							[
								56.846227093297465,
								35.743320877277846
							],
							[
								56.845831756648735,
								35.90085351713984
							],
							[
								56.81235395597714,
								36.063585486015626
							],
							[
								56.8622573628079,
								35.898292089667606
							],
							[
								56.85309830877272,
								35.778552576695176
							],
							[
								56.87952814115615,
								36.01695002149746
							],
							[
								56.87168745972568,
								36.07885543053372
							],
							[
								56.90148752773793,
								35.86789417393569
							],
							[
								56.88092958638993,
								35.98031688423787
							],
							[
								56.913789584893934,
								35.975249920578456
							],
							[
								56.80519339593329,
								35.749869746931736
							],
							[
								56.86810109909229,
								36.03083729487616
							],
							[
								56.904676371887696,
								35.855258719796005
							],
							[
								56.85358601763459,
								35.83904656451449
							],
							[
								56.825289502708,
								35.79507270569932
							],
							[
								56.84124640374739,
								35.950050880054974
							],
							[
								56.802345222271995,
								36.04086412133904
							],
							[
								56.88871568244014,
								35.91842914010726
							],
							[
								56.89916807694388,
								36.00179454871507
							],
							[
								56.87956236185081,
								35.79858459869408
							],
							[
								56.88633435635754,
								36.05234040949891
							],
							[
								56.87183682388715,
								35.860418782008956
							],
							[
								56.91371936554968,
								35.75677304679367
							],
							[
								56.81070348107126,
								35.821584024933586
							],
							[
								56.82521149802219,
								36.01313261670616
							],
							[
								56.88774528374896,
								36.015691296520636
							],
							[
								56.91015701589163,
								35.92723220882318
							],
							[
								56.8173573804029,
								36.07495209652533
							],
							[
								56.82662044012696,
								35.97655063375534
							],
							[
								56.843543392387616,
								35.81640146101461
							],
							[
								56.858084146066,
								36.00809856073648
							],
							[
								56.81158682754722,
								35.94252024917783
							],
							[
								56.83663972732875,
								35.99925732486442
							],
							[
								56.86633043602496,
								35.78856481684088
							],
							[
								56.85039580207531,
								35.851665306130194
							],
							[
								56.89781786522482,
								35.819944848329676
							],
							[
								56.87868174443876,
								35.89572859460062
							],
							[
								56.80751255821033,
								35.83418866842404
							],
							[
								56.899157665186785,
								35.78334905163608
							],
							[
								56.81842605350735,
								35.759857890376075
							],
							[
								56.869512429796714,
								35.77594269047063
							],
							[
								56.819760628708586,
								35.723351948332365
							],
							[
								56.88551860381356,
								35.93106116319032
							],
							[
								56.84344493085021,
								36.0346011485708
							],
							[
								56.83442005719888,
								35.91474878393749
							],
							[
								56.8289543776769,
								35.842921940635186
							],
							[
								56.89228170556456,
								35.748074103869584
							],
							[
								56.81755034303094,
								35.85682112676726
							],
							[
								56.81557080969673,
								36.05097331668316
							],
							[
								56.88458640217291,
								35.809911494751006
							],
							[
								56.86407650092858,
								35.92226120958372
							],
							[
								56.8366829631861,
								35.78116035995407
							],
							[
								56.85127033765873,
								35.97275416084888
							],
							[
								56.90331601507385,
								35.89187946980288
							],
							[
								56.852663091788926,
								35.93615922697197
							],
							[
								56.80837482578545,
								35.73726811236793
							],
							[
								56.869896405244276,
								36.05484284802451
							],
							[
								56.824389179376205,
								35.892080928475785
							],
							[
								56.80091322963396,
								36.077441310964595
							],
							[
								56.90417864821577,
								36.01317232041516
							],
							[
								56.81524267498931,
								35.772463329468636
							],
							[
								56.9118650809377,
								35.73281520157347
							],
							[
								56.83380031597932,
								36.072460872878224
							],
							[
								56.86263843272341,
								35.74069763406666
							],
							[
								56.84305401016835,
								35.974020162357526
							],
							[
								56.91104911976111,
								35.82998576461421
							],
							[
								56.86362616947362,
								35.86170749671062
							],
							[
								56.91238980136478,
								35.79337495724954
							],
							[
								56.85667077965827,
								36.044718192725014
							],
							[
								56.88274466521168,
								35.785957986172775
							],
							[
								56.88812744367688,
								36.07636233000242
							],
							[
								56.80977645164737,
								35.918577777631555
							],
							[
								56.89874712276236,
								35.94114554754878
							],
							[
								56.808773346880166,
								36.015646600214566
							],
							[
								56.889545259275316,
								36.03970499449202
							],
							[
								56.859882681864335,
								36.0320924193225
							],
							[
								56.84940518426603,
								35.730706376135686
							],
							[
								56.91197542214451,
								35.95123752965734
							],
							[
								56.81018565222534,
								35.97907906504366
							],
							[
								56.84902788552823,
								35.888234925721804
							],
							[
								56.8827354241466,
								36.00431768127975
							],
							[
								56.83397368282643,
								35.85424425545452
							],
							[
								56.86817011783487,
								35.81250905164263
							],
							[
								56.874902320954,
								36.06622400755773
							],
							[
								56.901001457307174,
								35.80731184106577
							],
							[
								56.88413258964968,
								35.96768504222878
							],
							[
								56.809338216260315,
								35.85810878395071
							],
							[
								56.902336987520286,
								35.77071659898458
							],
							[
								56.82700595997914,
								36.037107853662
							],
							[
								56.90786356921984,
								35.84262258296417
							],
							[
								56.836233500656334,
								35.938705175000365
							],
							[
								56.869091460395396,
								35.933611223861696
							],
							[
								56.856774588782365,
								35.82642714360794
							],
							[
								56.828474832013114,
								35.78246346376214
							],
							[
								56.80016530098651,
								35.956396453081666
							],
							[
								56.875871484544305,
								35.75069641858457
							],
							[
								56.81937281032338,
								35.88075292966052
							],
							[
								56.80556010696044,
								36.0282557091706
							],
							[
								56.89191111412077,
								35.905796428468044
							],
							[
								56.886423919123075,
								35.83387209850762
							],
							[
								56.90237238587929,
								35.98915633710858
							],
							[
								56.85307472741261,
								35.99673513540899
							],
							[
								56.87502668660102,
								35.84779298039311
							],
							[
								56.85447434746315,
								35.960131959258305
							],
							[
								56.90277108095248,
								36.049835947855335
							],
							[
								56.813892761588235,
								35.80897870538494
							],
							[
								56.87310863172681,
								36.04221260603957
							],
							[
								56.82620582653777,
								35.91602562967983
							],
							[
								56.846730008166176,
								35.803785841336385
							],
							[
								56.865815186964916,
								35.72807797902741
							],
							[
								56.89545742920108,
								35.735444798765435
							],
							[
								56.8147898813524,
								35.929911448570905
							],
							[
								56.839847691606415,
								35.98663909049751
							],
							[
								56.881875213308476,
								35.88309967814564
							],
							[
								56.86545216201635,
								35.885668337816625
							],
							[
								56.85846243502438,
								36.068720264838845
							],
							[
								56.82160779015322,
								35.74725178120407
							],
							[
								56.8726927792937,
								35.76331989066136
							],
							[
								56.8913409823615,
								36.0637257325671
							],
							[
								56.90056187620375,
								35.96514741104728
							],
							[
								56.83214494661947,
								35.830310251724555
							],
							[
								56.8927545136643,
								36.02706887857838
							],
							[
								56.91517313746475,
								35.938596540206305
							],
							[
								56.85125385029343,
								35.75462592802468
							],
							[
								56.83260238650578,
								35.890799444356354
							],
							[
								56.81878601793018,
								36.03836044791112
							],
							[
								56.86727392684749,
								35.90963624862121
							],
							[
								56.83986598278599,
								35.76854787035619
							],
							[
								56.866301544833746,
								36.006838776426676
							],
							[
								56.90650748718467,
								35.87924279861019
							],
							[
								56.867702075914046,
								35.9702206246726
							],
							[
								56.81155461449178,
								35.724665810346686
							],
							[
								56.89144574283976,
								35.84520882507546
							],
							[
								56.83943456423724,
								35.9260886429469
							],
							[
								56.858606403162845,
								35.85037505143131
							],
							[
								56.90738394256736,
								36.00053221763217
							],
							[
								56.80413238889008,
								36.06483241970698
							],
							[
								56.83031199515837,
								35.80638331942433
							],
							[
								56.837016834117016,
								36.059841665481606
							],
							[
								56.82256830955464,
								35.86814328076997
							],
							[
								56.846258683037284,
								35.96140054161153
							],
							[
								56.91423302353858,
								35.8173482659205
							],
							[
								56.89373171524533,
								35.92978536049338
							],
							[
								56.915569433292696,
								35.780738010693646
							],
							[
								56.885925323598656,
								35.77333069874645
							],
							[
								56.88594105935066,
								35.99168464399116
							],
							[
								56.85628136674407,
								35.98411173894529
							],
							[
								56.908334369712335,
								35.903233963377836
							],
							[
								56.87685632924034,
								35.871757248898
							],
							[
								56.85767671126051,
								35.94750906607148
							],
							[
								56.811984942052504,
								36.00303679563459
							],
							[
								56.86309293691557,
								36.01946594683359
							],
							[
								56.81339297568428,
								35.966469757255666
							],
							[
								56.84856501375443,
								35.82772203477184
							],
							[
								56.816598654821796,
								35.95385975866015
							],
							[
								56.841648431972565,
								36.01061660436254
							],
							[
								56.83716522974432,
								35.84163066924201
							],
							[
								56.87135473330232,
								35.79988569595185
							],
							[
								56.904183403352775,
								35.79467815610597
							],
							[
								56.88369902521528,
								35.90707688520498
							],
							[
								56.90551466423733,
								35.75808347230726
							],
							[
								56.812531758961434,
								35.84550292304669
							],
							[
								56.82345074934359,
								35.77115870205127
							],
							[
								56.85627999365601,
								35.7659349340712
							],
							[
								56.824787884955164,
								35.73464500311975
							],
							[
								56.81572365893053,
								35.832896383603405
							],
							[
								56.83021886153695,
								36.024491707612775
							],
							[
								56.87228986800714,
								35.92098436862938
							],
							[
								56.80196780240991,
								35.98034251641453
							],
							[
								56.87904854557731,
								35.73807227541218
							],
							[
								56.80337066146704,
								35.94379091570836
							],
							[
								56.8205752194329,
								36.06233804928317
							],
							[
								56.889609824204086,
								35.82124235369655
							],
							[
								56.85084760328805,
								35.91219354736967
							],
							[
								56.84170679328942,
								35.792471123629404
							],
							[
								56.90456620110685,
								36.07386721351606
							],
							[
								56.8900862786746,
								35.88181457061714
							],
							[
								56.81340074536718,
								35.74856102754549
							],
							[
								56.90598065964094,
								36.03719535563649
							],
							[
								56.87631921035686,
								36.02958166347405
							],
							[
								56.82940492862323,
								35.90341287950754
							],
							[
								56.86179595279206,
								35.83775373055288
							],
							[
								56.90918858912417,
								36.02455406218458
							],
							[
								56.80294620255947,
								35.88331846547952
							],
							[
								56.802010324906874,
								35.7624707128719
							],
							[
								56.898631507979,
								35.72281482344906
							],
							[
								56.829826438624615,
								35.96393617157117
							],
							[
								56.86864531570089,
								35.87304390154035
							],
							[
								56.91607202038217,
								35.84132867857414
							],
							[
								56.89692812912944,
								35.91715075191745
							],
							[
								56.861676970575495,
								36.056093309381026
							],
							[
								56.8877696832636,
								35.79728297651145
							],
							[
								56.90376190412239,
								35.952509702458414
							],
							[
								56.894552872136224,
								36.05108843171957
							],
							[
								56.88004717166775,
								35.85912954728031
							],
							[
								56.813779995728304,
								36.02700154794818
							],
							[
								56.8959621195464,
								36.014432062928925
							],
							[
								56.84665650948779,
								36.02197984138933
							],
							[
								56.85443291616577,
								35.742009519943544
							],
							[
								56.81519489249913,
								35.990426296594784
							],
							[
								56.83579820021024,
								35.87818532539314
							],
							[
								56.81980268966094,
								35.94124907042205
							],
							[
								56.838992369761705,
								35.865570523785195
							],
							[
								56.85493855612752,
								35.80248631695724
							],
							[
								56.869508505641015,
								35.994210909270635
							],
							[
								56.87990760484998,
								36.077609132110304
							],
							[
								56.90602559844706,
								35.81864681917628
							],
							[
								56.87090475908941,
								35.95759325826241
							],
							[
								56.90736370338948,
								35.78204379462429
							],
							[
								56.8266334607547,
								35.75855068993318
							],
							[
								56.832011711408164,
								36.04847278147762
							],
							[
								56.827966337941845,
								35.722037557290655
							],
							[
								56.89463262707807,
								35.832577176723994
							],
							[
								56.874105795583276,
								35.94496519994027
							],
							[
								56.84263398289327,
								35.913471423270856
							],
							[
								56.80376607225306,
								36.004295603539404
							],
							[
								56.83349830065275,
								35.79377217669952
							],
							[
								56.80517578809907,
								35.96773578426403
							],
							[
								56.880898711819434,
								35.76201157799136
							],
							[
								56.82576216533061,
								35.855532950705964
							],
							[
								56.8822239624218,
								35.72544746231649
							],
							[
								56.873192820096214,
								35.823835794333036
							],
							[
								56.88914504679102,
								35.97905091080249
							],
							[
								56.84489078888349,
								35.77985673103711
							],
							[
								56.85948635968493,
								35.971487648389946
							],
							[
								56.9115268234727,
								35.89059539170171
							],
							[
								56.86087742907434,
								35.93488548245695
							],
							[
								56.90777841658362,
								36.06122543742902
							],
							[
								56.80066128035262,
								35.79897115142797
							],
							[
								56.87811553394926,
								36.053591881498804
							],
							[
								56.81297688139446,
								35.905970179256926
							],
							[
								56.85175260695205,
								35.81510451426574
							],
							[
								56.91239486942434,
								36.01191206867198
							],
							[
								56.80384860896752,
								35.78636962769062
							],
							[
								56.87084364263801,
								35.739385219329066
							],
							[
								56.900486354533946,
								35.74676215303052
							],
							[
								56.84485737993613,
								35.997996484568596
							],
							[
								56.85222236955682,
								35.875615650185125
							],
							[
								56.88689347522446,
								35.89444607093982
							],
							[
								56.84523718467874,
								36.058592717805205
							],
							[
								56.859460034963384,
								35.75331661947155
							],
							[
								56.896346975873456,
								36.075115023905816
							],
							[
								56.81891391619364,
								35.8202891667868
							],
							[
								56.88733394552965,
								35.95505250682081
							],
							[
								56.81699257443349,
								36.01438986191197
							],
							[
								56.89776311302238,
								36.038450428630796
							],
							[
								56.83802096445094,
								35.74463170638762
							],
							[
								56.8184031982421,
								35.97781510425956
							],
							[
								56.837618495202854,
								35.902133456306274
							],
							[
								56.823791412618085,
								36.04972330127384
							],
							[
								56.85404471262801,
								35.89957306169731
							],
							[
								56.87131069210073,
								36.018208238166245
							],
							[
								56.842184895185596,
								35.852955040700216
							],
							[
								56.86346700863697,
								36.08010122557666
							],
							[
								56.89327743559131,
								35.86918238540895
							],
							[
								56.872713819359916,
								35.981582346534644
							],
							[
								56.81658150777816,
								35.7359568217395
							],
							[
								56.90557504637561,
								35.976517429281664
							],
							[
								56.83522559773022,
								36.0358547539835
							],
							[
								56.896466946000444,
								35.85654951648772
							],
							[
								56.87730518541939,
								35.93233645087626
							],
							[
								56.84444844887197,
								35.93743245771661
							],
							[
								56.8649838576738,
								35.8251317302332
							],
							[
								56.80614303080144,
								35.87071396515005
							],
							[
								56.81708039978787,
								35.796372710944034
							],
							[
								56.842021327236885,
								36.07121450684433
							],
							[
								56.88407674879063,
								35.74938552561473
							],
							[
								56.82758565766792,
								35.879469386238554
							],
							[
								56.833030792126664,
								35.95132101826404
							],
							[
								56.90012289573059,
								35.90451545462969
							],
							[
								56.8909513190168,
								35.78465378204647
							],
							[
								56.89095190402609,
								36.003056369828336
							],
							[
								56.86129176942525,
								35.99547327707872
							],
							[
								56.913352099791105,
								35.914592426123285
							],
							[
								56.88323636828655,
								35.846501163426254
							],
							[
								56.86268970625814,
								35.958862864911545
							],
							[
								56.91098898247358,
								36.04858295760048
							],
							[
								56.8024927416414,
								35.822878361714835
							],
							[
								56.84986644166794,
								36.00935783661294
							],
							[
								56.80913545675077,
								36.07619695474458
							],
							[
								56.83533387218459,
								35.81769788514147
							],
							[
								56.807034295989894,
								35.77376743168726
							],
							[
								56.90366140922131,
								35.734130265397326
							],
							[
								56.82842176992356,
								36.00051765660316
							],
							[
								56.82300508022502,
								35.928637693706705
							],
							[
								56.85812286130806,
								35.789867444015954
							],
							[
								56.909208523092246,
								35.80601122713534
							],
							[
								56.87046970685571,
								35.897010600739236
							],
							[
								56.910542357445564,
								35.76940875779524
							],
							[
								56.82981452995868,
								35.74594200759053
							],
							[
								56.86130552252129,
								35.7772478966119
							],
							[
								56.90969731208884,
								35.86660544222513
							],
							[
								56.80156130808418,
								35.91985308046024
							],
							[
								56.82074322063833,
								35.844212691799065
							],
							[
								56.80697668442239,
								35.99168768085962
							],
							[
								56.80838212980387,
								35.95512836146374
							],
							[
								56.84081528866743,
								35.889517443542104
							],
							[
								56.807349902977506,
								36.05222282800951
							],
							[
								56.876378413488176,
								35.8112105351381
							],
							[
								56.85586282771888,
								35.92353753541453
							],
							[
								56.84807314120882,
								35.767241665445766
							],
							[
								56.87451863763824,
								36.00557848337676
							],
							[
								56.89510489888029,
								35.893163029444715
							],
							[
								56.87591748601322,
								35.96895308938843
							],
							[
								56.80016783930977,
								35.73857887532243
							],
							[
								56.88132709873253,
								36.04095905352634
							],
							[
								56.89965480992831,
								35.843915965026305
							]
						],
						"dist": 1000
					},
					res:[
						"{\"good\": 40, \"park\": 10, \"cigarettes\": 3, \"alcohol\": 6, \"educational\": 13, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 17, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 0, \"rating\": 100}",
						"{\"good\": 27, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": 6.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 1, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 2, \"rating\": 40}",
						"{\"good\": 13, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 3, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 4, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 5, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 6, \"rating\": 40}",
						"{\"good\": 38, \"park\": 16, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 19, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 12, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 7, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 8, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 9, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 10, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 11, \"rating\": 100}",
						"{\"good\": 11, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 12, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 13, \"rating\": 100}",
						"{\"good\": 14, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 6, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад № 130\", \"street\": \"улица Веселова\"}, {\"name\": \"Школа № 21\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 1, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 14, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 15, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 16, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 17, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 18, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 19, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 20, \"rating\": 100}",
						"{\"good\": 6, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 21, \"rating\": 100}",
						"{\"good\": 39, \"park\": 10, \"cigarettes\": 4, \"alcohol\": 10, \"educational\": 23, \"transport\": {\"len\": 10, \"data\": [{\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"Художественная школа им. В.А. Серова\", \"street\": null}, {\"name\": \"Детский сад № 89\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 144\", \"street\": null}, {\"name\": \"Школа № 38\", \"street\": null}, {\"name\": \"Детский сад № 24\", \"street\": null}, {\"name\": \"Тверской полиграфический колледж\", \"street\": null}, {\"name\": \"Детский сад № 111\", \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}]}, \"bad\": 13, \"positive\": 6.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Школа № 30\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"21, проспект Ленина, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}]}, \"index\": 22, \"rating\": 60}",
						"{\"good\": 2, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 23, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 24, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 25, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 26, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 27, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 28, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 29, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 30, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 31, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 32, \"rating\": 40}",
						"{\"good\": 13, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 4, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 33, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 34, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 35, \"rating\": 40}",
						"{\"good\": 101, \"park\": 21, \"cigarettes\": 6, \"alcohol\": 27, \"educational\": 43, \"transport\": {\"len\": 29, \"data\": [{\"name\": \"Детский сад №40\", \"street\": null}, {\"name\": \"Детский сад № 101\", \"street\": null}, {\"name\": \"ТИЭМ\", \"street\": null}, {\"name\": \"Учебно-информационный центр \\\"Просвет\\\"\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад \\\"Я и моя семья\\\"\", \"street\": null}, {\"name\": \"МОУ СОШ №27 Начальная школа\", \"street\": null}, {\"name\": \"Российская академия народного хозяйства и государственной службы при Президенте РФ\", \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": null, \"street\": \"улица Салтыкова-Щедрина\"}, {\"name\": \"ТОИУУ\", \"street\": null}, {\"name\": \"Детский сад № 67\", \"street\": null}, {\"name\": \"Детский сад № 2\", \"street\": null}, {\"name\": \"Детский сад № 23\", \"street\": null}, {\"name\": \"Детский сад № 33\", \"street\": null}, {\"name\": \"Детский сад № 1\", \"street\": null}, {\"name\": null, \"street\": \"площадь Славы\"}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": \"Детский сад № 62\", \"street\": null}, {\"name\": \"Детский сад № 135\", \"street\": null}, {\"name\": \"Многопрофильная гимназия №12\", \"street\": null}, {\"name\": \"Музыкальная школа имени М. П. Мусоргского\", \"street\": null}, {\"name\": \"Детский сад № 8\", \"street\": null}, {\"name\": \"Детская школа искусств №1 имени М.П.Мусоргского\", \"street\": null}, {\"name\": \"Школа № 26\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null}, {\"name\": \"Тверской государственный университет\", \"street\": null}]}, \"bad\": 44, \"positive\": 6.5, \"violations\": {\"len\": 20, \"data\": [{\"name\": \"Детский сад № 23\", \"street\": null, \"bad\": \"Лит.Ра, 8 к2, улица Резинстроя, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170008, Russia\"}, {\"name\": \"Гимназия № 10\", \"street\": null, \"bad\": \"Московская улица, Московский район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Школа № 36\", \"street\": null, \"bad\": \"Restro Boom, Волоколамский проспект, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 26\", \"street\": null, \"bad\": \"Милано, 46/30, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170037, Russia\"}, {\"name\": \"Тверской технологический колледж\", \"street\": null, \"bad\": \"ВыгоДА, 34, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170008, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Люблин Хмель, улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Папа жарит мясо, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Chicken House, 20, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Столовая ТвГУ, 46, Симеоновская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Coffee Point, 25, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Black Star Burger, 18, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 36, \"rating\": 60}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 37, \"rating\": 100}",
						"{\"good\": 27, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 9, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null}, {\"name\": \"Пониматика\", \"street\": null}, {\"name\": null, \"street\": \"улица Степана Горобца\"}, {\"name\": \"Детский сад № 50 (167)\", \"street\": null}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования \\\"Брусилово\\\"\", \"street\": null}]}, \"bad\": 7, \"positive\": 6.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null, \"bad\": \"Red&White, 25 к1, Оснабрюкская улица, Брусилово, Мамулино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170027, Russia\"}]}, \"index\": 38, \"rating\": 60}",
						"{\"good\": 35, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 5, \"educational\": 22, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": 10.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 39, \"rating\": 100}",
						"{\"good\": 90, \"park\": 39, \"cigarettes\": 13, \"alcohol\": 42, \"educational\": 31, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"Детский сад №100\", \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"Тверская государственная медицинская академия. Кафедра педиатрии\", \"street\": null}, {\"name\": \"Детский сад №40\", \"street\": null}, {\"name\": \"Российский заочный институт текстильной и лёгкой промышленности\", \"street\": null}, {\"name\": \"Тверской художественный колледж им. Венецианова\", \"street\": null}, {\"name\": \"ГУ СКОШ № 1\", \"street\": \"улица Крылова\"}, {\"name\": \"Кванториум\", \"street\": null}, {\"name\": \"Детский сад № 140\", \"street\": null}, {\"name\": \"Школа №35\", \"street\": null}, {\"name\": null, \"street\": \"улица Салтыкова-Щедрина\"}, {\"name\": null, \"street\": \"площадь Славы\"}, {\"name\": \"Детский сад № 135\", \"street\": null}, {\"name\": \"Многопрофильная гимназия №12\", \"street\": null}, {\"name\": \"Музыкальная школа имени М. П. Мусоргского\", \"street\": null}, {\"name\": \"Школа № 16\", \"street\": null}, {\"name\": \"Детский сад № 134\", \"street\": null}, {\"name\": \"Детский сад № 8\", \"street\": null}, {\"name\": \"Детская школа искусств №1 имени М.П.Мусоргского\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской государственный университет\", \"street\": null}]}, \"bad\": 65, \"positive\": -20.0, \"violations\": {\"len\": 19, \"data\": [{\"name\": \"Тверской торгово-экономический колледж\", \"street\": null, \"bad\": \"Вкус и цвет, 5, набережная Степана Разина, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет\", \"street\": \"набережная Афанасия Никитина\", \"bad\": \"Beerlogic, 24, набережная Афанасия Никитина, Заволжский район, Tver, Tver Oblast, Central Federal District, 170026, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Люблин Хмель, улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"KFC, 2, Тверской проспект, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Burger King, 2, Тверской проспект, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Папа жарит мясо, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Chicken House, 20, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Столовая ТвГУ, 46, Симеоновская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Coffee Point, 25, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Black Star Burger, 18, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 40, \"rating\": 0}",
						"{\"good\": 30, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 4, \"educational\": 12, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 6, \"positive\": 9.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 41, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 42, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 43, \"rating\": 40}",
						"{\"good\": 12, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 44, \"rating\": 100}",
						"{\"good\": 16, \"park\": 4, \"cigarettes\": 5, \"alcohol\": 7, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 45, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 46, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 47, \"rating\": 100}",
						"{\"good\": 40, \"park\": 9, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 13, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 15.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 48, \"rating\": 100}",
						"{\"good\": 19, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 10, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 49, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 50, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 51, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 52, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 53, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 54, \"rating\": 40}",
						"{\"good\": 37, \"park\": 8, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 12, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"ГКОУ \\\"Тверская школа №4\\\"\", \"street\": null}, {\"name\": \"Детский сад № 122\", \"street\": null}, {\"name\": \"Детский сад № 164\", \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Тверской машиностроительный колледж\", \"street\": null}, {\"name\": \"Детский сад № 154\", \"street\": null}, {\"name\": \"Школа №29\", \"street\": \"переулок Никитина\"}]}, \"bad\": 3, \"positive\": 15.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 55, \"rating\": 100}",
						"{\"good\": 64, \"park\": 14, \"cigarettes\": 2, \"alcohol\": 10, \"educational\": 22, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 17, \"positive\": 15.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 56, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 57, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 58, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 59, \"rating\": 40}",
						"{\"good\": 14, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 60, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 61, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 62, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 63, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 64, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 65, \"rating\": 40}",
						"{\"good\": 9, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 66, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 67, \"rating\": 40}",
						"{\"good\": 27, \"park\": 6, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 12, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 68, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 69, \"rating\": 40}",
						"{\"good\": 8, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 70, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 71, \"rating\": 100}",
						"{\"good\": 38, \"park\": 15, \"cigarettes\": 1, \"alcohol\": 6, \"educational\": 18, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"НОУ \\\"Тверская епархиальная православная средняя общеобразовательная школа во имя свт. Тихона Задонского\\\"\", \"street\": null}, {\"name\": \"Тверской институт экологии и права\", \"street\": null}, {\"name\": \"Школа № 5, дошкольное отделение\", \"street\": \"Тракторная улица\"}, {\"name\": \"Школа № 38\", \"street\": null}, {\"name\": \"Школа № 9\", \"street\": null}, {\"name\": \"Школа № 9, детский сад\", \"street\": null}, {\"name\": \"Специальная коррекционная общеобразовательная школа №2\", \"street\": null}]}, \"bad\": 11, \"positive\": 8.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Тверской лицей\", \"street\": null, \"bad\": \"Ароматный мир, 9, проспект Калинина, Двор Пролетарки, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170001, Russia\"}]}, \"index\": 72, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 73, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 74, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 75, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 76, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 77, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 78, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 79, \"rating\": 40}",
						"{\"good\": 44, \"park\": 5, \"cigarettes\": 13, \"alcohol\": 18, \"educational\": 29, \"transport\": {\"len\": 19, \"data\": [{\"name\": \"Тверской филиал ГОУ ВПО Инжэкон\", \"street\": null}, {\"name\": \"Детский сад № 168 \\\"Чебурашка\\\"\", \"street\": null}, {\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 159\", \"street\": null}, {\"name\": \"Школа №43\", \"street\": null}, {\"name\": \"Детский сад № 148\", \"street\": null}, {\"name\": \"Детский сад №15\", \"street\": null}, {\"name\": \"Дошкольное отделение школы №33\", \"street\": null}, {\"name\": \"Детский сад № 114\", \"street\": null}, {\"name\": \"Детский сад № 105\", \"street\": null}, {\"name\": \"Школа № 33\", \"street\": null}, {\"name\": \"Детский сад № 33\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 137\", \"street\": \"Зелёный проезд\"}, {\"name\": \"Открытая (сменная) школа № 5\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 90\", \"street\": null}, {\"name\": \"Школа № 39\", \"street\": null}]}, \"bad\": 22, \"positive\": 0.0, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Детский сад №15\", \"street\": null, \"bad\": \"улица Терещенко, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Детский сад № 114\", \"street\": null, \"bad\": \"Овощи, улица Фадеева, Южный, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 33\", \"street\": null, \"bad\": \"Ипподромная улица, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 26\", \"street\": null, \"bad\": \"Милано, 46/30, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170037, Russia\"}]}, \"index\": 80, \"rating\": 0}",
						"{\"good\": 23, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 81, \"rating\": 100}",
						"{\"good\": 16, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 82, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 83, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 84, \"rating\": 40}",
						"{\"good\": 15, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 6, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 85, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 86, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 87, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 88, \"rating\": 100}",
						"{\"good\": 11, \"park\": 2, \"cigarettes\": 3, \"alcohol\": 4, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 89, \"rating\": 100}",
						"{\"good\": 14, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 11, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 90, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 91, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 92, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 93, \"rating\": 40}",
						"{\"good\": 24, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 8, \"transport\": {\"len\": 4, \"data\": [{\"name\": null, \"street\": \"улица Седова\"}, {\"name\": \"Школа № 50\", \"street\": null}, {\"name\": \"Детский сад № 145\", \"street\": null}, {\"name\": \"Детский сад № 149\", \"street\": null}]}, \"bad\": 2, \"positive\": 10.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 94, \"rating\": 100}",
						"{\"good\": 20, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 7, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 95, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 96, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 97, \"rating\": 40}",
						"{\"good\": 55, \"park\": 13, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 18, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 11, \"positive\": 16.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 98, \"rating\": 100}",
						"{\"good\": 17, \"park\": 5, \"cigarettes\": 5, \"alcohol\": 8, \"educational\": 12, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 99, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 100, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 101, \"rating\": 40}",
						"{\"good\": 20, \"park\": 1, \"cigarettes\": 6, \"alcohol\": 6, \"educational\": 14, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Детский сад № 168 \\\"Чебурашка\\\"\", \"street\": null}, {\"name\": \"Школа №24\", \"street\": null}, {\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 159\", \"street\": null}, {\"name\": \"Школа №43\", \"street\": null}, {\"name\": \"Детский сад № 148\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 137\", \"street\": \"Зелёный проезд\"}, {\"name\": \"Открытая (сменная) школа № 5\", \"street\": null}, {\"name\": \"Детский сад № 86\", \"street\": null}, {\"name\": \"Детский сад № 90\", \"street\": null}]}, \"bad\": 6, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 102, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 103, \"rating\": 40}",
						"{\"good\": 49, \"park\": 13, \"cigarettes\": 3, \"alcohol\": 11, \"educational\": 17, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 20, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 104, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 105, \"rating\": 40}",
						"{\"good\": 43, \"park\": 15, \"cigarettes\": 4, \"alcohol\": 9, \"educational\": 22, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 13, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 106, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 107, \"rating\": 40}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 108, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 109, \"rating\": 40}",
						"{\"good\": 10, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null}]}, \"bad\": 2, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 110, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 111, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 112, \"rating\": 100}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 113, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 114, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 115, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 116, \"rating\": 100}",
						"{\"good\": 100, \"park\": 18, \"cigarettes\": 4, \"alcohol\": 14, \"educational\": 33, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 27, \"positive\": 23.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 117, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 118, \"rating\": 40}",
						"{\"good\": 96, \"park\": 33, \"cigarettes\": 12, \"alcohol\": 38, \"educational\": 32, \"transport\": {\"len\": 21, \"data\": [{\"name\": \"Детский сад № 122\", \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"Детский сад №40\", \"street\": null}, {\"name\": \"Российский заочный институт текстильной и лёгкой промышленности\", \"street\": null}, {\"name\": \"Тверской филиал Московского гуманитарно-экономического института\", \"street\": null}, {\"name\": \"Тверской художественный колледж им. Венецианова\", \"street\": null}, {\"name\": \"Кванториум\", \"street\": null}, {\"name\": \"Детский сад № 164\", \"street\": null}, {\"name\": \"Детский сад № 74\", \"street\": null}, {\"name\": \"Детский сад № 140\", \"street\": null}, {\"name\": \"Школа №35\", \"street\": null}, {\"name\": \"Школа № 18\", \"street\": null}, {\"name\": \"Детский сад № 127\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №19\", \"street\": null}, {\"name\": \"Школа № 16\", \"street\": null}, {\"name\": \"Детский сад № 11\", \"street\": null}, {\"name\": \"Детский сад №38\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской государственный университет\", \"street\": null}]}, \"bad\": 64, \"positive\": -16.0, \"violations\": {\"len\": 21, \"data\": [{\"name\": \"Тверской торгово-экономический колледж\", \"street\": null, \"bad\": \"Вкус и цвет, 5, набережная Степана Разина, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской филиал Московского гуманитарно-экономического института\", \"street\": null, \"bad\": \"37, улица Дмитрия Донского, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}, {\"name\": \"Детский сад № 7\", \"street\": null, \"bad\": \"Ароматный мир, 28, улица Софьи Перовской, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}, {\"name\": \"Бывшее Тверское Суворовское военное училище\", \"street\": null, \"bad\": \"Суворов, набережная реки Тьмаки, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет\", \"street\": \"набережная Афанасия Никитина\", \"bad\": \"Beerlogic, 24, набережная Афанасия Никитина, Заволжский район, Tver, Tver Oblast, Central Federal District, 170026, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Люблин Хмель, улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"KFC, 2, Тверской проспект, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Папа жарит мясо, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Chicken House, 20, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Столовая ТвГУ, 46, Симеоновская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Coffee Point, 25, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Black Star Burger, 18, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 119, \"rating\": 0}",
						"{\"good\": 12, \"park\": 0, \"cigarettes\": 3, \"alcohol\": 3, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 120, \"rating\": 100}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 121, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 122, \"rating\": 40}",
						"{\"good\": 9, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 123, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 124, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 125, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 126, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 127, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 128, \"rating\": 40}",
						"{\"good\": 33, \"park\": 7, \"cigarettes\": 3, \"alcohol\": 11, \"educational\": 24, \"transport\": {\"len\": 13, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (корпус Б)\", \"street\": null}, {\"name\": \"Художественная школа им. В.А. Серова\", \"street\": null}, {\"name\": \"Детский сад № 89\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Школа № 38\", \"street\": null}, {\"name\": \"Детский сад №162\", \"street\": null}, {\"name\": \"Детский сад №79\", \"street\": null}, {\"name\": \"Детский сад № 24\", \"street\": null}, {\"name\": \"Тверской полиграфический колледж\", \"street\": null}, {\"name\": \"Школа № 20\", \"street\": null}, {\"name\": \"Детский сад № 111\", \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 14, \"positive\": 2.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Школа № 30\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"21, проспект Ленина, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}]}, \"index\": 129, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 130, \"rating\": 40}",
						"{\"good\": 17, \"park\": 2, \"cigarettes\": 4, \"alcohol\": 3, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 131, \"rating\": 100}",
						"{\"good\": 8, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 132, \"rating\": 100}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 5, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": -2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 133, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 134, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 135, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 136, \"rating\": 100}",
						"{\"good\": 25, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 11, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Детский сад № 26\", \"street\": null}, {\"name\": \"Детский сад № 130\", \"street\": \"улица Веселова\"}, {\"name\": \"Школа № 40, филиал\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}, {\"name\": \"Детский сад № 138\", \"street\": null}]}, \"bad\": 4, \"positive\": 8.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад № 138\", \"street\": null, \"bad\": \"Литра, 47, Петербургское шоссе, Юность, Заволжский район, Tver, Tver Oblast, Central Federal District, 170020, Russia\"}]}, \"index\": 137, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 138, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 139, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 140, \"rating\": 40}",
						"{\"good\": 4, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 141, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 142, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 143, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 144, \"rating\": 40}",
						"{\"good\": 27, \"park\": 7, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 16, \"transport\": {\"len\": 14, \"data\": [{\"name\": \"Художественная школа им. В.А. Серова\", \"street\": null}, {\"name\": \"Дошкольное отделение СОШ №4\", \"street\": null}, {\"name\": \"МОУ СОШ №4\", \"street\": null}, {\"name\": \"Детский сад № 93\", \"street\": null}, {\"name\": \"Детский сад №97\", \"street\": null}, {\"name\": \"Начальная школа № 20\", \"street\": null}, {\"name\": null, \"street\": \"проспект Ленина\"}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}]}, \"bad\": 5, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 145, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 146, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 147, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 148, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 149, \"rating\": 40}",
						"{\"good\": 44, \"park\": 12, \"cigarettes\": 5, \"alcohol\": 9, \"educational\": 24, \"transport\": {\"len\": 15, \"data\": [{\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"НОУ \\\"Тверская епархиальная православная средняя общеобразовательная школа во имя свт. Тихона Задонского\\\"\", \"street\": null}, {\"name\": \"Тверской институт экологии и права\", \"street\": null}, {\"name\": \"Тверской Государственный Технический Университет (корпус Б)\", \"street\": null}, {\"name\": \"Детский сад № 89\", \"street\": null}, {\"name\": \"Школа № 38\", \"street\": null}, {\"name\": \"Школа № 1\", \"street\": null}, {\"name\": \"Детский сад №79\", \"street\": null}, {\"name\": \"Начальная школа № 1\", \"street\": null}, {\"name\": \"Детский сад № 24\", \"street\": null}, {\"name\": \"Тверской полиграфический колледж\", \"street\": null}, {\"name\": \"Школа № 20\", \"street\": null}, {\"name\": \"Детский сад № 111\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Специальная коррекционная общеобразовательная школа №2\", \"street\": null}]}, \"bad\": 15, \"positive\": 7.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Школа № 30\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}]}, \"index\": 150, \"rating\": 60}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 151, \"rating\": 40}",
						"{\"good\": 41, \"park\": 7, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 20, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"ГКОУ \\\"Тверская школа №4\\\"\", \"street\": null}, {\"name\": \"Детская музыкальная школа\", \"street\": null}, {\"name\": \"Детский сад № 164\", \"street\": null}, {\"name\": \"Детский сад № 74\", \"street\": null}, {\"name\": \"Школа № 46\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №125\", \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Тверской машиностроительный колледж\", \"street\": null}, {\"name\": \"Детский сад № 154\", \"street\": null}, {\"name\": \"Школа №29\", \"street\": \"переулок Никитина\"}]}, \"bad\": 8, \"positive\": 12.5, \"violations\": {\"len\": 4, \"data\": [{\"name\": \"Детская музыкальная школа\", \"street\": null, \"bad\": \"Ароматный мир, 13, улица Мусоргского, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}, {\"name\": \"Детский сад № 81\", \"street\": null, \"bad\": \"Пиво/сигареты, бульвар Шмидта, Соминка, Заволжский район, Tver, Tver Oblast, Central Federal District, 170042, Russia\"}, {\"name\": \"Детский сад № 81\", \"street\": null, \"bad\": \"бульвар Шмидта, Соминка, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Ароматный мир, 13, улица Мусоргского, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}]}, \"index\": 152, \"rating\": 60}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 153, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 154, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 155, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 156, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 157, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 158, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 159, \"rating\": 40}",
						"{\"good\": 92, \"park\": 11, \"cigarettes\": 14, \"alcohol\": 28, \"educational\": 43, \"transport\": {\"len\": 29, \"data\": [{\"name\": \"Детский сад № 101\", \"street\": null}, {\"name\": \"ТИЭМ\", \"street\": null}, {\"name\": \"Учебно-информационный центр \\\"Просвет\\\"\", \"street\": null}, {\"name\": \"ТвГУ 4-й корпус (Филологический факультет)\", \"street\": null}, {\"name\": \"ТвГУ 5-й корпус\", \"street\": null}, {\"name\": \"Детский сад № 67\", \"street\": null}, {\"name\": \"Детский сад № 2\", \"street\": null}, {\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад №15\", \"street\": null}, {\"name\": \"Дошкольное отделение школы №33\", \"street\": null}, {\"name\": \"Детский сад № 114\", \"street\": null}, {\"name\": \"Детский сад № 105\", \"street\": null}, {\"name\": \"Школа № 33\", \"street\": null}, {\"name\": \"Детский сад № 33\", \"street\": null}, {\"name\": \"Детский сад № 129\", \"street\": null}, {\"name\": \"Детский сад № 1\", \"street\": null}, {\"name\": \"Гимназия №44\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №65\", \"street\": null}, {\"name\": \"ТвГУ 3-й корпус\", \"street\": null}, {\"name\": \"Детский сад №55\", \"street\": null}, {\"name\": \"Детский сад № 137\", \"street\": \"Зелёный проезд\"}, {\"name\": null, \"street\": null}, {\"name\": \"Открытая (сменная) школа № 5\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 90\", \"street\": null}, {\"name\": \"Школа № 39\", \"street\": null}, {\"name\": \"Школа №42\", \"street\": null}]}, \"bad\": 35, \"positive\": 11.0, \"violations\": {\"len\": 7, \"data\": [{\"name\": \"Детский сад №15\", \"street\": null, \"bad\": \"улица Фадеева, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Детский сад №15\", \"street\": null, \"bad\": \"улица Терещенко, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Детский сад № 114\", \"street\": null, \"bad\": \"Овощи, улица Фадеева, Южный, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 33\", \"street\": null, \"bad\": \"Ипподромная улица, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 36\", \"street\": null, \"bad\": \"Restro Boom, Волоколамский проспект, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 26\", \"street\": null, \"bad\": \"Милано, 46/30, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170037, Russia\"}, {\"name\": \"Тверской технологический колледж\", \"street\": null, \"bad\": \"ВыгоДА, 34, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170008, Russia\"}]}, \"index\": 160, \"rating\": 60}",
						"{\"good\": 10, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 161, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 162, \"rating\": 100}",
						"{\"good\": 29, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 3, \"educational\": 6, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 10.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 163, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 164, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 165, \"rating\": 100}",
						"{\"good\": 53, \"park\": 19, \"cigarettes\": 11, \"alcohol\": 32, \"educational\": 22, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"Детский сад №100\", \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"Тверская государственная медицинская академия. Кафедра педиатрии\", \"street\": null}, {\"name\": \"Детский сад №40\", \"street\": null}, {\"name\": \"ГУ СКОШ № 1\", \"street\": \"улица Крылова\"}, {\"name\": \"Кванториум\", \"street\": null}, {\"name\": \"Детский сад № 74\", \"street\": null}, {\"name\": \"Детский сад № 140\", \"street\": null}, {\"name\": \"Школа №35\", \"street\": null}, {\"name\": null, \"street\": \"улица Салтыкова-Щедрина\"}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": \"Школа № 3\", \"street\": null}, {\"name\": \"Детский сад № 127\", \"street\": null}, {\"name\": \"Школа № 16\", \"street\": null}, {\"name\": \"Детский сад № 8\", \"street\": null}, {\"name\": \"Детская школа искусств №1 имени М.П.Мусоргского\", \"street\": null}, {\"name\": \"Тверской государственный университет\", \"street\": null}]}, \"bad\": 45, \"positive\": -18.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Тверской торгово-экономический колледж\", \"street\": null, \"bad\": \"Вкус и цвет, 5, набережная Степана Разина, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет\", \"street\": \"набережная Афанасия Никитина\", \"bad\": \"Beerlogic, 24, набережная Афанасия Никитина, Заволжский район, Tver, Tver Oblast, Central Federal District, 170026, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Chicken House, 20, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Coffee Point, 25, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Black Star Burger, 18, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 166, \"rating\": 0}",
						"{\"good\": 18, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 167, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 168, \"rating\": 40}",
						"{\"good\": 9, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 169, \"rating\": 100}",
						"{\"good\": 40, \"park\": 11, \"cigarettes\": 4, \"alcohol\": 6, \"educational\": 22, \"transport\": {\"len\": 13, \"data\": [{\"name\": \"Тверская государственная медицинская академия. Кафедра педиатрии\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад \\\"Я и моя семья\\\"\", \"street\": null}, {\"name\": \"Российская академия народного хозяйства и государственной службы при Президенте РФ\", \"street\": null}, {\"name\": null, \"street\": \"улица Салтыкова-Щедрина\"}, {\"name\": \"ТОИУУ\", \"street\": null}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": \"Детский сад № 135\", \"street\": null}, {\"name\": \"Детский сад № 8\", \"street\": null}, {\"name\": \"Детская школа искусств №1 имени М.П.Мусоргского\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской колледж транспорта и сервиса\", \"street\": null}, {\"name\": \"Тверской политехнический колледж\", \"street\": null}]}, \"bad\": 16, \"positive\": 4.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Гимназия № 10\", \"street\": null, \"bad\": \"Московская улица, Московский район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 170, \"rating\": 60}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 171, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 172, \"rating\": 40}",
						"{\"good\": 36, \"park\": 8, \"cigarettes\": 2, \"alcohol\": 5, \"educational\": 15, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 173, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 174, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 175, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 176, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 177, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 178, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 179, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 180, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 181, \"rating\": 40}",
						"{\"good\": 32, \"park\": 14, \"cigarettes\": 0, \"alcohol\": 6, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": 9.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 182, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 183, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 184, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 185, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 186, \"rating\": 40}",
						"{\"good\": 21, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 187, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 188, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 189, \"rating\": 40}",
						"{\"good\": 8, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 190, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 191, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 192, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 193, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 194, \"rating\": 40}",
						"{\"good\": 58, \"park\": 11, \"cigarettes\": 2, \"alcohol\": 8, \"educational\": 23, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 11, \"positive\": 18.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 195, \"rating\": 100}",
						"{\"good\": 4, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 196, \"rating\": 100}",
						"{\"good\": 26, \"park\": 5, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 14, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"Школа № 5, дошкольное отделение\", \"street\": \"Тракторная улица\"}, {\"name\": \"Пониматика\", \"street\": null}, {\"name\": \"Детский сад № 144\", \"street\": null}, {\"name\": null, \"street\": \"улица Степана Горобца\"}, {\"name\": \"Детский сад № 50 (167)\", \"street\": null}]}, \"bad\": 3, \"positive\": 10.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 197, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 198, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 199, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 200, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 201, \"rating\": 40}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 202, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 203, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 204, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 205, \"rating\": 40}",
						"{\"good\": 45, \"park\": 4, \"cigarettes\": 8, \"alcohol\": 17, \"educational\": 27, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"ТИЭМ\", \"street\": null}, {\"name\": \"Учебно-информационный центр \\\"Просвет\\\"\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"Детский сад № 168 \\\"Чебурашка\\\"\", \"street\": null}, {\"name\": \"Детский сад № 67\", \"street\": null}, {\"name\": \"Детский сад № 23\", \"street\": null}, {\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 159\", \"street\": null}, {\"name\": \"Школа №43\", \"street\": null}, {\"name\": \"Детский сад № 148\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 137\", \"street\": \"Зелёный проезд\"}, {\"name\": null, \"street\": null}, {\"name\": \"Открытая (сменная) школа № 5\", \"street\": null}, {\"name\": \"Детский сад № 90\", \"street\": null}]}, \"bad\": 22, \"positive\": 0.5, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад № 23\", \"street\": null, \"bad\": \"Лит.Ра, 8 к2, улица Резинстроя, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170008, Russia\"}, {\"name\": \"Школа № 26\", \"street\": null, \"bad\": \"Милано, 46/30, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170037, Russia\"}, {\"name\": \"Тверской технологический колледж\", \"street\": null, \"bad\": \"ВыгоДА, 34, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170008, Russia\"}]}, \"index\": 206, \"rating\": 60}",
						"{\"good\": 12, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 207, \"rating\": 100}",
						"{\"good\": 24, \"park\": 4, \"cigarettes\": 0, \"alcohol\": 5, \"educational\": 20, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Художественная школа им. В.А. Серова\", \"street\": null}, {\"name\": \"Детский сад № 89\", \"street\": null}, {\"name\": \"Дошкольное отделение СОШ №4\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null}, {\"name\": \"Тверской полиграфический колледж\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 7, \"positive\": 5.0, \"violations\": {\"len\": 3, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Школа № 30\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"21, проспект Ленина, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}]}, \"index\": 208, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 209, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 210, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 211, \"rating\": 40}",
						"{\"good\": 26, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 5, \"educational\": 10, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null}, {\"name\": \"Пониматика\", \"street\": null}, {\"name\": \"Детский сад №169 \\\"Умка\\\"\", \"street\": null}, {\"name\": \"Детский сад №141\", \"street\": null}, {\"name\": \"МОУ Центр образования №49\", \"street\": null}, {\"name\": null, \"street\": \"улица Степана Горобца\"}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"Тверской педагогический колледж\", \"street\": null}]}, \"bad\": 12, \"positive\": 1.0, \"violations\": {\"len\": 2, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null, \"bad\": \"Red&White, 25 к1, Оснабрюкская улица, Брусилово, Мамулино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170027, Russia\"}, {\"name\": \"Росток\", \"street\": null, \"bad\": \"Beerlogic, 99, Октябрьский проспект, Южный, Московский район, Tver, Tver Oblast, Central Federal District, 170043, Russia\"}]}, \"index\": 212, \"rating\": 60}",
						"{\"good\": 2, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 213, \"rating\": 40}",
						"{\"good\": 10, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 5, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 214, \"rating\": 40}",
						"{\"good\": 29, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 17, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 215, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 216, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 217, \"rating\": 100}",
						"{\"good\": 33, \"park\": 5, \"cigarettes\": 1, \"alcohol\": 6, \"educational\": 19, \"transport\": {\"len\": 10, \"data\": [{\"name\": \"Детский сад № 26\", \"street\": null}, {\"name\": \"Профессиональное училище № 6\", \"street\": null}, {\"name\": \"Школа № 15\", \"street\": null}, {\"name\": \"Детский сад № 130\", \"street\": \"улица Веселова\"}, {\"name\": \"Детский сад № 39\", \"street\": null}, {\"name\": \"Школа № 40, филиал\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}, {\"name\": \"Детский сад № 138\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 8, \"positive\": 8.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад № 138\", \"street\": null, \"bad\": \"Литра, 47, Петербургское шоссе, Юность, Заволжский район, Tver, Tver Oblast, Central Federal District, 170020, Russia\"}]}, \"index\": 218, \"rating\": 60}",
						"{\"good\": 9, \"park\": 4, \"cigarettes\": 2, \"alcohol\": 3, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": -5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 219, \"rating\": 40}",
						"{\"good\": 8, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 220, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 221, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 222, \"rating\": 100}",
						"{\"good\": 47, \"park\": 9, \"cigarettes\": 7, \"alcohol\": 10, \"educational\": 23, \"transport\": {\"len\": 17, \"data\": [{\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Школа № 27\", \"street\": null}, {\"name\": \"Детский сад №142\", \"street\": null}, {\"name\": \"Школа №55\", \"street\": null}, {\"name\": \"Детский сад №132\", \"street\": null}, {\"name\": \"Детский сад № 114\", \"street\": null}, {\"name\": \"Детский сад №151\", \"street\": null}, {\"name\": \"Школа № 33\", \"street\": null}, {\"name\": \"Гимназия №44\", \"street\": null}, {\"name\": \"Школа №48\", \"street\": null}, {\"name\": \"Школа №45\", \"street\": null}, {\"name\": \"Детский сад №55\", \"street\": null}, {\"name\": \"Тверской педагогический колледж\", \"street\": null}, {\"name\": \"Детский сад № 137\", \"street\": \"Зелёный проезд\"}, {\"name\": \"Открытая (сменная) школа № 5\", \"street\": null}, {\"name\": \"Школа № 39\", \"street\": null}]}, \"bad\": 12, \"positive\": 11.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 223, \"rating\": 100}",
						"{\"good\": 29, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 13, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 9.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 224, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 225, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 226, \"rating\": 100}",
						"{\"good\": 9, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 227, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 228, \"rating\": 40}",
						"{\"good\": 15, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 8, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"ГКОУ \\\"Тверская школа №4\\\"\", \"street\": null}, {\"name\": \"Школа №34\", \"street\": null}, {\"name\": \"Тверской машиностроительный колледж\", \"street\": null}, {\"name\": \"Детский сад № 154\", \"street\": null}, {\"name\": \"Школа №29\", \"street\": \"переулок Никитина\"}]}, \"bad\": 1, \"positive\": 6.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 229, \"rating\": 100}",
						"{\"good\": 73, \"park\": 17, \"cigarettes\": 2, \"alcohol\": 7, \"educational\": 25, \"transport\": {\"len\": 16, \"data\": [{\"name\": \"ГКОУ \\\"Тверская школа №4\\\"\", \"street\": null}, {\"name\": \"Детский сад № 122\", \"street\": null}, {\"name\": \"Тверской филиал Московского гуманитарно-экономического института\", \"street\": null}, {\"name\": \"Детский сад № 164\", \"street\": null}, {\"name\": \"Школа № 18\", \"street\": null}, {\"name\": \"Детский сад №94 \\\"Солнышко\\\"\", \"street\": null}, {\"name\": \"Детский сад №96 \\\"Золотой ключик\\\"\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №10\", \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Тверской машиностроительный колледж\", \"street\": null}, {\"name\": \"Детский сад № 154\", \"street\": null}, {\"name\": \"Детский сад №19\", \"street\": null}, {\"name\": \"Детский сад № 11\", \"street\": null}, {\"name\": \"Детский сад № 80\", \"street\": null}, {\"name\": \"Школа №29\", \"street\": \"переулок Никитина\"}]}, \"bad\": 16, \"positive\": 20.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Тверской филиал Московского гуманитарно-экономического института\", \"street\": null, \"bad\": \"37, улица Дмитрия Донского, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}, {\"name\": \"Детский сад № 7\", \"street\": null, \"bad\": \"Ароматный мир, 28, улица Софьи Перовской, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}, {\"name\": \"Бывшее Тверское Суворовское военное училище\", \"street\": null, \"bad\": \"Суворов, набережная реки Тьмаки, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}, {\"name\": \"Школа № 18\", \"street\": null, \"bad\": \"Ласточка, 54, Учительская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Ароматный мир, 13, улица Мусоргского, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}]}, \"index\": 230, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 231, \"rating\": 40}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 232, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 233, \"rating\": 40}",
						"{\"good\": 10, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 234, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 235, \"rating\": 40}",
						"{\"good\": 10, \"park\": 2, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 236, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 237, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 238, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Дмитрово-черкасский детский сад\", \"street\": null}, {\"name\": null, \"street\": \"улица Громова\"}, {\"name\": null, \"street\": null}]}, \"bad\": 3, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 239, \"rating\": 40}",
						"{\"good\": 39, \"park\": 7, \"cigarettes\": 2, \"alcohol\": 9, \"educational\": 19, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 12, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 240, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 241, \"rating\": 40}",
						"{\"good\": 71, \"park\": 32, \"cigarettes\": 9, \"alcohol\": 25, \"educational\": 26, \"transport\": {\"len\": 16, \"data\": [{\"name\": \"ГКОУ \\\"Тверская школа №4\\\"\", \"street\": null}, {\"name\": \"Детский сад №100\", \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"Тверская государственная медицинская академия. Кафедра педиатрии\", \"street\": null}, {\"name\": \"Тверской художественный колледж им. Венецианова\", \"street\": null}, {\"name\": \"Детская музыкальная школа\", \"street\": null}, {\"name\": \"Детский сад № 74\", \"street\": null}, {\"name\": \"Детский сад № 140\", \"street\": null}, {\"name\": \"Школа №35\", \"street\": null}, {\"name\": \"Школа № 3\", \"street\": null}, {\"name\": \"Детский сад № 127\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Тверской машиностроительный колледж\", \"street\": null}, {\"name\": \"Школа № 16\", \"street\": null}]}, \"bad\": 34, \"positive\": 1.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Тверской торгово-экономический колледж\", \"street\": null, \"bad\": \"Вкус и цвет, 5, набережная Степана Разина, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Детская музыкальная школа\", \"street\": null, \"bad\": \"Ароматный мир, 13, улица Мусоргского, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет\", \"street\": \"набережная Афанасия Никитина\", \"bad\": \"Beerlogic, 24, набережная Афанасия Никитина, Заволжский район, Tver, Tver Oblast, Central Federal District, 170026, Russia\"}, {\"name\": \"Детский сад № 81\", \"street\": null, \"bad\": \"Пиво/сигареты, бульвар Шмидта, Соминка, Заволжский район, Tver, Tver Oblast, Central Federal District, 170042, Russia\"}, {\"name\": \"Детский сад № 81\", \"street\": null, \"bad\": \"бульвар Шмидта, Соминка, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Ароматный мир, 13, улица Мусоргского, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}]}, \"index\": 242, \"rating\": 60}",
						"{\"good\": 19, \"park\": 1, \"cigarettes\": 3, \"alcohol\": 4, \"educational\": 6, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ СШ №19\", \"street\": null}]}, \"bad\": 5, \"positive\": 4.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null, \"bad\": \"улица Громова, Мигалово, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170009, Russia\"}]}, \"index\": 243, \"rating\": 60}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 244, \"rating\": 100}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 245, \"rating\": 100}",
						"{\"good\": 13, \"park\": 3, \"cigarettes\": 4, \"alcohol\": 5, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 6, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 246, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 247, \"rating\": 40}",
						"{\"good\": 26, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 13, \"transport\": {\"len\": 9, \"data\": [{\"name\": null, \"street\": \"улица Седова\"}, {\"name\": \"Школа № 7\", \"street\": null}, {\"name\": \"Школа № 15\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Школа № 50\", \"street\": null}, {\"name\": \"Детский сад № 145\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Частная школа \\\"Animus-Liber\\\"\", \"street\": null}, {\"name\": null, \"street\": null}]}, \"bad\": 6, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 248, \"rating\": 100}",
						"{\"good\": 87, \"park\": 6, \"cigarettes\": 14, \"alcohol\": 27, \"educational\": 43, \"transport\": {\"len\": 28, \"data\": [{\"name\": \"Детский сад № 101\", \"street\": null}, {\"name\": \"ТИЭМ\", \"street\": null}, {\"name\": \"Учебно-информационный центр \\\"Просвет\\\"\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"ТОИУУ\", \"street\": null}, {\"name\": \"Детский сад № 67\", \"street\": null}, {\"name\": \"Детский сад № 2\", \"street\": null}, {\"name\": \"Детский сад № 23\", \"street\": null}, {\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": \"Детский сад № 116\", \"street\": null}, {\"name\": \"Детский сад № 159\", \"street\": null}, {\"name\": \"Школа №43\", \"street\": null}, {\"name\": \"Детский сад № 148\", \"street\": null}, {\"name\": \"Детский сад №15\", \"street\": null}, {\"name\": \"Дошкольное отделение школы №33\", \"street\": null}, {\"name\": \"Детский сад № 114\", \"street\": null}, {\"name\": \"Детский сад № 105\", \"street\": null}, {\"name\": \"Школа № 33\", \"street\": null}, {\"name\": \"Детский сад № 33\", \"street\": null}, {\"name\": \"Детский сад № 1\", \"street\": null}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": \"Тверской кооперативный техникум\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Открытая (сменная) школа № 5\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 90\", \"street\": null}, {\"name\": \"Школа № 39\", \"street\": null}]}, \"bad\": 35, \"positive\": 8.5, \"violations\": {\"len\": 8, \"data\": [{\"name\": \"Детский сад № 23\", \"street\": null, \"bad\": \"Лит.Ра, 8 к2, улица Резинстроя, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170008, Russia\"}, {\"name\": \"Детский сад №15\", \"street\": null, \"bad\": \"улица Фадеева, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Детский сад №15\", \"street\": null, \"bad\": \"улица Терещенко, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Детский сад № 114\", \"street\": null, \"bad\": \"Овощи, улица Фадеева, Южный, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 33\", \"street\": null, \"bad\": \"Ипподромная улица, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 36\", \"street\": null, \"bad\": \"Restro Boom, Волоколамский проспект, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": \"Школа № 26\", \"street\": null, \"bad\": \"Милано, 46/30, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170037, Russia\"}, {\"name\": \"Тверской технологический колледж\", \"street\": null, \"bad\": \"ВыгоДА, 34, проспект Победы, Чайка, Московский район, Tver, Tver Oblast, Central Federal District, 170008, Russia\"}]}, \"index\": 249, \"rating\": 60}",
						"{\"good\": 31, \"park\": 10, \"cigarettes\": 1, \"alcohol\": 7, \"educational\": 16, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 12, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 250, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 251, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 252, \"rating\": 40}",
						"{\"good\": 6, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 253, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 254, \"rating\": 40}",
						"{\"good\": 33, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 7, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null}, {\"name\": \"Пониматика\", \"street\": null}, {\"name\": null, \"street\": \"улица Степана Горобца\"}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования \\\"Брусилово\\\"\", \"street\": null}]}, \"bad\": 5, \"positive\": 11.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null, \"bad\": \"Red&White, 25 к1, Оснабрюкская улица, Брусилово, Мамулино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170027, Russia\"}]}, \"index\": 255, \"rating\": 60}",
						"{\"good\": 4, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 256, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 257, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 258, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 259, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 260, \"rating\": 100}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 261, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 262, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 263, \"rating\": 100}",
						"{\"good\": 28, \"park\": 3, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 11, \"transport\": {\"len\": 7, \"data\": [{\"name\": \"Детский сад № 130\", \"street\": \"улица Веселова\"}, {\"name\": \"Школа № 21\", \"street\": null}, {\"name\": \"Школа № 21\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}, {\"name\": \"Детский сад № 5\", \"street\": null}, {\"name\": \"Школа №29\", \"street\": \"переулок Никитина\"}]}, \"bad\": 0, \"positive\": 14.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 264, \"rating\": 100}",
						"{\"good\": 25, \"park\": 5, \"cigarettes\": 4, \"alcohol\": 6, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 265, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 266, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 267, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 268, \"rating\": 40}",
						"{\"good\": 25, \"park\": 7, \"cigarettes\": 3, \"alcohol\": 8, \"educational\": 22, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (корпус Б)\", \"street\": null}, {\"name\": \"Художественная школа им. В.А. Серова\", \"street\": null}, {\"name\": \"Детский сад № 89\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №79\", \"street\": null}, {\"name\": \"Тверской полиграфический колледж\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 124\", \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}]}, \"bad\": 12, \"positive\": 0.5, \"violations\": {\"len\": 6, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Школа № 30\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"21, проспект Ленина, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}]}, \"index\": 269, \"rating\": 60}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 270, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 271, \"rating\": 100}",
						"{\"good\": 18, \"park\": 5, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 6, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 272, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 273, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 274, \"rating\": 40}",
						"{\"good\": 12, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 5, \"educational\": 6, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 275, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 276, \"rating\": 40}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 277, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 278, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 279, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 280, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 281, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 282, \"rating\": 40}",
						"{\"good\": 32, \"park\": 13, \"cigarettes\": 4, \"alcohol\": 8, \"educational\": 13, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Детский сад №100\", \"street\": null}, {\"name\": \"Детский сад № 74\", \"street\": null}, {\"name\": \"Детский сад № 140\", \"street\": null}, {\"name\": \"Школа №35\", \"street\": null}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": \"Школа № 3\", \"street\": null}, {\"name\": \"Детский сад № 127\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": \"Детский сад №125\", \"street\": null}]}, \"bad\": 8, \"positive\": 8.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Тверской Государственный Технический Университет\", \"street\": \"набережная Афанасия Никитина\", \"bad\": \"Beerlogic, 24, набережная Афанасия Никитина, Заволжский район, Tver, Tver Oblast, Central Federal District, 170026, Russia\"}]}, \"index\": 283, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 284, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 285, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 286, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 287, \"rating\": 40}",
						"{\"good\": 4, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 288, \"rating\": 40}",
						"{\"good\": 113, \"park\": 29, \"cigarettes\": 10, \"alcohol\": 39, \"educational\": 42, \"transport\": {\"len\": 30, \"data\": [{\"name\": \"Тверская государственная медицинская академия. Кафедра педиатрии\", \"street\": null}, {\"name\": \"Детский сад №40\", \"street\": null}, {\"name\": \"Российский заочный институт текстильной и лёгкой промышленности\", \"street\": null}, {\"name\": \"Детский сад № 101\", \"street\": null}, {\"name\": \"ТИЭМ\", \"street\": null}, {\"name\": \"Учебно-информационный центр \\\"Просвет\\\"\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Международный институт экономики и права\", \"street\": null}, {\"name\": \"ГУ СКОШ № 1\", \"street\": \"улица Крылова\"}, {\"name\": \"Кванториум\", \"street\": null}, {\"name\": \"Тверской государственный медицинский университет\", \"street\": null}, {\"name\": null, \"street\": \"улица Салтыкова-Щедрина\"}, {\"name\": \"ТОИУУ\", \"street\": null}, {\"name\": \"Детский сад № 2\", \"street\": null}, {\"name\": \"Школа № 14\", \"street\": null}, {\"name\": \"Детский сад № 1\", \"street\": null}, {\"name\": \"Школа № 36\", \"street\": null}, {\"name\": \"Детский сад № 63\", \"street\": null}, {\"name\": null, \"street\": \"площадь Славы\"}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": \"Детский сад № 135\", \"street\": null}, {\"name\": \"Многопрофильная гимназия №12\", \"street\": null}, {\"name\": \"Музыкальная школа имени М. П. Мусоргского\", \"street\": null}, {\"name\": \"Детский сад № 134\", \"street\": null}, {\"name\": \"Детский сад № 8\", \"street\": null}, {\"name\": \"Детская школа искусств №1 имени М.П.Мусоргского\", \"street\": null}, {\"name\": \"Тверской колледж транспорта и сервиса\", \"street\": null}, {\"name\": \"Тверской технологический колледж\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской государственный университет\", \"street\": null}]}, \"bad\": 63, \"positive\": -6.5, \"violations\": {\"len\": 19, \"data\": [{\"name\": \"Гимназия № 10\", \"street\": null, \"bad\": \"Московская улица, Московский район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Школа № 36\", \"street\": null, \"bad\": \"Restro Boom, Волоколамский проспект, Московский район, Tver, Tver Oblast, Central Federal District, 170033, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Люблин Хмель, улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"KFC, 2, Тверской проспект, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Burger King, 2, Тверской проспект, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Папа жарит мясо, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Chicken House, 20, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Столовая ТвГУ, 46, Симеоновская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Coffee Point, 25, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Black Star Burger, 18, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 289, \"rating\": 0}",
						"{\"good\": 26, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 12, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 9.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 290, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 291, \"rating\": 40}",
						"{\"good\": 19, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 292, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 293, \"rating\": 100}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 294, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 295, \"rating\": 100}",
						"{\"good\": 48, \"park\": 10, \"cigarettes\": 7, \"alcohol\": 14, \"educational\": 26, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 20, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 296, \"rating\": 100}",
						"{\"good\": 16, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 6.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 297, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 298, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 299, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 300, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 301, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 302, \"rating\": 100}",
						"{\"good\": 40, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 12, \"transport\": {\"len\": 10, \"data\": [{\"name\": \"Тверской филиал Московского гуманитарно-экономического института\", \"street\": null}, {\"name\": \"Детский сад № 130\", \"street\": \"улица Веселова\"}, {\"name\": \"Бывшее Тверское Суворовское военное училище\", \"street\": null}, {\"name\": \"Школа № 18\", \"street\": null}, {\"name\": \"Школа № 21\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад №10\", \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}, {\"name\": \"Детский сад №19\", \"street\": null}, {\"name\": \"Школа №29\", \"street\": \"переулок Никитина\"}]}, \"bad\": 2, \"positive\": 18.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Тверской филиал Московского гуманитарно-экономического института\", \"street\": null, \"bad\": \"37, улица Дмитрия Донского, Центральный район, Tver, Tver Oblast, Central Federal District, 170006, Russia\"}]}, \"index\": 303, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 304, \"rating\": 40}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": -3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 305, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 306, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 307, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 308, \"rating\": 40}",
						"{\"good\": 11, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 309, \"rating\": 100}",
						"{\"good\": 44, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 18, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Детский сад № 26\", \"street\": null}, {\"name\": \"Профессиональное училище № 6\", \"street\": null}, {\"name\": null, \"street\": \"улица Седова\"}, {\"name\": \"Детский сад № 130\", \"street\": \"улица Веселова\"}, {\"name\": \"Гимназия № 8\", \"street\": null}, {\"name\": \"Школа № 50\", \"street\": null}, {\"name\": \"Детский сад № 145\", \"street\": null}, {\"name\": \"Школа № 40, филиал\", \"street\": null}, {\"name\": \"Детский сад № 161\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}, {\"name\": \"Детский сад № 138\", \"street\": null}]}, \"bad\": 6, \"positive\": 16.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Детский сад № 138\", \"street\": null, \"bad\": \"Литра, 47, Петербургское шоссе, Юность, Заволжский район, Tver, Tver Oblast, Central Federal District, 170020, Russia\"}]}, \"index\": 310, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 311, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 312, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 313, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 314, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 315, \"rating\": 40}",
						"{\"good\": 9, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 4, \"educational\": 7, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Замок детства\", \"street\": null}, {\"name\": \"Детский сад № 158\", \"street\": null}, {\"name\": \"Детский сад № 157\", \"street\": null}, {\"name\": \"Школа № 14\", \"street\": null}, {\"name\": null, \"street\": \"улица Степана Горобца\"}]}, \"bad\": 5, \"positive\": -0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 316, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 2, \"data\": [{\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": \"Детский сад № 137\", \"street\": \"Зелёный проезд\"}]}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 317, \"rating\": 100}",
						"{\"good\": 14, \"park\": 4, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 9, \"transport\": {\"len\": 3, \"data\": [{\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"Школа № 5, дошкольное отделение\", \"street\": \"Тракторная улица\"}, {\"name\": \"Детский сад №11\", \"street\": null}]}, \"bad\": 2, \"positive\": 5.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 318, \"rating\": 100}",
						"{\"good\": 21, \"park\": 2, \"cigarettes\": 1, \"alcohol\": 2, \"educational\": 12, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 7.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 319, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 320, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 321, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 322, \"rating\": 100}",
						"{\"good\": 12, \"park\": 3, \"cigarettes\": 5, \"alcohol\": 7, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 323, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 324, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 325, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 326, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 327, \"rating\": 40}",
						"{\"good\": 19, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 328, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 329, \"rating\": 100}",
						"{\"good\": 114, \"park\": 19, \"cigarettes\": 10, \"alcohol\": 27, \"educational\": 47, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 37, \"positive\": 20.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 330, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 331, \"rating\": 100}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 332, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 333, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 334, \"rating\": 100}",
						"{\"good\": 31, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 4, \"educational\": 8, \"transport\": {\"len\": 6, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null}, {\"name\": \"Пониматика\", \"street\": null}, {\"name\": null, \"street\": \"улица Степана Горобца\"}, {\"name\": \"Детский сад № 50 (167)\", \"street\": null}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования \\\"Брусилово\\\"\", \"street\": null}]}, \"bad\": 5, \"positive\": 10.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null, \"bad\": \"Red&White, 25 к1, Оснабрюкская улица, Брусилово, Мамулино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170027, Russia\"}]}, \"index\": 335, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 336, \"rating\": 40}",
						"{\"good\": 11, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 6, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 337, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 338, \"rating\": 40}",
						"{\"good\": 25, \"park\": 1, \"cigarettes\": 4, \"alcohol\": 5, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": 5.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 339, \"rating\": 100}",
						"{\"good\": 12, \"park\": 3, \"cigarettes\": 4, \"alcohol\": 5, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 7, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 340, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 341, \"rating\": 100}",
						"{\"good\": 28, \"park\": 8, \"cigarettes\": 4, \"alcohol\": 7, \"educational\": 19, \"transport\": {\"len\": 12, \"data\": [{\"name\": \"Тверская государственная медицинская академия. Кафедра педиатрии\", \"street\": null}, {\"name\": \"Российская академия народного хозяйства и государственной службы при Президенте РФ\", \"street\": null}, {\"name\": \"ГУ СКОШ № 1\", \"street\": \"улица Крылова\"}, {\"name\": null, \"street\": \"улица Салтыкова-Щедрина\"}, {\"name\": \"Детский сад №36\", \"street\": null}, {\"name\": \"Школа № 3\", \"street\": null}, {\"name\": null, \"street\": \"площадь Славы\"}, {\"name\": \"Детский сад № 135\", \"street\": null}, {\"name\": \"Музыкальная школа имени М. П. Мусоргского\", \"street\": null}, {\"name\": \"Детский сад № 8\", \"street\": null}, {\"name\": \"Детская школа искусств №1 имени М.П.Мусоргского\", \"street\": null}, {\"name\": \"Военная академия воздушно-космической обороны имени Г.К. Жукова\", \"street\": null}]}, \"bad\": 10, \"positive\": 4.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Гимназия № 10\", \"street\": null, \"bad\": \"Московская улица, Московский район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 342, \"rating\": 60}",
						"{\"good\": 3, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 343, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 344, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 345, \"rating\": 40}",
						"{\"good\": 37, \"park\": 7, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 10, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 10, \"positive\": 8.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 346, \"rating\": 100}",
						"{\"good\": 26, \"park\": 7, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 16, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 5, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 347, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 348, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 349, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 350, \"rating\": 40}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 351, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 352, \"rating\": 100}",
						"{\"good\": 48, \"park\": 16, \"cigarettes\": 3, \"alcohol\": 11, \"educational\": 23, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 22, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 353, \"rating\": 100}",
						"{\"good\": 25, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 9, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 354, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 355, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 356, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 357, \"rating\": 40}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 358, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 359, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 360, \"rating\": 40}",
						"{\"good\": 11, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 361, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 362, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 363, \"rating\": 40}",
						"{\"good\": 85, \"park\": 14, \"cigarettes\": 7, \"alcohol\": 18, \"educational\": 31, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 24, \"positive\": 18.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 364, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 365, \"rating\": 40}",
						"{\"good\": 89, \"park\": 26, \"cigarettes\": 8, \"alcohol\": 38, \"educational\": 24, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 64, \"positive\": -19.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 366, \"rating\": 40}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 367, \"rating\": 100}",
						"{\"good\": 28, \"park\": 8, \"cigarettes\": 4, \"alcohol\": 5, \"educational\": 20, \"transport\": {\"len\": 9, \"data\": [{\"name\": \"Детский сад №107\", \"street\": null}, {\"name\": \"НОУ \\\"Тверская епархиальная православная средняя общеобразовательная школа во имя свт. Тихона Задонского\\\"\", \"street\": null}, {\"name\": \"Школа № 5, дошкольное отделение\", \"street\": \"Тракторная улица\"}, {\"name\": \"Детский сад № 144\", \"street\": null}, {\"name\": \"Школа № 38\", \"street\": null}, {\"name\": \"Детский сад № 24\", \"street\": null}, {\"name\": \"Детский сад № 111\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Специальная коррекционная общеобразовательная школа №2\", \"street\": null}]}, \"bad\": 9, \"positive\": 5.0, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Тверской Государственный Технический Университет (учебный корпус)\", \"street\": null, \"bad\": \"улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}, {\"name\": \"Школа № 30\", \"street\": null, \"bad\": \"Пицца-Слэк, 12 к1, улица Маршала Конева, Общежитие Технического Университета, Борихино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170024, Russia\"}]}, \"index\": 368, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 369, \"rating\": 40}",
						"{\"good\": 16, \"park\": 3, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 7.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 370, \"rating\": 100}",
						"{\"good\": 6, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 371, \"rating\": 100}",
						"{\"good\": 1, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 372, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 373, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 374, \"rating\": 40}",
						"{\"good\": 9, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 4.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 375, \"rating\": 100}",
						"{\"good\": 4, \"park\": 2, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 376, \"rating\": 100}",
						"{\"good\": 46, \"park\": 8, \"cigarettes\": 5, \"alcohol\": 14, \"educational\": 32, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 25, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 377, \"rating\": 40}",
						"{\"good\": 11, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 2, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 378, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 4, \"positive\": -3.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 379, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 380, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 381, \"rating\": 100}",
						"{\"good\": 7, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 2.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 382, \"rating\": 100}",
						"{\"good\": 23, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 6, \"educational\": 11, \"transport\": {\"len\": 8, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null}, {\"name\": \"Замок детства\", \"street\": null}, {\"name\": \"Пониматика\", \"street\": null}, {\"name\": \"Детский сад №141\", \"street\": null}, {\"name\": \"МОУ Центр образования №49\", \"street\": null}, {\"name\": null, \"street\": \"улица Степана Горобца\"}, {\"name\": \"Детский сад №14\", \"street\": null}, {\"name\": \"МБОУ \\\"Центр образования \\\"Брусилово\\\"\", \"street\": null}]}, \"bad\": 8, \"positive\": 3.5, \"violations\": {\"len\": 1, \"data\": [{\"name\": \"Мамина радость - частный детский сад\", \"street\": null, \"bad\": \"Red&White, 25 к1, Оснабрюкская улица, Брусилово, Мамулино, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170027, Russia\"}]}, \"index\": 383, \"rating\": 60}",
						"{\"good\": 12, \"park\": 1, \"cigarettes\": 3, \"alcohol\": 3, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 3, \"positive\": 3.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 384, \"rating\": 100}",
						"{\"good\": 2, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 385, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 386, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 387, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 388, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 389, \"rating\": 100}",
						"{\"good\": 45, \"park\": 3, \"cigarettes\": 2, \"alcohol\": 7, \"educational\": 26, \"transport\": {\"len\": 15, \"data\": [{\"name\": \"Детский сад № 26\", \"street\": null}, {\"name\": null, \"street\": \"улица Седова\"}, {\"name\": \"Школа № 15\", \"street\": null}, {\"name\": \"Детский сад № 68\", \"street\": null}, {\"name\": \"Академия \\\"Знайка\\\"\", \"street\": null}, {\"name\": \"Тверской медицинский колледж\", \"street\": null}, {\"name\": \"Детский сад № 130\", \"street\": \"улица Веселова\"}, {\"name\": \"Школа № 50\", \"street\": null}, {\"name\": \"Детский сад № 39\", \"street\": null}, {\"name\": \"Детский сад № 145\", \"street\": null}, {\"name\": \"Школа № 21\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 27\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Частная школа \\\"Animus-Liber\\\"\", \"street\": null}]}, \"bad\": 11, \"positive\": 11.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 390, \"rating\": 100}",
						"{\"good\": 15, \"park\": 3, \"cigarettes\": 5, \"alcohol\": 7, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 9, \"positive\": -1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 391, \"rating\": 40}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 392, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 3, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 393, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 394, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 395, \"rating\": 40}",
						"{\"good\": 5, \"park\": 1, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 396, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 397, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 398, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 399, \"rating\": 40}",
						"{\"good\": 17, \"park\": 3, \"cigarettes\": 4, \"alcohol\": 7, \"educational\": 9, \"transport\": {\"len\": 5, \"data\": [{\"name\": \"Детский сад № 168 \\\"Чебурашка\\\"\", \"street\": null}, {\"name\": \"Школа-интернат № 2\", \"street\": \"улица Орджоникидзе\"}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 137\", \"street\": \"Зелёный проезд\"}, {\"name\": \"Открытая (сменная) школа № 5\", \"street\": null}]}, \"bad\": 7, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 400, \"rating\": 100}",
						"{\"good\": 5, \"park\": 0, \"cigarettes\": 2, \"alcohol\": 2, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 401, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 402, \"rating\": 100}",
						"{\"good\": 75, \"park\": 21, \"cigarettes\": 5, \"alcohol\": 12, \"educational\": 26, \"transport\": {\"len\": 18, \"data\": [{\"name\": \"ГКОУ \\\"Тверская школа №4\\\"\", \"street\": null}, {\"name\": \"Детский сад № 122\", \"street\": null}, {\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"Тверской художественный колледж им. Венецианова\", \"street\": null}, {\"name\": \"Детская музыкальная школа\", \"street\": null}, {\"name\": \"Детский сад № 164\", \"street\": null}, {\"name\": \"Детский сад № 74\", \"street\": null}, {\"name\": \"Школа № 46\", \"street\": null}, {\"name\": \"Детский сад № 140\", \"street\": null}, {\"name\": \"Школа №35\", \"street\": null}, {\"name\": \"Бывшее Тверское Суворовское военное училище\", \"street\": null}, {\"name\": \"Детский сад № 127\", \"street\": null}, {\"name\": \"Детский сад № 115\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Детский сад № 73\", \"street\": null}, {\"name\": \"Тверской машиностроительный колледж\", \"street\": null}, {\"name\": \"Детский сад № 154\", \"street\": null}, {\"name\": \"Школа №29\", \"street\": \"переулок Никитина\"}]}, \"bad\": 17, \"positive\": 20.5, \"violations\": {\"len\": 5, \"data\": [{\"name\": \"Тверской торгово-экономический колледж\", \"street\": null, \"bad\": \"Вкус и цвет, 5, набережная Степана Разина, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Детская музыкальная школа\", \"street\": null, \"bad\": \"Ароматный мир, 13, улица Мусоргского, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}, {\"name\": \"Детский сад № 81\", \"street\": null, \"bad\": \"Пиво/сигареты, бульвар Шмидта, Соминка, Заволжский район, Tver, Tver Oblast, Central Federal District, 170042, Russia\"}, {\"name\": \"Детский сад № 81\", \"street\": null, \"bad\": \"бульвар Шмидта, Соминка, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Ароматный мир, 13, улица Мусоргского, Заволжский район, Tver, Tver Oblast, Central Federal District, 170041, Russia\"}]}, \"index\": 403, \"rating\": 60}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 404, \"rating\": 40}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 405, \"rating\": 40}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 406, \"rating\": 100}",
						"{\"good\": 2, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 407, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 1.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 408, \"rating\": 100}",
						"{\"good\": 16, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 4, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 8.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 409, \"rating\": 100}",
						"{\"good\": 3, \"park\": 0, \"cigarettes\": 1, \"alcohol\": 1, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 1, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 410, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 411, \"rating\": 40}",
						"{\"good\": 54, \"park\": 8, \"cigarettes\": 3, \"alcohol\": 11, \"educational\": 18, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 15, \"positive\": 12.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 412, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 413, \"rating\": 40}",
						"{\"good\": 4, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 414, \"rating\": 100}",
						"{\"good\": 59, \"park\": 20, \"cigarettes\": 9, \"alcohol\": 28, \"educational\": 32, \"transport\": {\"len\": 20, \"data\": [{\"name\": \"Тверской торгово-экономический колледж\", \"street\": null}, {\"name\": \"Тверская государственная медицинская академия. Кафедра педиатрии\", \"street\": null}, {\"name\": \"Детский сад №40\", \"street\": null}, {\"name\": \"Детский сад \\\"Я и моя семья\\\"\", \"street\": null}, {\"name\": \"Российская академия народного хозяйства и государственной службы при Президенте РФ\", \"street\": null}, {\"name\": \"ГУ СКОШ № 1\", \"street\": \"улица Крылова\"}, {\"name\": \"Кванториум\", \"street\": null}, {\"name\": null, \"street\": \"улица Салтыкова-Щедрина\"}, {\"name\": \"ТОИУУ\", \"street\": null}, {\"name\": null, \"street\": \"площадь Славы\"}, {\"name\": \"Детский сад № 152\", \"street\": null}, {\"name\": \"Детский сад № 62\", \"street\": null}, {\"name\": \"Детский сад № 135\", \"street\": null}, {\"name\": \"Многопрофильная гимназия №12\", \"street\": null}, {\"name\": \"Музыкальная школа имени М. П. Мусоргского\", \"street\": null}, {\"name\": \"Школа № 16\", \"street\": null}, {\"name\": \"Детский сад № 8\", \"street\": null}, {\"name\": \"Детская школа искусств №1 имени М.П.Мусоргского\", \"street\": null}, {\"name\": null, \"street\": null}, {\"name\": \"Тверской государственный университет\", \"street\": null}]}, \"bad\": 52, \"positive\": -22.5, \"violations\": {\"len\": 19, \"data\": [{\"name\": \"Тверской торгово-экономический колледж\", \"street\": null, \"bad\": \"Вкус и цвет, 5, набережная Степана Разина, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Гимназия № 10\", \"street\": null, \"bad\": \"Московская улица, Московский район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Люблин Хмель, улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": null, \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"улица Жигарева, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"KFC, 2, Тверской проспект, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Vlavashe, 19, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Burger King, 2, Тверской проспект, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"МОУ Многопрофильная гимназия №12\", \"street\": null, \"bad\": \"Папа жарит мясо, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Chicken House, 20, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Калинин, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Red Oak, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Столовая ТвГУ, 46, Симеоновская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Coffee Point, 25, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Cinnabon, 29/25, улица Желябова, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}, {\"name\": \"Тверской государственный университет\", \"street\": null, \"bad\": \"Black Star Burger, 18, Трёхсвятская улица, Центральный район, Tver, Tver Oblast, Central Federal District, 170100, Russia\"}]}, \"index\": 415, \"rating\": 0}",
						"{\"good\": 18, \"park\": 1, \"cigarettes\": 4, \"alcohol\": 5, \"educational\": 6, \"transport\": {\"len\": 1, \"data\": [{\"name\": \"МБОУ СШ №19\", \"street\": null}]}, \"bad\": 6, \"positive\": 3.0, \"violations\": {\"len\": 1, \"data\": [{\"name\": null, \"street\": null, \"bad\": \"улица Громова, Мигалово, Пролетарский район, Tver, Tver Oblast, Central Federal District, 170009, Russia\"}]}, \"index\": 416, \"rating\": 60}",
						"{\"good\": 8, \"park\": 1, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 2, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 4.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 417, \"rating\": 100}",
						"{\"good\": 14, \"park\": 1, \"cigarettes\": 2, \"alcohol\": 6, \"educational\": 5, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 8, \"positive\": -1.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 418, \"rating\": 40}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 419, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 1, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 420, \"rating\": 100}",
						"{\"good\": 1, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 0, \"positive\": 0.5, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 421, \"rating\": 100}",
						"{\"good\": 0, \"park\": 0, \"cigarettes\": 0, \"alcohol\": 0, \"educational\": 0, \"transport\": {\"len\": 0, \"data\": []}, \"bad\": 2, \"positive\": -2.0, \"violations\": {\"len\": 0, \"data\": []}, \"index\": 422, \"rating\": 40}"
					],
					geo:[56.8584, 35.9006]
				}
			}
		}
	},
	methods: {
		$_clickTab(value){
			if(this.tab !== value){
				if (hexLayer) hexLayer.remove();
				this.$emit('changeTab',value)
			}
		},
		$_changeTab(){
			if (hexLayer) hexLayer.remove();
			map.setView(this.centerGeo, this.tab===0?10:14);
			if(this.tab){
				this.$nextTick(()=>{
					//map.on("zoomend", ()=>{this.updateMapDisplay()});
					//map.on("moveend", ()=>{this.updateMapDisplay()});
					this.updateMapDisplay();
				})
			}else{
				this.geometryGeoJSON = L.geoJSON();
				this.geometryGeoJSON.addTo(map);
				this.$props.data.forEach(item=>{
					/*weight: 2,
					opacity: 1,
					color: 'white',
					dashArray: '3',
					fillOpacity: 0.3,
					fillColor: '#ff0000'*/
					L.geoJSON(JSON.parse(item.geometry))
						.setStyle({fillColor :this.getColorByRating(item.rating),color:'#179273'})
						.on('click', (e) => {
							this.selectedPoint = item
							this.openSelectedPoint = true

							if(this.activeElementClick) this.activeElementClick.style=''
							this.activeElementClick=e.originalEvent.target
							this.activeElementClick.style='fill:blue;stroke:blue;'
						})
						.addTo(map);
				})
			}
		},
		computeAverageEdgeLengthInMeters: function(vertexLocations) {
			let totalLength = 0;
			let edgeCount = 0;
			for (let i = 1; i < vertexLocations.length; i++) {
				const [fromLat, fromLng] = vertexLocations[i - 1];
				const [toLat, toLng] = vertexLocations[i];
				const edgeDistance = GeoUtils.getDistanceOnEarthInMeters(fromLat, fromLng, toLat, toLng);
				totalLength += edgeDistance;
				edgeCount++;
			}
			return totalLength / edgeCount;
		},
		async updateMapDisplay(){
			if(this.tab === 1){
				map.dragging.disable();
				map.touchZoom.disable();
				map.doubleClickZoom.disable();
				map.scrollWheelZoom.disable();
				map.boxZoom.disable();
				map.keyboard.disable();

				this.openSelectedPoint = false
				this.selectedPoint = {good:0,educational:0,bad:0,alcohol:0,cigarettes:0,rating:0}
				if (hexLayer) hexLayer.remove();
				if (this.activeElementClick) this.activeElementClick.style='fill:blue;stroke:blue;'
				hexLayer = L.layerGroup().addTo(map);
				const { _southWest: sw, _northEast: ne} = map.getBounds();

				const boundsPolygon =[
					[ sw.lat, sw.lng ],
					[ ne.lat, sw.lng ],
					[ ne.lat, ne.lng ],
					[ sw.lat, ne.lng ],
					[ sw.lat, sw.lng ],
				];
				const h3s = polygonToCells(boundsPolygon,8);

				const dataSend=this.savedRequest[this.$props.city].send
				const resultRes = []
				h3s.forEach(item=>{
					dataSend.points.push(cellToLatLng(item))
				})
				const res = this.savedRequest[this.$props.city].res
				if(res){
					for(let item of res){
						resultRes.push(JSON.parse(item))
					}
				}
				resultRes.sort((a,b)=>{
					return a.index-b.index
				})
				for (let index in h3s) {

					const polygonLayer = L.layerGroup().addTo(hexLayer);

					const h3Bounds = cellToBoundary(h3s[index]);

					const averageEdgeLength = this.computeAverageEdgeLengthInMeters(h3Bounds);
					const h3Polygon = L.polygon(h3BoundsToPolygon(h3Bounds))
						.on('click', (e) => {
							if(this.activeElementClick) this.activeElementClick.style=''
							this.activeElementClick=e.originalEvent.target
							this.activeElementClick.style='fill:blue;stroke:blue;'
							if(resultRes[index]){
								this.selectedPoint = resultRes[index]
							}else{
								this.selectedPoint = {good:0,educational:0,bad:0,alcohol:0,cigarettes:0,rating:0}
							}
							this.openSelectedPoint = true
						})
						/*.bindTooltip(`
							ID: <b>${ h3s[index] }</b>
							<br />
							Длина ребра (m): <b>${ averageEdgeLength.toLocaleString() }</b>
							<br />
							Площадь (km^2): <b>${getHexagonAreaAvg(this.$props.size,UNITS.km2).toFixed(3)} </b>
							<br />
							`)*/
						.setStyle({fillColor :(resultRes[index]!==undefined?this.getColorByRating(resultRes[index].rating):''),color:(resultRes[index]!==undefined?this.getColorByRating(resultRes[index].rating):'')})
						.addTo(polygonLayer);

					// less SVG, otherwise perf is bad
					if (Math.random() > 0.8) {
						let svgElement = document.createElementNS("http://www.w3.org/2000/svg", "svg");
						svgElement.setAttribute('xmlns', "http://www.w3.org/2000/svg");
						svgElement.setAttribute('viewBox', "0 0 200 200");
						svgElement.innerHTML = `<text x="20" y="70" class="h3Text">${h3s[index]}</text>`;
						let svgElementBounds = h3Polygon.getBounds();
						L.svgOverlay(svgElement, svgElementBounds).addTo(polygonLayer);
					}
				}
			}
		},
		getColorByRating(rating){
			if(rating){
				if(rating<=40){
					return this.$root.colorStatus[1]
				}else{
					if(rating<=60){
						return this.$root.colorStatus[2]
					}else return this.$root.colorStatus[3]
				}
			}else return this.$root.colorStatus[0]
		}
	},

	mounted() {
		map = L.map(this.$props.idMap);

		L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', {
			minZoom: this.tab===0?1:12,
			maxZoom: this.tab===0?15:12,
			attribution: '&copy; <a href="https://openstreetmap.org/copyright">OpenStreetMap contributors</a>'
		}).addTo(map);
		L.layerGroup([]).addTo(map);
		if(this.tab === 0){
			const coords = JSON.parse(this.$props.data[0].geometry).features[0].geometry.coordinates[0][0]
			this.centerGeo[0]=coords[1];this.centerGeo[1]=coords[0];
		}else this.centerGeo=this.savedRequest[this.$props.city].geo
		//56.8584, 35.9006 - тверь
		//56.8519, 60.6122 - eкб
		//54.1902, 37.610 - тула
		this.$_changeTab()
	},
	watch:{
		'$props.size'(){
			if(this.tab === 1) this.updateMapDisplay()
		},
		'$props.city'(){
			if(this.tab === 1) {
				this.centerGeo=this.savedRequest[this.$props.city].geo
				map.setView(this.centerGeo, this.tab===0?10:14);
				this.updateMapDisplay()
			}
		}
	}
};
</script>

<style scoped>
	.fillScreen {
		max-width: 1050px;
		width: 100%;
		height: 620px;
		margin: auto;
	}
	.h3Text {
		font-size: 16pt;
		font-weight: bold;
	}
	.listTabs{
		display: flex;
	}
	.myTab{
		width: 150px;
		height: 50px;
		text-align: center;
		line-height: 50px;
		background-color: white;
		transition: .3s ease-in-out;
		color: #040034;
		font-size: 16px;
		box-shadow: 0 0 4px 0 rgba(0, 0, 0, 0.25);
		z-index: 1;
		cursor: pointer;
	}
	.listTabs .myTab:first-child{
		border-radius: 10px 10px 0 0;
	}
	.listTabs .myTab:last-child{
		border-radius: 10px 10px 0 0;
		position: relative;
		left: -5px;
	}
	.activeTab{
		z-index: 2;
		background-color: #179273;
		color: white;
	}


	.blockInfoData{
		display: flex;
		justify-content: space-between;
		column-gap: 20px;
		row-gap: 20px;
		margin: 20px 0;
		flex-wrap: wrap;
	}
	.greyBlock{
		width: calc(50% - 10px);
		padding: 20px 20px 15px 20px;
		border-radius: 10px;
		border: 1px solid #DEE2E6;
		height: fit-content;
	}
	.statusWithImg{
		display: flex;
		column-gap: 9px;
		color: #179273;
		font-size: 16px;
		font-weight: 700;
		line-height: 24px;
		margin-bottom: 25px;
	}
	.greyBlockPercent{
		color: #040034;
		font-size: 30px;
		font-weight: 700;
		line-height: 30px;
	}
	.legendColor{
		display: flex;
		margin-top: 20px;
		column-gap: 15px;
		align-items: center;
	}
	.legendColor div{
		display: flex;
		column-gap: 6px;
	}
	.legendColor .nameColor{
		color: #040034;
		font-size: 16px;
		line-height: 18px;
		white-space: nowrap;
	}
	.legendColor .colorBlock{
		width: 18px;
		height: 18px;
		border-radius: 18px;
	}
	.positionRelative{
		position: relative;
		overflow: hidden;
	}
	.showMore{
		font-size: 14px;
		line-height: 18px;
		width: fit-content;
		margin-left: auto;
		cursor: pointer;
		color: #040034;
	}
	.showMore img{
		margin-left: 5px;
		transition: .3s ease-in-out;
		transform: rotate(180deg);
	}
	.showMoreActive img{
		transform: rotate(0deg);
	}
	.transitionBlockText{
		max-height: 0;
		overflow: hidden;
		transition: 1s ease-in-out;
		margin-top: 25px;
	}
	.transitionBlockText li{
		color: #040034;
		font-size: 16px;
		line-height: 30px;
		margin-bottom: 10px;
	}
	.transitionBlockText li span{
		padding-right: 4px;
	}
	.showBlockText{
		max-height: 200px;
	}
	.titleName{
		color:#040034;
		margin-top: 20px;
		font-size: 16px;
		font-weight: 700;
	}
	@media (max-width: 768px) {
		.fillScreen{
			height: 500px;
			margin-top: 20px;
		}
	}
</style>